#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Announcement_Basic

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function Announcement_Basic.Announcement_Basic_C.ExecuteUbergraph_Announcement_Basic
// 0x0078 (0x0078 - 0x0000)
struct Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetContext_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortClientAnnouncement*                K2Node_Event_Announcement_1;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortClientAnnouncement_Basic*          K2Node_DynamicCast_AsFort_Client_Announcement_Basic; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue_1;                // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue_2;                // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetBrushResource_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortClientAnnouncement*                K2Node_Event_Announcement;                         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_CustomEvent_bNewInputType;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic) == 0x000008, "Wrong alignment on Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic");
static_assert(sizeof(Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic) == 0x000078, "Wrong size on Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic");
static_assert(offsetof(Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic, EntryPoint) == 0x000000, "Member 'Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic::EntryPoint' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic, Temp_byte_Variable) == 0x000014, "Member 'Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic, CallFunc_GetContext_ReturnValue) == 0x000018, "Member 'Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000020, "Member 'Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic, K2Node_Event_Announcement_1) == 0x000028, "Member 'Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic::K2Node_Event_Announcement_1' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic, K2Node_DynamicCast_AsFort_Client_Announcement_Basic) == 0x000030, "Member 'Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic::K2Node_DynamicCast_AsFort_Client_Announcement_Basic' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000039, "Member 'Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic, CallFunc_TextIsEmpty_ReturnValue) == 0x00003A, "Member 'Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic, CallFunc_TextIsEmpty_ReturnValue_1) == 0x00003B, "Member 'Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic::CallFunc_TextIsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic, CallFunc_TextIsEmpty_ReturnValue_2) == 0x00003C, "Member 'Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic::CallFunc_TextIsEmpty_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic, CallFunc_BooleanAND_ReturnValue) == 0x00003D, "Member 'Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic, CallFunc_GetBrushResource_ReturnValue) == 0x000040, "Member 'Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic::CallFunc_GetBrushResource_ReturnValue' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic, Temp_byte_Variable_1) == 0x000048, "Member 'Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic, CallFunc_IsValid_ReturnValue) == 0x000049, "Member 'Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic, K2Node_Event_Announcement) == 0x000050, "Member 'Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic::K2Node_Event_Announcement' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic, Temp_bool_Variable) == 0x000058, "Member 'Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic, Temp_byte_Variable_2) == 0x000059, "Member 'Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic, K2Node_Select_Default) == 0x00005A, "Member 'Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic, Temp_byte_Variable_3) == 0x00005B, "Member 'Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic, K2Node_CustomEvent_bNewInputType) == 0x00005C, "Member 'Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic::K2Node_CustomEvent_bNewInputType' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic, K2Node_CreateDelegate_OutputDelegate_1) == 0x000060, "Member 'Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic, Temp_bool_Variable_1) == 0x000070, "Member 'Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic, K2Node_Select_Default_1) == 0x000071, "Member 'Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic::K2Node_Select_Default_1' has a wrong offset!");

// Function Announcement_Basic.Announcement_Basic_C.OnInputMethodChanged
// 0x0001 (0x0001 - 0x0000)
struct Announcement_Basic_C_OnInputMethodChanged final
{
public:
	ECommonInputType                              bNewInputType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Announcement_Basic_C_OnInputMethodChanged) == 0x000001, "Wrong alignment on Announcement_Basic_C_OnInputMethodChanged");
static_assert(sizeof(Announcement_Basic_C_OnInputMethodChanged) == 0x000001, "Wrong size on Announcement_Basic_C_OnInputMethodChanged");
static_assert(offsetof(Announcement_Basic_C_OnInputMethodChanged, bNewInputType) == 0x000000, "Member 'Announcement_Basic_C_OnInputMethodChanged::bNewInputType' has a wrong offset!");

// Function Announcement_Basic.Announcement_Basic_C.AnnouncementStopped
// 0x0008 (0x0008 - 0x0000)
struct Announcement_Basic_C_AnnouncementStopped final
{
public:
	class AFortClientAnnouncement*                Param_Announcement;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Announcement_Basic_C_AnnouncementStopped) == 0x000008, "Wrong alignment on Announcement_Basic_C_AnnouncementStopped");
static_assert(sizeof(Announcement_Basic_C_AnnouncementStopped) == 0x000008, "Wrong size on Announcement_Basic_C_AnnouncementStopped");
static_assert(offsetof(Announcement_Basic_C_AnnouncementStopped, Param_Announcement) == 0x000000, "Member 'Announcement_Basic_C_AnnouncementStopped::Param_Announcement' has a wrong offset!");

// Function Announcement_Basic.Announcement_Basic_C.UpdateWidgetData
// 0x0008 (0x0008 - 0x0000)
struct Announcement_Basic_C_UpdateWidgetData final
{
public:
	class AFortClientAnnouncement*                Param_Announcement;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Announcement_Basic_C_UpdateWidgetData) == 0x000008, "Wrong alignment on Announcement_Basic_C_UpdateWidgetData");
static_assert(sizeof(Announcement_Basic_C_UpdateWidgetData) == 0x000008, "Wrong size on Announcement_Basic_C_UpdateWidgetData");
static_assert(offsetof(Announcement_Basic_C_UpdateWidgetData, Param_Announcement) == 0x000000, "Member 'Announcement_Basic_C_UpdateWidgetData::Param_Announcement' has a wrong offset!");

// Function Announcement_Basic.Announcement_Basic_C.SetBodyText
// 0x00C0 (0x00C0 - 0x0000)
struct Announcement_Basic_C_SetBodyText final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0018(0x0018)()
	class FName                                   CallFunc_FindFirstUnboundAction_ReturnValue;       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetTextForAction_ReturnValue;             // 0x0040(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0058(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0098(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00A8(0x0018)()
};
static_assert(alignof(Announcement_Basic_C_SetBodyText) == 0x000008, "Wrong alignment on Announcement_Basic_C_SetBodyText");
static_assert(sizeof(Announcement_Basic_C_SetBodyText) == 0x0000C0, "Wrong size on Announcement_Basic_C_SetBodyText");
static_assert(offsetof(Announcement_Basic_C_SetBodyText, Temp_bool_Variable) == 0x000000, "Member 'Announcement_Basic_C_SetBodyText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_SetBodyText, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'Announcement_Basic_C_SetBodyText::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_SetBodyText, CallFunc_GetCurrentInputType_ReturnValue) == 0x000010, "Member 'Announcement_Basic_C_SetBodyText::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_SetBodyText, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000011, "Member 'Announcement_Basic_C_SetBodyText::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_SetBodyText, CallFunc_IsValid_ReturnValue) == 0x000012, "Member 'Announcement_Basic_C_SetBodyText::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_SetBodyText, CallFunc_TextIsEmpty_ReturnValue) == 0x000013, "Member 'Announcement_Basic_C_SetBodyText::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_SetBodyText, CallFunc_Not_PreBool_ReturnValue) == 0x000014, "Member 'Announcement_Basic_C_SetBodyText::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_SetBodyText, CallFunc_BooleanAND_ReturnValue) == 0x000015, "Member 'Announcement_Basic_C_SetBodyText::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_SetBodyText, K2Node_Select_Default) == 0x000018, "Member 'Announcement_Basic_C_SetBodyText::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_SetBodyText, CallFunc_FindFirstUnboundAction_ReturnValue) == 0x000030, "Member 'Announcement_Basic_C_SetBodyText::CallFunc_FindFirstUnboundAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_SetBodyText, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000038, "Member 'Announcement_Basic_C_SetBodyText::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_SetBodyText, CallFunc_GetTextForAction_ReturnValue) == 0x000040, "Member 'Announcement_Basic_C_SetBodyText::CallFunc_GetTextForAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_SetBodyText, K2Node_MakeStruct_FormatArgumentData) == 0x000058, "Member 'Announcement_Basic_C_SetBodyText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_SetBodyText, K2Node_MakeArray_Array) == 0x000098, "Member 'Announcement_Basic_C_SetBodyText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_SetBodyText, CallFunc_Format_ReturnValue) == 0x0000A8, "Member 'Announcement_Basic_C_SetBodyText::CallFunc_Format_ReturnValue' has a wrong offset!");

}

