#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Announcement_ZoneModifiers

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Announcement_ZoneModifiers.Announcement_ZoneModifiers_C
// 0x0020 (0x0258 - 0x0238)
class UAnnouncement_ZoneModifiers_C final : public UFortAnnouncementWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMissionDetailsModifierList_C*          MissionDetailsModifierList;                        // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AFortClientAnnouncement_ZoneModifiers*  ZoneModifiersAnnouncement;                         // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortClientAnnouncement_Conversation*   ConversationAnnouncement;                          // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Announcement_ZoneModifiers(int32 EntryPoint);
	void OnAnnouncementStopped(class AFortClientAnnouncement* NewAnnouncement);
	void OnConversationStopped();
	void OnDisplayTimerFinished();
	void UpdateWidgetData(class AFortClientAnnouncement* Announcement);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Announcement_ZoneModifiers_C">();
	}
	static class UAnnouncement_ZoneModifiers_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnnouncement_ZoneModifiers_C>();
	}
};
static_assert(alignof(UAnnouncement_ZoneModifiers_C) == 0x000008, "Wrong alignment on UAnnouncement_ZoneModifiers_C");
static_assert(sizeof(UAnnouncement_ZoneModifiers_C) == 0x000258, "Wrong size on UAnnouncement_ZoneModifiers_C");
static_assert(offsetof(UAnnouncement_ZoneModifiers_C, UberGraphFrame) == 0x000238, "Member 'UAnnouncement_ZoneModifiers_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAnnouncement_ZoneModifiers_C, MissionDetailsModifierList) == 0x000240, "Member 'UAnnouncement_ZoneModifiers_C::MissionDetailsModifierList' has a wrong offset!");
static_assert(offsetof(UAnnouncement_ZoneModifiers_C, ZoneModifiersAnnouncement) == 0x000248, "Member 'UAnnouncement_ZoneModifiers_C::ZoneModifiersAnnouncement' has a wrong offset!");
static_assert(offsetof(UAnnouncement_ZoneModifiers_C, ConversationAnnouncement) == 0x000250, "Member 'UAnnouncement_ZoneModifiers_C::ConversationAnnouncement' has a wrong offset!");

}

