#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AugmentedReality

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AugmentedReality_structs.hpp"


namespace SDK::Params
{

// Function AugmentedReality.ARBlueprintLibrary.AddManualEnvironmentCaptureProbe
// 0x001C (0x001C - 0x0000)
struct ARBlueprintLibrary_AddManualEnvironmentCaptureProbe final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Extent;                                            // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ARBlueprintLibrary_AddManualEnvironmentCaptureProbe) == 0x000004, "Wrong alignment on ARBlueprintLibrary_AddManualEnvironmentCaptureProbe");
static_assert(sizeof(ARBlueprintLibrary_AddManualEnvironmentCaptureProbe) == 0x00001C, "Wrong size on ARBlueprintLibrary_AddManualEnvironmentCaptureProbe");
static_assert(offsetof(ARBlueprintLibrary_AddManualEnvironmentCaptureProbe, Location) == 0x000000, "Member 'ARBlueprintLibrary_AddManualEnvironmentCaptureProbe::Location' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_AddManualEnvironmentCaptureProbe, Extent) == 0x00000C, "Member 'ARBlueprintLibrary_AddManualEnvironmentCaptureProbe::Extent' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_AddManualEnvironmentCaptureProbe, ReturnValue) == 0x000018, "Member 'ARBlueprintLibrary_AddManualEnvironmentCaptureProbe::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.AddRuntimeCandidateImage
// 0x0030 (0x0030 - 0x0000)
struct ARBlueprintLibrary_AddRuntimeCandidateImage final
{
public:
	class UARSessionConfig*                       SessionConfig;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             CandidateTexture;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FriendlyName;                                      // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PhysicalWidth;                                     // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UARCandidateImage*                      ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_AddRuntimeCandidateImage) == 0x000008, "Wrong alignment on ARBlueprintLibrary_AddRuntimeCandidateImage");
static_assert(sizeof(ARBlueprintLibrary_AddRuntimeCandidateImage) == 0x000030, "Wrong size on ARBlueprintLibrary_AddRuntimeCandidateImage");
static_assert(offsetof(ARBlueprintLibrary_AddRuntimeCandidateImage, SessionConfig) == 0x000000, "Member 'ARBlueprintLibrary_AddRuntimeCandidateImage::SessionConfig' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_AddRuntimeCandidateImage, CandidateTexture) == 0x000008, "Member 'ARBlueprintLibrary_AddRuntimeCandidateImage::CandidateTexture' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_AddRuntimeCandidateImage, FriendlyName) == 0x000010, "Member 'ARBlueprintLibrary_AddRuntimeCandidateImage::FriendlyName' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_AddRuntimeCandidateImage, PhysicalWidth) == 0x000020, "Member 'ARBlueprintLibrary_AddRuntimeCandidateImage::PhysicalWidth' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_AddRuntimeCandidateImage, ReturnValue) == 0x000028, "Member 'ARBlueprintLibrary_AddRuntimeCandidateImage::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.DebugDrawPin
// 0x0028 (0x0028 - 0x0000)
struct ARBlueprintLibrary_DebugDrawPin final
{
public:
	class UARPin*                                 ARPin;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Color;                                             // 0x0010(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PersistForSeconds;                                 // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_DebugDrawPin) == 0x000008, "Wrong alignment on ARBlueprintLibrary_DebugDrawPin");
static_assert(sizeof(ARBlueprintLibrary_DebugDrawPin) == 0x000028, "Wrong size on ARBlueprintLibrary_DebugDrawPin");
static_assert(offsetof(ARBlueprintLibrary_DebugDrawPin, ARPin) == 0x000000, "Member 'ARBlueprintLibrary_DebugDrawPin::ARPin' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_DebugDrawPin, WorldContextObject) == 0x000008, "Member 'ARBlueprintLibrary_DebugDrawPin::WorldContextObject' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_DebugDrawPin, Color) == 0x000010, "Member 'ARBlueprintLibrary_DebugDrawPin::Color' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_DebugDrawPin, Scale) == 0x000020, "Member 'ARBlueprintLibrary_DebugDrawPin::Scale' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_DebugDrawPin, PersistForSeconds) == 0x000024, "Member 'ARBlueprintLibrary_DebugDrawPin::PersistForSeconds' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.DebugDrawTrackedGeometry
// 0x0028 (0x0028 - 0x0000)
struct ARBlueprintLibrary_DebugDrawTrackedGeometry final
{
public:
	class UARTrackedGeometry*                     TrackedGeometry;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Color;                                             // 0x0010(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutlineThickness;                                  // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PersistForSeconds;                                 // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_DebugDrawTrackedGeometry) == 0x000008, "Wrong alignment on ARBlueprintLibrary_DebugDrawTrackedGeometry");
static_assert(sizeof(ARBlueprintLibrary_DebugDrawTrackedGeometry) == 0x000028, "Wrong size on ARBlueprintLibrary_DebugDrawTrackedGeometry");
static_assert(offsetof(ARBlueprintLibrary_DebugDrawTrackedGeometry, TrackedGeometry) == 0x000000, "Member 'ARBlueprintLibrary_DebugDrawTrackedGeometry::TrackedGeometry' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_DebugDrawTrackedGeometry, WorldContextObject) == 0x000008, "Member 'ARBlueprintLibrary_DebugDrawTrackedGeometry::WorldContextObject' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_DebugDrawTrackedGeometry, Color) == 0x000010, "Member 'ARBlueprintLibrary_DebugDrawTrackedGeometry::Color' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_DebugDrawTrackedGeometry, OutlineThickness) == 0x000020, "Member 'ARBlueprintLibrary_DebugDrawTrackedGeometry::OutlineThickness' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_DebugDrawTrackedGeometry, PersistForSeconds) == 0x000024, "Member 'ARBlueprintLibrary_DebugDrawTrackedGeometry::PersistForSeconds' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.GetAllGeometries
// 0x0010 (0x0010 - 0x0000)
struct ARBlueprintLibrary_GetAllGeometries final
{
public:
	TArray<class UARTrackedGeometry*>             ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_GetAllGeometries) == 0x000008, "Wrong alignment on ARBlueprintLibrary_GetAllGeometries");
static_assert(sizeof(ARBlueprintLibrary_GetAllGeometries) == 0x000010, "Wrong size on ARBlueprintLibrary_GetAllGeometries");
static_assert(offsetof(ARBlueprintLibrary_GetAllGeometries, ReturnValue) == 0x000000, "Member 'ARBlueprintLibrary_GetAllGeometries::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.GetAllPins
// 0x0010 (0x0010 - 0x0000)
struct ARBlueprintLibrary_GetAllPins final
{
public:
	TArray<class UARPin*>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_GetAllPins) == 0x000008, "Wrong alignment on ARBlueprintLibrary_GetAllPins");
static_assert(sizeof(ARBlueprintLibrary_GetAllPins) == 0x000010, "Wrong size on ARBlueprintLibrary_GetAllPins");
static_assert(offsetof(ARBlueprintLibrary_GetAllPins, ReturnValue) == 0x000000, "Member 'ARBlueprintLibrary_GetAllPins::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.GetAllTrackedEnvironmentCaptureProbes
// 0x0010 (0x0010 - 0x0000)
struct ARBlueprintLibrary_GetAllTrackedEnvironmentCaptureProbes final
{
public:
	TArray<class UAREnvironmentCaptureProbe*>     ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_GetAllTrackedEnvironmentCaptureProbes) == 0x000008, "Wrong alignment on ARBlueprintLibrary_GetAllTrackedEnvironmentCaptureProbes");
static_assert(sizeof(ARBlueprintLibrary_GetAllTrackedEnvironmentCaptureProbes) == 0x000010, "Wrong size on ARBlueprintLibrary_GetAllTrackedEnvironmentCaptureProbes");
static_assert(offsetof(ARBlueprintLibrary_GetAllTrackedEnvironmentCaptureProbes, ReturnValue) == 0x000000, "Member 'ARBlueprintLibrary_GetAllTrackedEnvironmentCaptureProbes::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.GetAllTrackedImages
// 0x0010 (0x0010 - 0x0000)
struct ARBlueprintLibrary_GetAllTrackedImages final
{
public:
	TArray<class UARTrackedImage*>                ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_GetAllTrackedImages) == 0x000008, "Wrong alignment on ARBlueprintLibrary_GetAllTrackedImages");
static_assert(sizeof(ARBlueprintLibrary_GetAllTrackedImages) == 0x000010, "Wrong size on ARBlueprintLibrary_GetAllTrackedImages");
static_assert(offsetof(ARBlueprintLibrary_GetAllTrackedImages, ReturnValue) == 0x000000, "Member 'ARBlueprintLibrary_GetAllTrackedImages::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.GetAllTrackedPlanes
// 0x0010 (0x0010 - 0x0000)
struct ARBlueprintLibrary_GetAllTrackedPlanes final
{
public:
	TArray<class UARPlaneGeometry*>               ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_GetAllTrackedPlanes) == 0x000008, "Wrong alignment on ARBlueprintLibrary_GetAllTrackedPlanes");
static_assert(sizeof(ARBlueprintLibrary_GetAllTrackedPlanes) == 0x000010, "Wrong size on ARBlueprintLibrary_GetAllTrackedPlanes");
static_assert(offsetof(ARBlueprintLibrary_GetAllTrackedPlanes, ReturnValue) == 0x000000, "Member 'ARBlueprintLibrary_GetAllTrackedPlanes::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.GetAllTrackedPoints
// 0x0010 (0x0010 - 0x0000)
struct ARBlueprintLibrary_GetAllTrackedPoints final
{
public:
	TArray<class UARTrackedPoint*>                ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_GetAllTrackedPoints) == 0x000008, "Wrong alignment on ARBlueprintLibrary_GetAllTrackedPoints");
static_assert(sizeof(ARBlueprintLibrary_GetAllTrackedPoints) == 0x000010, "Wrong size on ARBlueprintLibrary_GetAllTrackedPoints");
static_assert(offsetof(ARBlueprintLibrary_GetAllTrackedPoints, ReturnValue) == 0x000000, "Member 'ARBlueprintLibrary_GetAllTrackedPoints::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.GetARSessionStatus
// 0x0018 (0x0018 - 0x0000)
struct ARBlueprintLibrary_GetARSessionStatus final
{
public:
	struct FARSessionStatus                       ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_GetARSessionStatus) == 0x000008, "Wrong alignment on ARBlueprintLibrary_GetARSessionStatus");
static_assert(sizeof(ARBlueprintLibrary_GetARSessionStatus) == 0x000018, "Wrong size on ARBlueprintLibrary_GetARSessionStatus");
static_assert(offsetof(ARBlueprintLibrary_GetARSessionStatus, ReturnValue) == 0x000000, "Member 'ARBlueprintLibrary_GetARSessionStatus::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.GetCameraDepth
// 0x0008 (0x0008 - 0x0000)
struct ARBlueprintLibrary_GetCameraDepth final
{
public:
	class UARTextureCameraDepth*                  ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_GetCameraDepth) == 0x000008, "Wrong alignment on ARBlueprintLibrary_GetCameraDepth");
static_assert(sizeof(ARBlueprintLibrary_GetCameraDepth) == 0x000008, "Wrong size on ARBlueprintLibrary_GetCameraDepth");
static_assert(offsetof(ARBlueprintLibrary_GetCameraDepth, ReturnValue) == 0x000000, "Member 'ARBlueprintLibrary_GetCameraDepth::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.GetCameraImage
// 0x0008 (0x0008 - 0x0000)
struct ARBlueprintLibrary_GetCameraImage final
{
public:
	class UARTextureCameraImage*                  ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_GetCameraImage) == 0x000008, "Wrong alignment on ARBlueprintLibrary_GetCameraImage");
static_assert(sizeof(ARBlueprintLibrary_GetCameraImage) == 0x000008, "Wrong size on ARBlueprintLibrary_GetCameraImage");
static_assert(offsetof(ARBlueprintLibrary_GetCameraImage, ReturnValue) == 0x000000, "Member 'ARBlueprintLibrary_GetCameraImage::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.GetCurrentLightEstimate
// 0x0008 (0x0008 - 0x0000)
struct ARBlueprintLibrary_GetCurrentLightEstimate final
{
public:
	class UARLightEstimate*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_GetCurrentLightEstimate) == 0x000008, "Wrong alignment on ARBlueprintLibrary_GetCurrentLightEstimate");
static_assert(sizeof(ARBlueprintLibrary_GetCurrentLightEstimate) == 0x000008, "Wrong size on ARBlueprintLibrary_GetCurrentLightEstimate");
static_assert(offsetof(ARBlueprintLibrary_GetCurrentLightEstimate, ReturnValue) == 0x000000, "Member 'ARBlueprintLibrary_GetCurrentLightEstimate::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.GetPointCloud
// 0x0010 (0x0010 - 0x0000)
struct ARBlueprintLibrary_GetPointCloud final
{
public:
	TArray<struct FVector>                        ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_GetPointCloud) == 0x000008, "Wrong alignment on ARBlueprintLibrary_GetPointCloud");
static_assert(sizeof(ARBlueprintLibrary_GetPointCloud) == 0x000010, "Wrong size on ARBlueprintLibrary_GetPointCloud");
static_assert(offsetof(ARBlueprintLibrary_GetPointCloud, ReturnValue) == 0x000000, "Member 'ARBlueprintLibrary_GetPointCloud::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.GetSessionConfig
// 0x0008 (0x0008 - 0x0000)
struct ARBlueprintLibrary_GetSessionConfig final
{
public:
	class UARSessionConfig*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_GetSessionConfig) == 0x000008, "Wrong alignment on ARBlueprintLibrary_GetSessionConfig");
static_assert(sizeof(ARBlueprintLibrary_GetSessionConfig) == 0x000008, "Wrong size on ARBlueprintLibrary_GetSessionConfig");
static_assert(offsetof(ARBlueprintLibrary_GetSessionConfig, ReturnValue) == 0x000000, "Member 'ARBlueprintLibrary_GetSessionConfig::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.GetSupportedVideoFormats
// 0x0018 (0x0018 - 0x0000)
struct ARBlueprintLibrary_GetSupportedVideoFormats final
{
public:
	EARSessionType                                SessionType;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FARVideoFormat>                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_GetSupportedVideoFormats) == 0x000008, "Wrong alignment on ARBlueprintLibrary_GetSupportedVideoFormats");
static_assert(sizeof(ARBlueprintLibrary_GetSupportedVideoFormats) == 0x000018, "Wrong size on ARBlueprintLibrary_GetSupportedVideoFormats");
static_assert(offsetof(ARBlueprintLibrary_GetSupportedVideoFormats, SessionType) == 0x000000, "Member 'ARBlueprintLibrary_GetSupportedVideoFormats::SessionType' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_GetSupportedVideoFormats, ReturnValue) == 0x000008, "Member 'ARBlueprintLibrary_GetSupportedVideoFormats::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.GetTrackingQuality
// 0x0001 (0x0001 - 0x0000)
struct ARBlueprintLibrary_GetTrackingQuality final
{
public:
	EARTrackingQuality                            ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_GetTrackingQuality) == 0x000001, "Wrong alignment on ARBlueprintLibrary_GetTrackingQuality");
static_assert(sizeof(ARBlueprintLibrary_GetTrackingQuality) == 0x000001, "Wrong size on ARBlueprintLibrary_GetTrackingQuality");
static_assert(offsetof(ARBlueprintLibrary_GetTrackingQuality, ReturnValue) == 0x000000, "Member 'ARBlueprintLibrary_GetTrackingQuality::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.GetTrackingQualityReason
// 0x0001 (0x0001 - 0x0000)
struct ARBlueprintLibrary_GetTrackingQualityReason final
{
public:
	EARTrackingQualityReason                      ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_GetTrackingQualityReason) == 0x000001, "Wrong alignment on ARBlueprintLibrary_GetTrackingQualityReason");
static_assert(sizeof(ARBlueprintLibrary_GetTrackingQualityReason) == 0x000001, "Wrong size on ARBlueprintLibrary_GetTrackingQualityReason");
static_assert(offsetof(ARBlueprintLibrary_GetTrackingQualityReason, ReturnValue) == 0x000000, "Member 'ARBlueprintLibrary_GetTrackingQualityReason::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.GetWorldMappingStatus
// 0x0001 (0x0001 - 0x0000)
struct ARBlueprintLibrary_GetWorldMappingStatus final
{
public:
	EARWorldMappingState                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_GetWorldMappingStatus) == 0x000001, "Wrong alignment on ARBlueprintLibrary_GetWorldMappingStatus");
static_assert(sizeof(ARBlueprintLibrary_GetWorldMappingStatus) == 0x000001, "Wrong size on ARBlueprintLibrary_GetWorldMappingStatus");
static_assert(offsetof(ARBlueprintLibrary_GetWorldMappingStatus, ReturnValue) == 0x000000, "Member 'ARBlueprintLibrary_GetWorldMappingStatus::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.IsARSupported
// 0x0001 (0x0001 - 0x0000)
struct ARBlueprintLibrary_IsARSupported final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_IsARSupported) == 0x000001, "Wrong alignment on ARBlueprintLibrary_IsARSupported");
static_assert(sizeof(ARBlueprintLibrary_IsARSupported) == 0x000001, "Wrong size on ARBlueprintLibrary_IsARSupported");
static_assert(offsetof(ARBlueprintLibrary_IsARSupported, ReturnValue) == 0x000000, "Member 'ARBlueprintLibrary_IsARSupported::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.IsSessionTypeSupported
// 0x0002 (0x0002 - 0x0000)
struct ARBlueprintLibrary_IsSessionTypeSupported final
{
public:
	EARSessionType                                SessionType;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_IsSessionTypeSupported) == 0x000001, "Wrong alignment on ARBlueprintLibrary_IsSessionTypeSupported");
static_assert(sizeof(ARBlueprintLibrary_IsSessionTypeSupported) == 0x000002, "Wrong size on ARBlueprintLibrary_IsSessionTypeSupported");
static_assert(offsetof(ARBlueprintLibrary_IsSessionTypeSupported, SessionType) == 0x000000, "Member 'ARBlueprintLibrary_IsSessionTypeSupported::SessionType' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_IsSessionTypeSupported, ReturnValue) == 0x000001, "Member 'ARBlueprintLibrary_IsSessionTypeSupported::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.LineTraceTrackedObjects
// 0x0020 (0x0020 - 0x0000)
struct ARBlueprintLibrary_LineTraceTrackedObjects final
{
public:
	struct FVector2D                              ScreenCoord;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTestFeaturePoints;                                // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTestGroundPlane;                                  // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTestPlaneExtents;                                 // 0x000A(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTestPlaneBoundaryPolygon;                         // 0x000B(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FARTraceResult>                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_LineTraceTrackedObjects) == 0x000008, "Wrong alignment on ARBlueprintLibrary_LineTraceTrackedObjects");
static_assert(sizeof(ARBlueprintLibrary_LineTraceTrackedObjects) == 0x000020, "Wrong size on ARBlueprintLibrary_LineTraceTrackedObjects");
static_assert(offsetof(ARBlueprintLibrary_LineTraceTrackedObjects, ScreenCoord) == 0x000000, "Member 'ARBlueprintLibrary_LineTraceTrackedObjects::ScreenCoord' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_LineTraceTrackedObjects, bTestFeaturePoints) == 0x000008, "Member 'ARBlueprintLibrary_LineTraceTrackedObjects::bTestFeaturePoints' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_LineTraceTrackedObjects, bTestGroundPlane) == 0x000009, "Member 'ARBlueprintLibrary_LineTraceTrackedObjects::bTestGroundPlane' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_LineTraceTrackedObjects, bTestPlaneExtents) == 0x00000A, "Member 'ARBlueprintLibrary_LineTraceTrackedObjects::bTestPlaneExtents' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_LineTraceTrackedObjects, bTestPlaneBoundaryPolygon) == 0x00000B, "Member 'ARBlueprintLibrary_LineTraceTrackedObjects::bTestPlaneBoundaryPolygon' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_LineTraceTrackedObjects, ReturnValue) == 0x000010, "Member 'ARBlueprintLibrary_LineTraceTrackedObjects::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.LineTraceTrackedObjects3D
// 0x0030 (0x0030 - 0x0000)
struct ARBlueprintLibrary_LineTraceTrackedObjects3D final
{
public:
	struct FVector                                Start;                                             // 0x0000(0x000C)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                End;                                               // 0x000C(0x000C)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTestFeaturePoints;                                // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTestGroundPlane;                                  // 0x0019(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTestPlaneExtents;                                 // 0x001A(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTestPlaneBoundaryPolygon;                         // 0x001B(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FARTraceResult>                 ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_LineTraceTrackedObjects3D) == 0x000008, "Wrong alignment on ARBlueprintLibrary_LineTraceTrackedObjects3D");
static_assert(sizeof(ARBlueprintLibrary_LineTraceTrackedObjects3D) == 0x000030, "Wrong size on ARBlueprintLibrary_LineTraceTrackedObjects3D");
static_assert(offsetof(ARBlueprintLibrary_LineTraceTrackedObjects3D, Start) == 0x000000, "Member 'ARBlueprintLibrary_LineTraceTrackedObjects3D::Start' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_LineTraceTrackedObjects3D, End) == 0x00000C, "Member 'ARBlueprintLibrary_LineTraceTrackedObjects3D::End' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_LineTraceTrackedObjects3D, bTestFeaturePoints) == 0x000018, "Member 'ARBlueprintLibrary_LineTraceTrackedObjects3D::bTestFeaturePoints' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_LineTraceTrackedObjects3D, bTestGroundPlane) == 0x000019, "Member 'ARBlueprintLibrary_LineTraceTrackedObjects3D::bTestGroundPlane' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_LineTraceTrackedObjects3D, bTestPlaneExtents) == 0x00001A, "Member 'ARBlueprintLibrary_LineTraceTrackedObjects3D::bTestPlaneExtents' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_LineTraceTrackedObjects3D, bTestPlaneBoundaryPolygon) == 0x00001B, "Member 'ARBlueprintLibrary_LineTraceTrackedObjects3D::bTestPlaneBoundaryPolygon' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_LineTraceTrackedObjects3D, ReturnValue) == 0x000020, "Member 'ARBlueprintLibrary_LineTraceTrackedObjects3D::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.PinComponent
// 0x0060 (0x0060 - 0x0000)
struct ARBlueprintLibrary_PinComponent final
{
public:
	class USceneComponent*                        ComponentToPin;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             PinToWorldTransform;                               // 0x0010(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class UARTrackedGeometry*                     TrackedGeometry;                                   // 0x0040(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   DebugName;                                         // 0x0048(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UARPin*                                 ReturnValue;                                       // 0x0050(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ARBlueprintLibrary_PinComponent) == 0x000010, "Wrong alignment on ARBlueprintLibrary_PinComponent");
static_assert(sizeof(ARBlueprintLibrary_PinComponent) == 0x000060, "Wrong size on ARBlueprintLibrary_PinComponent");
static_assert(offsetof(ARBlueprintLibrary_PinComponent, ComponentToPin) == 0x000000, "Member 'ARBlueprintLibrary_PinComponent::ComponentToPin' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_PinComponent, PinToWorldTransform) == 0x000010, "Member 'ARBlueprintLibrary_PinComponent::PinToWorldTransform' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_PinComponent, TrackedGeometry) == 0x000040, "Member 'ARBlueprintLibrary_PinComponent::TrackedGeometry' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_PinComponent, DebugName) == 0x000048, "Member 'ARBlueprintLibrary_PinComponent::DebugName' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_PinComponent, ReturnValue) == 0x000050, "Member 'ARBlueprintLibrary_PinComponent::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.PinComponentToTraceResult
// 0x0080 (0x0080 - 0x0000)
struct ARBlueprintLibrary_PinComponentToTraceResult final
{
public:
	class USceneComponent*                        ComponentToPin;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FARTraceResult                         TraceResult;                                       // 0x0010(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   DebugName;                                         // 0x0070(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UARPin*                                 ReturnValue;                                       // 0x0078(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_PinComponentToTraceResult) == 0x000010, "Wrong alignment on ARBlueprintLibrary_PinComponentToTraceResult");
static_assert(sizeof(ARBlueprintLibrary_PinComponentToTraceResult) == 0x000080, "Wrong size on ARBlueprintLibrary_PinComponentToTraceResult");
static_assert(offsetof(ARBlueprintLibrary_PinComponentToTraceResult, ComponentToPin) == 0x000000, "Member 'ARBlueprintLibrary_PinComponentToTraceResult::ComponentToPin' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_PinComponentToTraceResult, TraceResult) == 0x000010, "Member 'ARBlueprintLibrary_PinComponentToTraceResult::TraceResult' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_PinComponentToTraceResult, DebugName) == 0x000070, "Member 'ARBlueprintLibrary_PinComponentToTraceResult::DebugName' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_PinComponentToTraceResult, ReturnValue) == 0x000078, "Member 'ARBlueprintLibrary_PinComponentToTraceResult::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.RemovePin
// 0x0008 (0x0008 - 0x0000)
struct ARBlueprintLibrary_RemovePin final
{
public:
	class UARPin*                                 PinToRemove;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_RemovePin) == 0x000008, "Wrong alignment on ARBlueprintLibrary_RemovePin");
static_assert(sizeof(ARBlueprintLibrary_RemovePin) == 0x000008, "Wrong size on ARBlueprintLibrary_RemovePin");
static_assert(offsetof(ARBlueprintLibrary_RemovePin, PinToRemove) == 0x000000, "Member 'ARBlueprintLibrary_RemovePin::PinToRemove' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.SetAlignmentTransform
// 0x0030 (0x0030 - 0x0000)
struct ARBlueprintLibrary_SetAlignmentTransform final
{
public:
	struct FTransform                             InAlignmentTransform;                              // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_SetAlignmentTransform) == 0x000010, "Wrong alignment on ARBlueprintLibrary_SetAlignmentTransform");
static_assert(sizeof(ARBlueprintLibrary_SetAlignmentTransform) == 0x000030, "Wrong size on ARBlueprintLibrary_SetAlignmentTransform");
static_assert(offsetof(ARBlueprintLibrary_SetAlignmentTransform, InAlignmentTransform) == 0x000000, "Member 'ARBlueprintLibrary_SetAlignmentTransform::InAlignmentTransform' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.StartARSession
// 0x0008 (0x0008 - 0x0000)
struct ARBlueprintLibrary_StartARSession final
{
public:
	class UARSessionConfig*                       SessionConfig;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_StartARSession) == 0x000008, "Wrong alignment on ARBlueprintLibrary_StartARSession");
static_assert(sizeof(ARBlueprintLibrary_StartARSession) == 0x000008, "Wrong size on ARBlueprintLibrary_StartARSession");
static_assert(offsetof(ARBlueprintLibrary_StartARSession, SessionConfig) == 0x000000, "Member 'ARBlueprintLibrary_StartARSession::SessionConfig' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.UnpinComponent
// 0x0008 (0x0008 - 0x0000)
struct ARBlueprintLibrary_UnpinComponent final
{
public:
	class USceneComponent*                        ComponentToUnpin;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_UnpinComponent) == 0x000008, "Wrong alignment on ARBlueprintLibrary_UnpinComponent");
static_assert(sizeof(ARBlueprintLibrary_UnpinComponent) == 0x000008, "Wrong size on ARBlueprintLibrary_UnpinComponent");
static_assert(offsetof(ARBlueprintLibrary_UnpinComponent, ComponentToUnpin) == 0x000000, "Member 'ARBlueprintLibrary_UnpinComponent::ComponentToUnpin' has a wrong offset!");

// Function AugmentedReality.ARTraceResultLibrary.GetDistanceFromCamera
// 0x0070 (0x0070 - 0x0000)
struct ARTraceResultLibrary_GetDistanceFromCamera final
{
public:
	struct FARTraceResult                         TraceResult;                                       // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0060(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0xC];                                       // 0x0064(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ARTraceResultLibrary_GetDistanceFromCamera) == 0x000010, "Wrong alignment on ARTraceResultLibrary_GetDistanceFromCamera");
static_assert(sizeof(ARTraceResultLibrary_GetDistanceFromCamera) == 0x000070, "Wrong size on ARTraceResultLibrary_GetDistanceFromCamera");
static_assert(offsetof(ARTraceResultLibrary_GetDistanceFromCamera, TraceResult) == 0x000000, "Member 'ARTraceResultLibrary_GetDistanceFromCamera::TraceResult' has a wrong offset!");
static_assert(offsetof(ARTraceResultLibrary_GetDistanceFromCamera, ReturnValue) == 0x000060, "Member 'ARTraceResultLibrary_GetDistanceFromCamera::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARTraceResultLibrary.GetLocalToTrackingTransform
// 0x0090 (0x0090 - 0x0000)
struct ARTraceResultLibrary_GetLocalToTrackingTransform final
{
public:
	struct FARTraceResult                         TraceResult;                                       // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FTransform                             ReturnValue;                                       // 0x0060(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARTraceResultLibrary_GetLocalToTrackingTransform) == 0x000010, "Wrong alignment on ARTraceResultLibrary_GetLocalToTrackingTransform");
static_assert(sizeof(ARTraceResultLibrary_GetLocalToTrackingTransform) == 0x000090, "Wrong size on ARTraceResultLibrary_GetLocalToTrackingTransform");
static_assert(offsetof(ARTraceResultLibrary_GetLocalToTrackingTransform, TraceResult) == 0x000000, "Member 'ARTraceResultLibrary_GetLocalToTrackingTransform::TraceResult' has a wrong offset!");
static_assert(offsetof(ARTraceResultLibrary_GetLocalToTrackingTransform, ReturnValue) == 0x000060, "Member 'ARTraceResultLibrary_GetLocalToTrackingTransform::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARTraceResultLibrary.GetLocalToWorldTransform
// 0x0090 (0x0090 - 0x0000)
struct ARTraceResultLibrary_GetLocalToWorldTransform final
{
public:
	struct FARTraceResult                         TraceResult;                                       // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FTransform                             ReturnValue;                                       // 0x0060(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARTraceResultLibrary_GetLocalToWorldTransform) == 0x000010, "Wrong alignment on ARTraceResultLibrary_GetLocalToWorldTransform");
static_assert(sizeof(ARTraceResultLibrary_GetLocalToWorldTransform) == 0x000090, "Wrong size on ARTraceResultLibrary_GetLocalToWorldTransform");
static_assert(offsetof(ARTraceResultLibrary_GetLocalToWorldTransform, TraceResult) == 0x000000, "Member 'ARTraceResultLibrary_GetLocalToWorldTransform::TraceResult' has a wrong offset!");
static_assert(offsetof(ARTraceResultLibrary_GetLocalToWorldTransform, ReturnValue) == 0x000060, "Member 'ARTraceResultLibrary_GetLocalToWorldTransform::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARTraceResultLibrary.GetTraceChannel
// 0x0070 (0x0070 - 0x0000)
struct ARTraceResultLibrary_GetTraceChannel final
{
public:
	struct FARTraceResult                         TraceResult;                                       // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	EARLineTraceChannels                          ReturnValue;                                       // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0xF];                                       // 0x0061(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ARTraceResultLibrary_GetTraceChannel) == 0x000010, "Wrong alignment on ARTraceResultLibrary_GetTraceChannel");
static_assert(sizeof(ARTraceResultLibrary_GetTraceChannel) == 0x000070, "Wrong size on ARTraceResultLibrary_GetTraceChannel");
static_assert(offsetof(ARTraceResultLibrary_GetTraceChannel, TraceResult) == 0x000000, "Member 'ARTraceResultLibrary_GetTraceChannel::TraceResult' has a wrong offset!");
static_assert(offsetof(ARTraceResultLibrary_GetTraceChannel, ReturnValue) == 0x000060, "Member 'ARTraceResultLibrary_GetTraceChannel::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARTraceResultLibrary.GetTrackedGeometry
// 0x0070 (0x0070 - 0x0000)
struct ARTraceResultLibrary_GetTrackedGeometry final
{
public:
	struct FARTraceResult                         TraceResult;                                       // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UARTrackedGeometry*                     ReturnValue;                                       // 0x0060(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ARTraceResultLibrary_GetTrackedGeometry) == 0x000010, "Wrong alignment on ARTraceResultLibrary_GetTrackedGeometry");
static_assert(sizeof(ARTraceResultLibrary_GetTrackedGeometry) == 0x000070, "Wrong size on ARTraceResultLibrary_GetTrackedGeometry");
static_assert(offsetof(ARTraceResultLibrary_GetTrackedGeometry, TraceResult) == 0x000000, "Member 'ARTraceResultLibrary_GetTrackedGeometry::TraceResult' has a wrong offset!");
static_assert(offsetof(ARTraceResultLibrary_GetTrackedGeometry, ReturnValue) == 0x000060, "Member 'ARTraceResultLibrary_GetTrackedGeometry::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARSaveWorldAsyncTaskBlueprintProxy.ARSaveWorld
// 0x0010 (0x0010 - 0x0000)
struct ARSaveWorldAsyncTaskBlueprintProxy_ARSaveWorld final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UARSaveWorldAsyncTaskBlueprintProxy*    ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARSaveWorldAsyncTaskBlueprintProxy_ARSaveWorld) == 0x000008, "Wrong alignment on ARSaveWorldAsyncTaskBlueprintProxy_ARSaveWorld");
static_assert(sizeof(ARSaveWorldAsyncTaskBlueprintProxy_ARSaveWorld) == 0x000010, "Wrong size on ARSaveWorldAsyncTaskBlueprintProxy_ARSaveWorld");
static_assert(offsetof(ARSaveWorldAsyncTaskBlueprintProxy_ARSaveWorld, WorldContextObject) == 0x000000, "Member 'ARSaveWorldAsyncTaskBlueprintProxy_ARSaveWorld::WorldContextObject' has a wrong offset!");
static_assert(offsetof(ARSaveWorldAsyncTaskBlueprintProxy_ARSaveWorld, ReturnValue) == 0x000008, "Member 'ARSaveWorldAsyncTaskBlueprintProxy_ARSaveWorld::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARGetCandidateObjectAsyncTaskBlueprintProxy.ARGetCandidateObject
// 0x0028 (0x0028 - 0x0000)
struct ARGetCandidateObjectAsyncTaskBlueprintProxy_ARGetCandidateObject final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0008(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Extent;                                            // 0x0014(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UARGetCandidateObjectAsyncTaskBlueprintProxy* ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARGetCandidateObjectAsyncTaskBlueprintProxy_ARGetCandidateObject) == 0x000008, "Wrong alignment on ARGetCandidateObjectAsyncTaskBlueprintProxy_ARGetCandidateObject");
static_assert(sizeof(ARGetCandidateObjectAsyncTaskBlueprintProxy_ARGetCandidateObject) == 0x000028, "Wrong size on ARGetCandidateObjectAsyncTaskBlueprintProxy_ARGetCandidateObject");
static_assert(offsetof(ARGetCandidateObjectAsyncTaskBlueprintProxy_ARGetCandidateObject, WorldContextObject) == 0x000000, "Member 'ARGetCandidateObjectAsyncTaskBlueprintProxy_ARGetCandidateObject::WorldContextObject' has a wrong offset!");
static_assert(offsetof(ARGetCandidateObjectAsyncTaskBlueprintProxy_ARGetCandidateObject, Location) == 0x000008, "Member 'ARGetCandidateObjectAsyncTaskBlueprintProxy_ARGetCandidateObject::Location' has a wrong offset!");
static_assert(offsetof(ARGetCandidateObjectAsyncTaskBlueprintProxy_ARGetCandidateObject, Extent) == 0x000014, "Member 'ARGetCandidateObjectAsyncTaskBlueprintProxy_ARGetCandidateObject::Extent' has a wrong offset!");
static_assert(offsetof(ARGetCandidateObjectAsyncTaskBlueprintProxy_ARGetCandidateObject, ReturnValue) == 0x000020, "Member 'ARGetCandidateObjectAsyncTaskBlueprintProxy_ARGetCandidateObject::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBasicLightEstimate.GetAmbientColor
// 0x0010 (0x0010 - 0x0000)
struct ARBasicLightEstimate_GetAmbientColor final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBasicLightEstimate_GetAmbientColor) == 0x000004, "Wrong alignment on ARBasicLightEstimate_GetAmbientColor");
static_assert(sizeof(ARBasicLightEstimate_GetAmbientColor) == 0x000010, "Wrong size on ARBasicLightEstimate_GetAmbientColor");
static_assert(offsetof(ARBasicLightEstimate_GetAmbientColor, ReturnValue) == 0x000000, "Member 'ARBasicLightEstimate_GetAmbientColor::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBasicLightEstimate.GetAmbientColorTemperatureKelvin
// 0x0004 (0x0004 - 0x0000)
struct ARBasicLightEstimate_GetAmbientColorTemperatureKelvin final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBasicLightEstimate_GetAmbientColorTemperatureKelvin) == 0x000004, "Wrong alignment on ARBasicLightEstimate_GetAmbientColorTemperatureKelvin");
static_assert(sizeof(ARBasicLightEstimate_GetAmbientColorTemperatureKelvin) == 0x000004, "Wrong size on ARBasicLightEstimate_GetAmbientColorTemperatureKelvin");
static_assert(offsetof(ARBasicLightEstimate_GetAmbientColorTemperatureKelvin, ReturnValue) == 0x000000, "Member 'ARBasicLightEstimate_GetAmbientColorTemperatureKelvin::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBasicLightEstimate.GetAmbientIntensityLumens
// 0x0004 (0x0004 - 0x0000)
struct ARBasicLightEstimate_GetAmbientIntensityLumens final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBasicLightEstimate_GetAmbientIntensityLumens) == 0x000004, "Wrong alignment on ARBasicLightEstimate_GetAmbientIntensityLumens");
static_assert(sizeof(ARBasicLightEstimate_GetAmbientIntensityLumens) == 0x000004, "Wrong size on ARBasicLightEstimate_GetAmbientIntensityLumens");
static_assert(offsetof(ARBasicLightEstimate_GetAmbientIntensityLumens, ReturnValue) == 0x000000, "Member 'ARBasicLightEstimate_GetAmbientIntensityLumens::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARPin.DebugDraw
// 0x0020 (0x0020 - 0x0000)
struct ARPin_DebugDraw final
{
public:
	class UWorld*                                 World;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Color;                                             // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PersistForSeconds;                                 // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARPin_DebugDraw) == 0x000008, "Wrong alignment on ARPin_DebugDraw");
static_assert(sizeof(ARPin_DebugDraw) == 0x000020, "Wrong size on ARPin_DebugDraw");
static_assert(offsetof(ARPin_DebugDraw, World) == 0x000000, "Member 'ARPin_DebugDraw::World' has a wrong offset!");
static_assert(offsetof(ARPin_DebugDraw, Color) == 0x000008, "Member 'ARPin_DebugDraw::Color' has a wrong offset!");
static_assert(offsetof(ARPin_DebugDraw, Scale) == 0x000018, "Member 'ARPin_DebugDraw::Scale' has a wrong offset!");
static_assert(offsetof(ARPin_DebugDraw, PersistForSeconds) == 0x00001C, "Member 'ARPin_DebugDraw::PersistForSeconds' has a wrong offset!");

// Function AugmentedReality.ARPin.GetDebugName
// 0x0008 (0x0008 - 0x0000)
struct ARPin_GetDebugName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARPin_GetDebugName) == 0x000004, "Wrong alignment on ARPin_GetDebugName");
static_assert(sizeof(ARPin_GetDebugName) == 0x000008, "Wrong size on ARPin_GetDebugName");
static_assert(offsetof(ARPin_GetDebugName, ReturnValue) == 0x000000, "Member 'ARPin_GetDebugName::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARPin.GetLocalToTrackingTransform
// 0x0030 (0x0030 - 0x0000)
struct ARPin_GetLocalToTrackingTransform final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARPin_GetLocalToTrackingTransform) == 0x000010, "Wrong alignment on ARPin_GetLocalToTrackingTransform");
static_assert(sizeof(ARPin_GetLocalToTrackingTransform) == 0x000030, "Wrong size on ARPin_GetLocalToTrackingTransform");
static_assert(offsetof(ARPin_GetLocalToTrackingTransform, ReturnValue) == 0x000000, "Member 'ARPin_GetLocalToTrackingTransform::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARPin.GetLocalToWorldTransform
// 0x0030 (0x0030 - 0x0000)
struct ARPin_GetLocalToWorldTransform final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARPin_GetLocalToWorldTransform) == 0x000010, "Wrong alignment on ARPin_GetLocalToWorldTransform");
static_assert(sizeof(ARPin_GetLocalToWorldTransform) == 0x000030, "Wrong size on ARPin_GetLocalToWorldTransform");
static_assert(offsetof(ARPin_GetLocalToWorldTransform, ReturnValue) == 0x000000, "Member 'ARPin_GetLocalToWorldTransform::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARPin.GetPinnedComponent
// 0x0008 (0x0008 - 0x0000)
struct ARPin_GetPinnedComponent final
{
public:
	class USceneComponent*                        ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARPin_GetPinnedComponent) == 0x000008, "Wrong alignment on ARPin_GetPinnedComponent");
static_assert(sizeof(ARPin_GetPinnedComponent) == 0x000008, "Wrong size on ARPin_GetPinnedComponent");
static_assert(offsetof(ARPin_GetPinnedComponent, ReturnValue) == 0x000000, "Member 'ARPin_GetPinnedComponent::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARPin.GetTrackedGeometry
// 0x0008 (0x0008 - 0x0000)
struct ARPin_GetTrackedGeometry final
{
public:
	class UARTrackedGeometry*                     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARPin_GetTrackedGeometry) == 0x000008, "Wrong alignment on ARPin_GetTrackedGeometry");
static_assert(sizeof(ARPin_GetTrackedGeometry) == 0x000008, "Wrong size on ARPin_GetTrackedGeometry");
static_assert(offsetof(ARPin_GetTrackedGeometry, ReturnValue) == 0x000000, "Member 'ARPin_GetTrackedGeometry::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARPin.GetTrackingState
// 0x0001 (0x0001 - 0x0000)
struct ARPin_GetTrackingState final
{
public:
	EARTrackingState                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARPin_GetTrackingState) == 0x000001, "Wrong alignment on ARPin_GetTrackingState");
static_assert(sizeof(ARPin_GetTrackingState) == 0x000001, "Wrong size on ARPin_GetTrackingState");
static_assert(offsetof(ARPin_GetTrackingState, ReturnValue) == 0x000000, "Member 'ARPin_GetTrackingState::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARSessionConfig.AddCandidateImage
// 0x0008 (0x0008 - 0x0000)
struct ARSessionConfig_AddCandidateImage final
{
public:
	class UARCandidateImage*                      NewCandidateImage;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARSessionConfig_AddCandidateImage) == 0x000008, "Wrong alignment on ARSessionConfig_AddCandidateImage");
