#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_AthenaPlayerMarker_WithCustomization

#include "Basic.hpp"

#include "B_AthenaMapMarkerBase_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_AthenaPlayerMarker_WithCustomization.B_AthenaPlayerMarker_WithCustomization_C
// 0x0048 (0x0530 - 0x04E8)
class AB_AthenaPlayerMarker_WithCustomization_C final : public AB_AthenaMapMarkerBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_AthenaPlayerMarker_WithCustomization_C; // 0x04E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UClass*                                 TopperClass;                                       // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortMapMarkerTopperActor*              TopperInstance;                                    // 0x04F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             TopperTransform;                                   // 0x0500(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_B_AthenaPlayerMarker_WithCustomization(int32 EntryPoint);
	void UpdateTopper();
	void OnMarkerHidden();
	void OnLoaded_8A042AD24DC8A8C0E9D8E0B4BF3B6C37(class UClass* Loaded);
	void OnMarkerPlaced();
	void OnSetupMarker(const struct FFortWorldMarkerData& Param_MarkerData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_AthenaPlayerMarker_WithCustomization_C">();
	}
	static class AB_AthenaPlayerMarker_WithCustomization_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_AthenaPlayerMarker_WithCustomization_C>();
	}
};
static_assert(alignof(AB_AthenaPlayerMarker_WithCustomization_C) == 0x000010, "Wrong alignment on AB_AthenaPlayerMarker_WithCustomization_C");
static_assert(sizeof(AB_AthenaPlayerMarker_WithCustomization_C) == 0x000530, "Wrong size on AB_AthenaPlayerMarker_WithCustomization_C");
static_assert(offsetof(AB_AthenaPlayerMarker_WithCustomization_C, UberGraphFrame_B_AthenaPlayerMarker_WithCustomization_C) == 0x0004E8, "Member 'AB_AthenaPlayerMarker_WithCustomization_C::UberGraphFrame_B_AthenaPlayerMarker_WithCustomization_C' has a wrong offset!");
static_assert(offsetof(AB_AthenaPlayerMarker_WithCustomization_C, TopperClass) == 0x0004F0, "Member 'AB_AthenaPlayerMarker_WithCustomization_C::TopperClass' has a wrong offset!");
static_assert(offsetof(AB_AthenaPlayerMarker_WithCustomization_C, TopperInstance) == 0x0004F8, "Member 'AB_AthenaPlayerMarker_WithCustomization_C::TopperInstance' has a wrong offset!");
static_assert(offsetof(AB_AthenaPlayerMarker_WithCustomization_C, TopperTransform) == 0x000500, "Member 'AB_AthenaPlayerMarker_WithCustomization_C::TopperTransform' has a wrong offset!");

}

