#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_AthenaMapMarkerBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_AthenaMapMarkerBase.B_AthenaMapMarkerBase_C
// 0x0170 (0x04E8 - 0x0378)
class AB_AthenaMapMarkerBase_C : public AFortPlayerMarkerBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   PingMarkerProto;                                   // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SMMinusTarget;                                     // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         OnProtoMarkerPlaced_RampPow_83EEC58A4783B077FB03728C433B4B7E; // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OnProtoMarkerPlaced_Pinch_83EEC58A4783B077FB03728C433B4B7E; // 0x0394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OnProtoMarkerPlaced_Glow_83EEC58A4783B077FB03728C433B4B7E; // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            OnProtoMarkerPlaced__Direction_83EEC58A4783B077FB03728C433B4B7E; // 0x039C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39D[0x3];                                      // 0x039D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     OnProtoMarkerPlaced;                               // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpawnMarkerAnim_SpawnVerticalScale_D00BAF4B4CCD528A4D4E94BA8CAE97A2; // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpawnMarkerAnim_SpawnScale_D00BAF4B4CCD528A4D4E94BA8CAE97A2; // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpawnMarkerAnim_Opacity_D00BAF4B4CCD528A4D4E94BA8CAE97A2; // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            SpawnMarkerAnim__Direction_D00BAF4B4CCD528A4D4E94BA8CAE97A2; // 0x03B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B5[0x3];                                      // 0x03B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     SpawnMarkerAnim;                                   // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MIDMinusMain;                                      // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MIDMinusTarget;                                    // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseProtoMarker;                                   // 0x03D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D1[0x7];                                      // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               MIDProtoMarker;                                    // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortWorldMarkerData                   MarkerData;                                        // 0x03E0(0x0108)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_B_AthenaMapMarkerBase(int32 EntryPoint);
	void OnMarkerColorChanged(const struct FLinearColor& InColor);
	void OnMarkerPlaced();
	void OnProtoMarkerPlaced__FinishedFunc();
	void OnProtoMarkerPlaced__UpdateFunc();
	void OnSetupMarker(const struct FFortWorldMarkerData& Param_MarkerData);
	void SpawnMarkerAnim__FinishedFunc();
	void SpawnMarkerAnim__UpdateFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_AthenaMapMarkerBase_C">();
	}
	static class AB_AthenaMapMarkerBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_AthenaMapMarkerBase_C>();
	}
};
static_assert(alignof(AB_AthenaMapMarkerBase_C) == 0x000008, "Wrong alignment on AB_AthenaMapMarkerBase_C");
static_assert(sizeof(AB_AthenaMapMarkerBase_C) == 0x0004E8, "Wrong size on AB_AthenaMapMarkerBase_C");
static_assert(offsetof(AB_AthenaMapMarkerBase_C, UberGraphFrame) == 0x000378, "Member 'AB_AthenaMapMarkerBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_AthenaMapMarkerBase_C, PingMarkerProto) == 0x000380, "Member 'AB_AthenaMapMarkerBase_C::PingMarkerProto' has a wrong offset!");
static_assert(offsetof(AB_AthenaMapMarkerBase_C, SMMinusTarget) == 0x000388, "Member 'AB_AthenaMapMarkerBase_C::SMMinusTarget' has a wrong offset!");
static_assert(offsetof(AB_AthenaMapMarkerBase_C, OnProtoMarkerPlaced_RampPow_83EEC58A4783B077FB03728C433B4B7E) == 0x000390, "Member 'AB_AthenaMapMarkerBase_C::OnProtoMarkerPlaced_RampPow_83EEC58A4783B077FB03728C433B4B7E' has a wrong offset!");
static_assert(offsetof(AB_AthenaMapMarkerBase_C, OnProtoMarkerPlaced_Pinch_83EEC58A4783B077FB03728C433B4B7E) == 0x000394, "Member 'AB_AthenaMapMarkerBase_C::OnProtoMarkerPlaced_Pinch_83EEC58A4783B077FB03728C433B4B7E' has a wrong offset!");
static_assert(offsetof(AB_AthenaMapMarkerBase_C, OnProtoMarkerPlaced_Glow_83EEC58A4783B077FB03728C433B4B7E) == 0x000398, "Member 'AB_AthenaMapMarkerBase_C::OnProtoMarkerPlaced_Glow_83EEC58A4783B077FB03728C433B4B7E' has a wrong offset!");
static_assert(offsetof(AB_AthenaMapMarkerBase_C, OnProtoMarkerPlaced__Direction_83EEC58A4783B077FB03728C433B4B7E) == 0x00039C, "Member 'AB_AthenaMapMarkerBase_C::OnProtoMarkerPlaced__Direction_83EEC58A4783B077FB03728C433B4B7E' has a wrong offset!");
static_assert(offsetof(AB_AthenaMapMarkerBase_C, OnProtoMarkerPlaced) == 0x0003A0, "Member 'AB_AthenaMapMarkerBase_C::OnProtoMarkerPlaced' has a wrong offset!");
static_assert(offsetof(AB_AthenaMapMarkerBase_C, SpawnMarkerAnim_SpawnVerticalScale_D00BAF4B4CCD528A4D4E94BA8CAE97A2) == 0x0003A8, "Member 'AB_AthenaMapMarkerBase_C::SpawnMarkerAnim_SpawnVerticalScale_D00BAF4B4CCD528A4D4E94BA8CAE97A2' has a wrong offset!");
static_assert(offsetof(AB_AthenaMapMarkerBase_C, SpawnMarkerAnim_SpawnScale_D00BAF4B4CCD528A4D4E94BA8CAE97A2) == 0x0003AC, "Member 'AB_AthenaMapMarkerBase_C::SpawnMarkerAnim_SpawnScale_D00BAF4B4CCD528A4D4E94BA8CAE97A2' has a wrong offset!");
static_assert(offsetof(AB_AthenaMapMarkerBase_C, SpawnMarkerAnim_Opacity_D00BAF4B4CCD528A4D4E94BA8CAE97A2) == 0x0003B0, "Member 'AB_AthenaMapMarkerBase_C::SpawnMarkerAnim_Opacity_D00BAF4B4CCD528A4D4E94BA8CAE97A2' has a wrong offset!");
static_assert(offsetof(AB_AthenaMapMarkerBase_C, SpawnMarkerAnim__Direction_D00BAF4B4CCD528A4D4E94BA8CAE97A2) == 0x0003B4, "Member 'AB_AthenaMapMarkerBase_C::SpawnMarkerAnim__Direction_D00BAF4B4CCD528A4D4E94BA8CAE97A2' has a wrong offset!");
static_assert(offsetof(AB_AthenaMapMarkerBase_C, SpawnMarkerAnim) == 0x0003B8, "Member 'AB_AthenaMapMarkerBase_C::SpawnMarkerAnim' has a wrong offset!");
static_assert(offsetof(AB_AthenaMapMarkerBase_C, MIDMinusMain) == 0x0003C0, "Member 'AB_AthenaMapMarkerBase_C::MIDMinusMain' has a wrong offset!");
static_assert(offsetof(AB_AthenaMapMarkerBase_C, MIDMinusTarget) == 0x0003C8, "Member 'AB_AthenaMapMarkerBase_C::MIDMinusTarget' has a wrong offset!");
static_assert(offsetof(AB_AthenaMapMarkerBase_C, bUseProtoMarker) == 0x0003D0, "Member 'AB_AthenaMapMarkerBase_C::bUseProtoMarker' has a wrong offset!");
static_assert(offsetof(AB_AthenaMapMarkerBase_C, MIDProtoMarker) == 0x0003D8, "Member 'AB_AthenaMapMarkerBase_C::MIDProtoMarker' has a wrong offset!");
static_assert(offsetof(AB_AthenaMapMarkerBase_C, MarkerData) == 0x0003E0, "Member 'AB_AthenaMapMarkerBase_C::MarkerData' has a wrong offset!");

}

