#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Pickups_Parent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function B_Pickups_Parent.B_Pickups_Parent_C.ExecuteUbergraph_B_Pickups_Parent
// 0x0150 (0x0150 - 0x0000)
struct B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortIngredientItemDefinition*          K2Node_DynamicCast_AsFort_Ingredient_Item_Definition; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortResourceItemDefinition*            K2Node_DynamicCast_AsFort_Resource_Item_Definition; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_Event_PickupTarget;                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_1;                             // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_2;                             // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_3;                             // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESubGame                                      CallFunc_GetSubGame_ReturnValue;                   // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESubGame                                      CallFunc_GetSubGame_ReturnValue_1;                 // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F[0x1];                                       // 0x006F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESubGame                                      Temp_byte_Variable;                                // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0090(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         Temp_int_Variable;                                 // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x0134(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESubGame                                      CallFunc_GetSubGame_ReturnValue_2;                 // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0143(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent) == 0x000008, "Wrong alignment on B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent");
static_assert(sizeof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent) == 0x000150, "Wrong size on B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, EntryPoint) == 0x000000, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, Temp_float_Variable) == 0x000004, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, K2Node_DynamicCast_AsFort_Ingredient_Item_Definition) == 0x000008, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::K2Node_DynamicCast_AsFort_Ingredient_Item_Definition' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, K2Node_DynamicCast_AsFort_Resource_Item_Definition) == 0x000018, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::K2Node_DynamicCast_AsFort_Resource_Item_Definition' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, K2Node_DynamicCast_bSuccess_1) == 0x000020, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, K2Node_Event_PickupTarget) == 0x000028, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::K2Node_Event_PickupTarget' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_Array_LastIndex_ReturnValue) == 0x000030, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_IsLocallyControlled_ReturnValue) == 0x000034, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_GetController_ReturnValue) == 0x000038, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000048, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, K2Node_DynamicCast_bSuccess_2) == 0x000050, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, K2Node_Event_DeltaSeconds) == 0x000054, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_IsDedicatedServer_ReturnValue) == 0x000058, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000059, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, Temp_float_Variable_1) == 0x00005C, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_BooleanAND_ReturnValue) == 0x000060, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, Temp_float_Variable_2) == 0x000064, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::Temp_float_Variable_2' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, Temp_float_Variable_3) == 0x000068, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::Temp_float_Variable_3' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_GetSubGame_ReturnValue) == 0x00006C, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_GetSubGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, K2Node_SwitchEnum_CmpSuccess) == 0x00006D, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_GetSubGame_ReturnValue_1) == 0x00006E, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_GetSubGame_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000070, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000080, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000088, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, Temp_byte_Variable) == 0x000089, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, K2Node_Select_Default) == 0x00008C, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000090, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, Temp_int_Variable) == 0x000118, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_Array_Get_Item) == 0x000120, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000128, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_Add_IntInt_ReturnValue) == 0x00012C, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, K2Node_SwitchEnum_CmpSuccess_1) == 0x000130, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_Conv_FloatToVector_ReturnValue) == 0x000134, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_IsValid_ReturnValue_1) == 0x000140, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_GetSubGame_ReturnValue_2) == 0x000141, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_GetSubGame_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, K2Node_SwitchEnum_CmpSuccess_2) == 0x000142, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000143, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_Add_FloatFloat_ReturnValue) == 0x000144, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000148, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x00014C, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");

// Function B_Pickups_Parent.B_Pickups_Parent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct B_Pickups_Parent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Pickups_Parent_C_ReceiveTick) == 0x000004, "Wrong alignment on B_Pickups_Parent_C_ReceiveTick");
static_assert(sizeof(B_Pickups_Parent_C_ReceiveTick) == 0x000004, "Wrong size on B_Pickups_Parent_C_ReceiveTick");
static_assert(offsetof(B_Pickups_Parent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'B_Pickups_Parent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function B_Pickups_Parent.B_Pickups_Parent_C.OnAboutToEnterBackpack
// 0x0008 (0x0008 - 0x0000)
struct B_Pickups_Parent_C_OnAboutToEnterBackpack final
{
public:
	class AFortPawn*                              PickupTarget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Pickups_Parent_C_OnAboutToEnterBackpack) == 0x000008, "Wrong alignment on B_Pickups_Parent_C_OnAboutToEnterBackpack");
static_assert(sizeof(B_Pickups_Parent_C_OnAboutToEnterBackpack) == 0x000008, "Wrong size on B_Pickups_Parent_C_OnAboutToEnterBackpack");
static_assert(offsetof(B_Pickups_Parent_C_OnAboutToEnterBackpack, PickupTarget) == 0x000000, "Member 'B_Pickups_Parent_C_OnAboutToEnterBackpack::PickupTarget' has a wrong offset!");

// Function B_Pickups_Parent.B_Pickups_Parent_C.UserConstructionScript
// 0x00B0 (0x00B0 - 0x0000)
struct B_Pickups_Parent_C_UserConstructionScript final
{
public:
	struct FTransform                             Temp_struct_Variable;                              // 0x0000(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FTransform                             Temp_struct_Variable_1;                            // 0x0030(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class USkeletalMeshComponent*                 CallFunc_AddComponent_ReturnValue;                 // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue_1;               // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_Select_Default;                             // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Pickups_Parent_C_UserConstructionScript) == 0x000010, "Wrong alignment on B_Pickups_Parent_C_UserConstructionScript");
static_assert(sizeof(B_Pickups_Parent_C_UserConstructionScript) == 0x0000B0, "Wrong size on B_Pickups_Parent_C_UserConstructionScript");
static_assert(offsetof(B_Pickups_Parent_C_UserConstructionScript, Temp_struct_Variable) == 0x000000, "Member 'B_Pickups_Parent_C_UserConstructionScript::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_UserConstructionScript, Temp_struct_Variable_1) == 0x000030, "Member 'B_Pickups_Parent_C_UserConstructionScript::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue) == 0x000060, "Member 'B_Pickups_Parent_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue_1) == 0x000068, "Member 'B_Pickups_Parent_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_UserConstructionScript, Temp_bool_Variable) == 0x000070, "Member 'B_Pickups_Parent_C_UserConstructionScript::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_UserConstructionScript, CallFunc_GetComponentBounds_Origin) == 0x000074, "Member 'B_Pickups_Parent_C_UserConstructionScript::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_UserConstructionScript, CallFunc_GetComponentBounds_BoxExtent) == 0x000080, "Member 'B_Pickups_Parent_C_UserConstructionScript::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_UserConstructionScript, CallFunc_GetComponentBounds_SphereRadius) == 0x00008C, "Member 'B_Pickups_Parent_C_UserConstructionScript::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000090, "Member 'B_Pickups_Parent_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_UserConstructionScript, K2Node_Select_Default) == 0x000098, "Member 'B_Pickups_Parent_C_UserConstructionScript::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x0000A0, "Member 'B_Pickups_Parent_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x0000A1, "Member 'B_Pickups_Parent_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

// Function B_Pickups_Parent.B_Pickups_Parent_C.SetRarityColor
// 0x0070 (0x0070 - 0x0000)
struct B_Pickups_Parent_C_SetRarityColor final
{
public:
	EFortRarity                                   Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_6;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_7;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMilestoneModeEnabled_ReturnValue;       // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortItemType                                 CallFunc_GetItemType_ReturnValue;                  // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Array_Get_Item;                           // 0x002C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Array_Get_Item_1;                         // 0x003C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItem*                              CallFunc_CreateTemporaryItemInstanceBP_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortRarity                                   CallFunc_GetRarity_ReturnValue;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Pickups_Parent_C_SetRarityColor) == 0x000008, "Wrong alignment on B_Pickups_Parent_C_SetRarityColor");
static_assert(sizeof(B_Pickups_Parent_C_SetRarityColor) == 0x000070, "Wrong size on B_Pickups_Parent_C_SetRarityColor");
static_assert(offsetof(B_Pickups_Parent_C_SetRarityColor, Temp_byte_Variable) == 0x000000, "Member 'B_Pickups_Parent_C_SetRarityColor::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetRarityColor, Temp_int_Variable) == 0x000004, "Member 'B_Pickups_Parent_C_SetRarityColor::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetRarityColor, Temp_int_Variable_1) == 0x000008, "Member 'B_Pickups_Parent_C_SetRarityColor::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetRarityColor, Temp_int_Variable_2) == 0x00000C, "Member 'B_Pickups_Parent_C_SetRarityColor::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetRarityColor, Temp_int_Variable_3) == 0x000010, "Member 'B_Pickups_Parent_C_SetRarityColor::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetRarityColor, Temp_int_Variable_4) == 0x000014, "Member 'B_Pickups_Parent_C_SetRarityColor::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetRarityColor, Temp_int_Variable_5) == 0x000018, "Member 'B_Pickups_Parent_C_SetRarityColor::Temp_int_Variable_5' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetRarityColor, Temp_int_Variable_6) == 0x00001C, "Member 'B_Pickups_Parent_C_SetRarityColor::Temp_int_Variable_6' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetRarityColor, Temp_int_Variable_7) == 0x000020, "Member 'B_Pickups_Parent_C_SetRarityColor::Temp_int_Variable_7' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetRarityColor, CallFunc_IsValid_ReturnValue) == 0x000024, "Member 'B_Pickups_Parent_C_SetRarityColor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetRarityColor, CallFunc_IsMilestoneModeEnabled_ReturnValue) == 0x000025, "Member 'B_Pickups_Parent_C_SetRarityColor::CallFunc_IsMilestoneModeEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetRarityColor, CallFunc_GetItemType_ReturnValue) == 0x000026, "Member 'B_Pickups_Parent_C_SetRarityColor::CallFunc_GetItemType_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetRarityColor, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000027, "Member 'B_Pickups_Parent_C_SetRarityColor::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetRarityColor, CallFunc_BooleanAND_ReturnValue) == 0x000028, "Member 'B_Pickups_Parent_C_SetRarityColor::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetRarityColor, CallFunc_Array_Get_Item) == 0x00002C, "Member 'B_Pickups_Parent_C_SetRarityColor::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetRarityColor, CallFunc_Array_Get_Item_1) == 0x00003C, "Member 'B_Pickups_Parent_C_SetRarityColor::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetRarityColor, CallFunc_Array_IsValidIndex_ReturnValue) == 0x00004C, "Member 'B_Pickups_Parent_C_SetRarityColor::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetRarityColor, CallFunc_SelectColor_ReturnValue) == 0x000050, "Member 'B_Pickups_Parent_C_SetRarityColor::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetRarityColor, CallFunc_CreateTemporaryItemInstanceBP_ReturnValue) == 0x000060, "Member 'B_Pickups_Parent_C_SetRarityColor::CallFunc_CreateTemporaryItemInstanceBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetRarityColor, CallFunc_GetRarity_ReturnValue) == 0x000068, "Member 'B_Pickups_Parent_C_SetRarityColor::CallFunc_GetRarity_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetRarityColor, K2Node_Select_Default) == 0x00006C, "Member 'B_Pickups_Parent_C_SetRarityColor::K2Node_Select_Default' has a wrong offset!");

// Function B_Pickups_Parent.B_Pickups_Parent_C.SpawnPickedUpTrailPS
// 0x0028 (0x0028 - 0x0000)
struct B_Pickups_Parent_C_SpawnPickedUpTrailPS final
{
public:
	class UParticleSystemComponent*               TrailPS;                                           // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item;                           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item_1;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Pickups_Parent_C_SpawnPickedUpTrailPS) == 0x000008, "Wrong alignment on B_Pickups_Parent_C_SpawnPickedUpTrailPS");
static_assert(sizeof(B_Pickups_Parent_C_SpawnPickedUpTrailPS) == 0x000028, "Wrong size on B_Pickups_Parent_C_SpawnPickedUpTrailPS");
static_assert(offsetof(B_Pickups_Parent_C_SpawnPickedUpTrailPS, TrailPS) == 0x000000, "Member 'B_Pickups_Parent_C_SpawnPickedUpTrailPS::TrailPS' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SpawnPickedUpTrailPS, CallFunc_Array_Get_Item) == 0x000008, "Member 'B_Pickups_Parent_C_SpawnPickedUpTrailPS::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SpawnPickedUpTrailPS, CallFunc_Array_Get_Item_1) == 0x00000C, "Member 'B_Pickups_Parent_C_SpawnPickedUpTrailPS::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SpawnPickedUpTrailPS, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x000010, "Member 'B_Pickups_Parent_C_SpawnPickedUpTrailPS::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SpawnPickedUpTrailPS, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000020, "Member 'B_Pickups_Parent_C_SpawnPickedUpTrailPS::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");

// Function B_Pickups_Parent.B_Pickups_Parent_C.SetHologramPickedUpParams
// 0x0068 (0x0068 - 0x0000)
struct B_Pickups_Parent_C_SetHologramPickedUpParams final
{
public:
	bool                                          Tier_0;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item_1;                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Fraction_ReturnValue;                     // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue_1;       // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Fraction_ReturnValue_1;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue_2;       // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue_3;       // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Pickups_Parent_C_SetHologramPickedUpParams) == 0x000008, "Wrong alignment on B_Pickups_Parent_C_SetHologramPickedUpParams");
static_assert(sizeof(B_Pickups_Parent_C_SetHologramPickedUpParams) == 0x000068, "Wrong size on B_Pickups_Parent_C_SetHologramPickedUpParams");
static_assert(offsetof(B_Pickups_Parent_C_SetHologramPickedUpParams, Tier_0) == 0x000000, "Member 'B_Pickups_Parent_C_SetHologramPickedUpParams::Tier_0' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetHologramPickedUpParams, Temp_int_Array_Index_Variable) == 0x000004, "Member 'B_Pickups_Parent_C_SetHologramPickedUpParams::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetHologramPickedUpParams, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'B_Pickups_Parent_C_SetHologramPickedUpParams::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetHologramPickedUpParams, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'B_Pickups_Parent_C_SetHologramPickedUpParams::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetHologramPickedUpParams, Temp_int_Loop_Counter_Variable_1) == 0x000010, "Member 'B_Pickups_Parent_C_SetHologramPickedUpParams::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetHologramPickedUpParams, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'B_Pickups_Parent_C_SetHologramPickedUpParams::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetHologramPickedUpParams, Temp_int_Array_Index_Variable_1) == 0x000018, "Member 'B_Pickups_Parent_C_SetHologramPickedUpParams::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetHologramPickedUpParams, CallFunc_Array_Get_Item) == 0x000020, "Member 'B_Pickups_Parent_C_SetHologramPickedUpParams::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetHologramPickedUpParams, CallFunc_Array_Get_Item_1) == 0x000028, "Member 'B_Pickups_Parent_C_SetHologramPickedUpParams::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetHologramPickedUpParams, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'B_Pickups_Parent_C_SetHologramPickedUpParams::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetHologramPickedUpParams, CallFunc_IsValid_ReturnValue_1) == 0x000031, "Member 'B_Pickups_Parent_C_SetHologramPickedUpParams::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetHologramPickedUpParams, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'B_Pickups_Parent_C_SetHologramPickedUpParams::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetHologramPickedUpParams, CallFunc_Array_Length_ReturnValue_1) == 0x000038, "Member 'B_Pickups_Parent_C_SetHologramPickedUpParams::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetHologramPickedUpParams, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'B_Pickups_Parent_C_SetHologramPickedUpParams::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetHologramPickedUpParams, CallFunc_Less_IntInt_ReturnValue_1) == 0x00003D, "Member 'B_Pickups_Parent_C_SetHologramPickedUpParams::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetHologramPickedUpParams, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000040, "Member 'B_Pickups_Parent_C_SetHologramPickedUpParams::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetHologramPickedUpParams, CallFunc_Fraction_ReturnValue) == 0x000044, "Member 'B_Pickups_Parent_C_SetHologramPickedUpParams::CallFunc_Fraction_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetHologramPickedUpParams, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000048, "Member 'B_Pickups_Parent_C_SetHologramPickedUpParams::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetHologramPickedUpParams, CallFunc_GetGameTimeInSeconds_ReturnValue_1) == 0x00004C, "Member 'B_Pickups_Parent_C_SetHologramPickedUpParams::CallFunc_GetGameTimeInSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetHologramPickedUpParams, CallFunc_Fraction_ReturnValue_1) == 0x000050, "Member 'B_Pickups_Parent_C_SetHologramPickedUpParams::CallFunc_Fraction_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetHologramPickedUpParams, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000054, "Member 'B_Pickups_Parent_C_SetHologramPickedUpParams::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetHologramPickedUpParams, CallFunc_GetGameTimeInSeconds_ReturnValue_2) == 0x000058, "Member 'B_Pickups_Parent_C_SetHologramPickedUpParams::CallFunc_GetGameTimeInSeconds_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetHologramPickedUpParams, CallFunc_Add_FloatFloat_ReturnValue) == 0x00005C, "Member 'B_Pickups_Parent_C_SetHologramPickedUpParams::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetHologramPickedUpParams, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000060, "Member 'B_Pickups_Parent_C_SetHologramPickedUpParams::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetHologramPickedUpParams, CallFunc_GetGameTimeInSeconds_ReturnValue_3) == 0x000064, "Member 'B_Pickups_Parent_C_SetHologramPickedUpParams::CallFunc_GetGameTimeInSeconds_ReturnValue_3' has a wrong offset!");

// Function B_Pickups_Parent.B_Pickups_Parent_C.ScaleHologramTimingsForPvP
// 0x001C (0x001C - 0x0000)
struct B_Pickups_Parent_C_ScaleHologramTimingsForPvP final
{
public:
	float                                         PVP_TimeScale;                                     // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESubGame                                      CallFunc_GetSubGame_ReturnValue;                   // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Pickups_Parent_C_ScaleHologramTimingsForPvP) == 0x000004, "Wrong alignment on B_Pickups_Parent_C_ScaleHologramTimingsForPvP");
static_assert(sizeof(B_Pickups_Parent_C_ScaleHologramTimingsForPvP) == 0x00001C, "Wrong size on B_Pickups_Parent_C_ScaleHologramTimingsForPvP");
static_assert(offsetof(B_Pickups_Parent_C_ScaleHologramTimingsForPvP, PVP_TimeScale) == 0x000000, "Member 'B_Pickups_Parent_C_ScaleHologramTimingsForPvP::PVP_TimeScale' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ScaleHologramTimingsForPvP, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000004, "Member 'B_Pickups_Parent_C_ScaleHologramTimingsForPvP::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ScaleHologramTimingsForPvP, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000008, "Member 'B_Pickups_Parent_C_ScaleHologramTimingsForPvP::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ScaleHologramTimingsForPvP, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x00000C, "Member 'B_Pickups_Parent_C_ScaleHologramTimingsForPvP::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ScaleHologramTimingsForPvP, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x000010, "Member 'B_Pickups_Parent_C_ScaleHologramTimingsForPvP::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ScaleHologramTimingsForPvP, CallFunc_GetSubGame_ReturnValue) == 0x000014, "Member 'B_Pickups_Parent_C_ScaleHologramTimingsForPvP::CallFunc_GetSubGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ScaleHologramTimingsForPvP, K2Node_SwitchEnum_CmpSuccess) == 0x000015, "Member 'B_Pickups_Parent_C_ScaleHologramTimingsForPvP::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ScaleHologramTimingsForPvP, CallFunc_Multiply_FloatFloat_ReturnValue_4) == 0x000018, "Member 'B_Pickups_Parent_C_ScaleHologramTimingsForPvP::CallFunc_Multiply_FloatFloat_ReturnValue_4' has a wrong offset!");

// Function B_Pickups_Parent.B_Pickups_Parent_C.ReleaseStretchMIDs
// 0x0018 (0x0018 - 0x0000)
struct B_Pickups_Parent_C_ReleaseStretchMIDs final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Pickups_Parent_C_ReleaseStretchMIDs) == 0x000004, "Wrong alignment on B_Pickups_Parent_C_ReleaseStretchMIDs");
static_assert(sizeof(B_Pickups_Parent_C_ReleaseStretchMIDs) == 0x000018, "Wrong size on B_Pickups_Parent_C_ReleaseStretchMIDs");
static_assert(offsetof(B_Pickups_Parent_C_ReleaseStretchMIDs, Temp_int_Array_Index_Variable) == 0x000000, "Member 'B_Pickups_Parent_C_ReleaseStretchMIDs::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ReleaseStretchMIDs, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'B_Pickups_Parent_C_ReleaseStretchMIDs::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ReleaseStretchMIDs, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'B_Pickups_Parent_C_ReleaseStretchMIDs::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ReleaseStretchMIDs, CallFunc_Array_Get_Item) == 0x00000C, "Member 'B_Pickups_Parent_C_ReleaseStretchMIDs::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ReleaseStretchMIDs, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'B_Pickups_Parent_C_ReleaseStretchMIDs::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ReleaseStretchMIDs, CallFunc_Less_IntInt_ReturnValue) == 0x000014, "Member 'B_Pickups_Parent_C_ReleaseStretchMIDs::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function B_Pickups_Parent.B_Pickups_Parent_C.SetHiddenBackgroundVisualComponents
// 0x0001 (0x0001 - 0x0000)
struct B_Pickups_Parent_C_SetHiddenBackgroundVisualComponents final
{
public:
	bool                                          Hidden;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Pickups_Parent_C_SetHiddenBackgroundVisualComponents) == 0x000001, "Wrong alignment on B_Pickups_Parent_C_SetHiddenBackgroundVisualComponents");
static_assert(sizeof(B_Pickups_Parent_C_SetHiddenBackgroundVisualComponents) == 0x000001, "Wrong size on B_Pickups_Parent_C_SetHiddenBackgroundVisualComponents");
static_assert(offsetof(B_Pickups_Parent_C_SetHiddenBackgroundVisualComponents, Hidden) == 0x000000, "Member 'B_Pickups_Parent_C_SetHiddenBackgroundVisualComponents::Hidden' has a wrong offset!");

// Function B_Pickups_Parent.B_Pickups_Parent_C.SetupBaseMIDs
// 0x0030 (0x0030 - 0x0000)
struct B_Pickups_Parent_C_SetupBaseMIDs final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterial*                              CallFunc_GetBaseMaterial_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
