#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BlueprintContext

#include "Basic.hpp"


namespace SDK::Params
{

// Function BlueprintContext.BlueprintContextLibrary.GetContext
// 0x0018 (0x0018 - 0x0000)
struct BlueprintContextLibrary_GetContext final
{
public:
	class UObject*                                ContextObject;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class USubsystem>                 Param_Class;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USubsystem*                             ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlueprintContextLibrary_GetContext) == 0x000008, "Wrong alignment on BlueprintContextLibrary_GetContext");
static_assert(sizeof(BlueprintContextLibrary_GetContext) == 0x000018, "Wrong size on BlueprintContextLibrary_GetContext");
static_assert(offsetof(BlueprintContextLibrary_GetContext, ContextObject) == 0x000000, "Member 'BlueprintContextLibrary_GetContext::ContextObject' has a wrong offset!");
static_assert(offsetof(BlueprintContextLibrary_GetContext, Param_Class) == 0x000008, "Member 'BlueprintContextLibrary_GetContext::Param_Class' has a wrong offset!");
static_assert(offsetof(BlueprintContextLibrary_GetContext, ReturnValue) == 0x000010, "Member 'BlueprintContextLibrary_GetContext::ReturnValue' has a wrong offset!");

}

