#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AmbientAudioController

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function BP_AmbientAudioController.BP_AmbientAudioController_C.ExecuteUbergraph_BP_AmbientAudioController
// 0x00D8 (0x00D8 - 0x0000)
struct BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorRightVector_ReturnValue;          // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Trace_ReturnValue;                        // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Trace_ReturnValue_1;                      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Trace_ReturnValue_2;                      // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Trace_ReturnValue_3;                      // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Trace_ReturnValue_4;                      // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x005F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0070(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   K2Node_DynamicCast_AsFort_Game_State_Athena;       // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EAthenaGamePhase                              K2Node_CustomEvent_GamePhase;                      // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAthenaGamePhase GamePhase)>   K2Node_CreateDelegate_OutputDelegate_1;            // 0x009C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EAthenaGamePhaseStep                          K2Node_CustomEvent_GamePhaseStep;                  // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AE[0x2];                                       // 0x00AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAthenaGamePhaseStep GamePhaseStep)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00B0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_Enabled;                        // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBROnly_ReturnValue;                     // 0x00C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C6[0x2];                                       // 0x00C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue_1;              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController) == 0x000008, "Wrong alignment on BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController");
static_assert(sizeof(BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController) == 0x0000D8, "Wrong size on BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController");
static_assert(offsetof(BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController, EntryPoint) == 0x000000, "Member 'BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController, CallFunc_GetViewTarget_ReturnValue) == 0x000008, "Member 'BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController, CallFunc_GetActorUpVector_ReturnValue) == 0x000010, "Member 'BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController, CallFunc_GetActorRightVector_ReturnValue) == 0x00001C, "Member 'BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController::CallFunc_GetActorRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController, CallFunc_GetActorForwardVector_ReturnValue) == 0x000028, "Member 'BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000034, "Member 'BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000040, "Member 'BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00004C, "Member 'BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController, CallFunc_Trace_ReturnValue) == 0x000058, "Member 'BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController::CallFunc_Trace_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController, CallFunc_Trace_ReturnValue_1) == 0x000059, "Member 'BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController::CallFunc_Trace_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController, CallFunc_Trace_ReturnValue_2) == 0x00005A, "Member 'BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController::CallFunc_Trace_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController, CallFunc_Trace_ReturnValue_3) == 0x00005B, "Member 'BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController::CallFunc_Trace_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController, CallFunc_Trace_ReturnValue_4) == 0x00005C, "Member 'BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController::CallFunc_Trace_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController, CallFunc_IsValid_ReturnValue) == 0x00005D, "Member 'BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController, K2Node_Event_EndPlayReason) == 0x00005E, "Member 'BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController, CallFunc_IsValid_ReturnValue_1) == 0x00005F, "Member 'BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController, K2Node_CreateDelegate_OutputDelegate) == 0x000060, "Member 'BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000070, "Member 'BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000078, "Member 'BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController, K2Node_Event_DeltaSeconds) == 0x00007C, "Member 'BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000080, "Member 'BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController, CallFunc_FInterpTo_ReturnValue) == 0x000084, "Member 'BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController, CallFunc_GetGameState_ReturnValue) == 0x000088, "Member 'BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController, K2Node_DynamicCast_AsFort_Game_State_Athena) == 0x000090, "Member 'BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController::K2Node_DynamicCast_AsFort_Game_State_Athena' has a wrong offset!");
static_assert(offsetof(BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController, K2Node_CustomEvent_GamePhase) == 0x000099, "Member 'BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController::K2Node_CustomEvent_GamePhase' has a wrong offset!");
static_assert(offsetof(BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController, K2Node_CreateDelegate_OutputDelegate_1) == 0x00009C, "Member 'BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController, K2Node_SwitchEnum_CmpSuccess) == 0x0000AC, "Member 'BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController, K2Node_CustomEvent_GamePhaseStep) == 0x0000AD, "Member 'BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController::K2Node_CustomEvent_GamePhaseStep' has a wrong offset!");
static_assert(offsetof(BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000B0, "Member 'BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController, K2Node_SwitchEnum_CmpSuccess_1) == 0x0000C0, "Member 'BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController, K2Node_CustomEvent_Enabled) == 0x0000C1, "Member 'BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController::K2Node_CustomEvent_Enabled' has a wrong offset!");
static_assert(offsetof(BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController, CallFunc_IsValid_ReturnValue_2) == 0x0000C2, "Member 'BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController, CallFunc_IsBROnly_ReturnValue) == 0x0000C3, "Member 'BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController::CallFunc_IsBROnly_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController, CallFunc_IsMobileGame_ReturnValue) == 0x0000C4, "Member 'BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController, CallFunc_BooleanAND_ReturnValue) == 0x0000C5, "Member 'BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController, CallFunc_GetViewTarget_ReturnValue_1) == 0x0000C8, "Member 'BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController::CallFunc_GetViewTarget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController, CallFunc_IsValid_ReturnValue_3) == 0x0000D0, "Member 'BP_AmbientAudioController_C_ExecuteUbergraph_BP_AmbientAudioController::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");

// Function BP_AmbientAudioController.BP_AmbientAudioController_C.Set Storm Amb Layer Enabled
// 0x0001 (0x0001 - 0x0000)
struct BP_AmbientAudioController_C_Set_Storm_Amb_Layer_Enabled final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AmbientAudioController_C_Set_Storm_Amb_Layer_Enabled) == 0x000001, "Wrong alignment on BP_AmbientAudioController_C_Set_Storm_Amb_Layer_Enabled");
static_assert(sizeof(BP_AmbientAudioController_C_Set_Storm_Amb_Layer_Enabled) == 0x000001, "Wrong size on BP_AmbientAudioController_C_Set_Storm_Amb_Layer_Enabled");
static_assert(offsetof(BP_AmbientAudioController_C_Set_Storm_Amb_Layer_Enabled, Enabled) == 0x000000, "Member 'BP_AmbientAudioController_C_Set_Storm_Amb_Layer_Enabled::Enabled' has a wrong offset!");

// Function BP_AmbientAudioController.BP_AmbientAudioController_C.On Game Phase Step Change
// 0x0001 (0x0001 - 0x0000)
struct BP_AmbientAudioController_C_On_Game_Phase_Step_Change final
{
public:
	EAthenaGamePhaseStep                          GamePhaseStep;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AmbientAudioController_C_On_Game_Phase_Step_Change) == 0x000001, "Wrong alignment on BP_AmbientAudioController_C_On_Game_Phase_Step_Change");
static_assert(sizeof(BP_AmbientAudioController_C_On_Game_Phase_Step_Change) == 0x000001, "Wrong size on BP_AmbientAudioController_C_On_Game_Phase_Step_Change");
static_assert(offsetof(BP_AmbientAudioController_C_On_Game_Phase_Step_Change, GamePhaseStep) == 0x000000, "Member 'BP_AmbientAudioController_C_On_Game_Phase_Step_Change::GamePhaseStep' has a wrong offset!");

// Function BP_AmbientAudioController.BP_AmbientAudioController_C.On Game Phase Change
// 0x0001 (0x0001 - 0x0000)
struct BP_AmbientAudioController_C_On_Game_Phase_Change final
{
public:
	EAthenaGamePhase                              GamePhase;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AmbientAudioController_C_On_Game_Phase_Change) == 0x000001, "Wrong alignment on BP_AmbientAudioController_C_On_Game_Phase_Change");
static_assert(sizeof(BP_AmbientAudioController_C_On_Game_Phase_Change) == 0x000001, "Wrong size on BP_AmbientAudioController_C_On_Game_Phase_Change");
static_assert(offsetof(BP_AmbientAudioController_C_On_Game_Phase_Change, GamePhase) == 0x000000, "Member 'BP_AmbientAudioController_C_On_Game_Phase_Change::GamePhase' has a wrong offset!");

// Function BP_AmbientAudioController.BP_AmbientAudioController_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_AmbientAudioController_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AmbientAudioController_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_AmbientAudioController_C_ReceiveTick");
static_assert(sizeof(BP_AmbientAudioController_C_ReceiveTick) == 0x000004, "Wrong size on BP_AmbientAudioController_C_ReceiveTick");
static_assert(offsetof(BP_AmbientAudioController_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_AmbientAudioController_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_AmbientAudioController.BP_AmbientAudioController_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_AmbientAudioController_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AmbientAudioController_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_AmbientAudioController_C_ReceiveEndPlay");
static_assert(sizeof(BP_AmbientAudioController_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_AmbientAudioController_C_ReceiveEndPlay");
static_assert(offsetof(BP_AmbientAudioController_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_AmbientAudioController_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_AmbientAudioController.BP_AmbientAudioController_C.Trace
// 0x00D8 (0x00D8 - 0x0000)
struct BP_AmbientAudioController_C_Trace final
{
public:
	struct FVector                                Start;                                             // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Direction;                                         // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0020(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0048(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AmbientAudioController_C_Trace) == 0x000008, "Wrong alignment on BP_AmbientAudioController_C_Trace");
static_assert(sizeof(BP_AmbientAudioController_C_Trace) == 0x0000D8, "Wrong size on BP_AmbientAudioController_C_Trace");
static_assert(offsetof(BP_AmbientAudioController_C_Trace, Start) == 0x000000, "Member 'BP_AmbientAudioController_C_Trace::Start' has a wrong offset!");
static_assert(offsetof(BP_AmbientAudioController_C_Trace, Direction) == 0x00000C, "Member 'BP_AmbientAudioController_C_Trace::Direction' has a wrong offset!");
static_assert(offsetof(BP_AmbientAudioController_C_Trace, ReturnValue) == 0x000018, "Member 'BP_AmbientAudioController_C_Trace::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmbientAudioController_C_Trace, Temp_object_Variable) == 0x000020, "Member 'BP_AmbientAudioController_C_Trace::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_AmbientAudioController_C_Trace, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000030, "Member 'BP_AmbientAudioController_C_Trace::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmbientAudioController_C_Trace, CallFunc_Add_VectorVector_ReturnValue) == 0x00003C, "Member 'BP_AmbientAudioController_C_Trace::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmbientAudioController_C_Trace, CallFunc_LineTraceSingle_OutHit) == 0x000048, "Member 'BP_AmbientAudioController_C_Trace::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(BP_AmbientAudioController_C_Trace, CallFunc_LineTraceSingle_ReturnValue) == 0x0000D0, "Member 'BP_AmbientAudioController_C_Trace::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");

// Function BP_AmbientAudioController.BP_AmbientAudioController_C.SetIndoorMixEnabled
// 0x0010 (0x0010 - 0x0000)
struct BP_AmbientAudioController_C_SetIndoorMixEnabled final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AmbientAudioController_C_SetIndoorMixEnabled) == 0x000008, "Wrong alignment on BP_AmbientAudioController_C_SetIndoorMixEnabled");
static_assert(sizeof(BP_AmbientAudioController_C_SetIndoorMixEnabled) == 0x000010, "Wrong size on BP_AmbientAudioController_C_SetIndoorMixEnabled");
static_assert(offsetof(BP_AmbientAudioController_C_SetIndoorMixEnabled, Enabled) == 0x000000, "Member 'BP_AmbientAudioController_C_SetIndoorMixEnabled::Enabled' has a wrong offset!");
static_assert(offsetof(BP_AmbientAudioController_C_SetIndoorMixEnabled, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'BP_AmbientAudioController_C_SetIndoorMixEnabled::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmbientAudioController_C_SetIndoorMixEnabled, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x000008, "Member 'BP_AmbientAudioController_C_SetIndoorMixEnabled::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");

// Function BP_AmbientAudioController.BP_AmbientAudioController_C.SetTargetLPFFreq
// 0x0004 (0x0004 - 0x0000)
struct BP_AmbientAudioController_C_SetTargetLPFFreq final
{
public:
	float                                         Target;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AmbientAudioController_C_SetTargetLPFFreq) == 0x000004, "Wrong alignment on BP_AmbientAudioController_C_SetTargetLPFFreq");
static_assert(sizeof(BP_AmbientAudioController_C_SetTargetLPFFreq) == 0x000004, "Wrong size on BP_AmbientAudioController_C_SetTargetLPFFreq");
static_assert(offsetof(BP_AmbientAudioController_C_SetTargetLPFFreq, Target) == 0x000000, "Member 'BP_AmbientAudioController_C_SetTargetLPFFreq::Target' has a wrong offset!");

}

