#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BannerEditorTile

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_BannerEditorTile.BP_BannerEditorTile_C.ExecuteUbergraph_BP_BannerEditorTile
// 0x00E8 (0x00E8 - 0x0000)
struct BP_BannerEditorTile_C_ExecuteUbergraph_BP_BannerEditorTile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetListItemObject_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortHomebaseBannerColorItem*           K2Node_DynamicCast_AsFort_Homebase_Banner_Color_Item; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHomebaseBannerIconItem*            K2Node_DynamicCast_AsFort_Homebase_Banner_Icon_Item; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetListItemObject_ReturnValue_1;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortHomebaseBannerIconItem*            K2Node_DynamicCast_AsFort_Homebase_Banner_Icon_Item_1; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetBannerSmallIconAsset_ReturnValue;      // 0x0048(0x0028)(HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Object;                         // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetListItemObject_ReturnValue_2;          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortHomebaseBannerColorItem*           K2Node_DynamicCast_AsFort_Homebase_Banner_Color_Item_1; // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetBannerColorSecondaryColor_ReturnValue; // 0x00AC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetBannerColorPrimaryColor_ReturnValue;   // 0x00BC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BannerEditorTile_C_ExecuteUbergraph_BP_BannerEditorTile) == 0x000008, "Wrong alignment on BP_BannerEditorTile_C_ExecuteUbergraph_BP_BannerEditorTile");
static_assert(sizeof(BP_BannerEditorTile_C_ExecuteUbergraph_BP_BannerEditorTile) == 0x0000E8, "Wrong size on BP_BannerEditorTile_C_ExecuteUbergraph_BP_BannerEditorTile");
static_assert(offsetof(BP_BannerEditorTile_C_ExecuteUbergraph_BP_BannerEditorTile, EntryPoint) == 0x000000, "Member 'BP_BannerEditorTile_C_ExecuteUbergraph_BP_BannerEditorTile::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BannerEditorTile_C_ExecuteUbergraph_BP_BannerEditorTile, CallFunc_GetListItemObject_ReturnValue) == 0x000008, "Member 'BP_BannerEditorTile_C_ExecuteUbergraph_BP_BannerEditorTile::CallFunc_GetListItemObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BannerEditorTile_C_ExecuteUbergraph_BP_BannerEditorTile, K2Node_DynamicCast_AsFort_Homebase_Banner_Color_Item) == 0x000010, "Member 'BP_BannerEditorTile_C_ExecuteUbergraph_BP_BannerEditorTile::K2Node_DynamicCast_AsFort_Homebase_Banner_Color_Item' has a wrong offset!");
static_assert(offsetof(BP_BannerEditorTile_C_ExecuteUbergraph_BP_BannerEditorTile, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_BannerEditorTile_C_ExecuteUbergraph_BP_BannerEditorTile::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BannerEditorTile_C_ExecuteUbergraph_BP_BannerEditorTile, K2Node_DynamicCast_AsFort_Homebase_Banner_Icon_Item) == 0x000020, "Member 'BP_BannerEditorTile_C_ExecuteUbergraph_BP_BannerEditorTile::K2Node_DynamicCast_AsFort_Homebase_Banner_Icon_Item' has a wrong offset!");
static_assert(offsetof(BP_BannerEditorTile_C_ExecuteUbergraph_BP_BannerEditorTile, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'BP_BannerEditorTile_C_ExecuteUbergraph_BP_BannerEditorTile::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_BannerEditorTile_C_ExecuteUbergraph_BP_BannerEditorTile, CallFunc_GetListItemObject_ReturnValue_1) == 0x000030, "Member 'BP_BannerEditorTile_C_ExecuteUbergraph_BP_BannerEditorTile::CallFunc_GetListItemObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BannerEditorTile_C_ExecuteUbergraph_BP_BannerEditorTile, K2Node_DynamicCast_AsFort_Homebase_Banner_Icon_Item_1) == 0x000038, "Member 'BP_BannerEditorTile_C_ExecuteUbergraph_BP_BannerEditorTile::K2Node_DynamicCast_AsFort_Homebase_Banner_Icon_Item_1' has a wrong offset!");
static_assert(offsetof(BP_BannerEditorTile_C_ExecuteUbergraph_BP_BannerEditorTile, K2Node_DynamicCast_bSuccess_2) == 0x000040, "Member 'BP_BannerEditorTile_C_ExecuteUbergraph_BP_BannerEditorTile::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_BannerEditorTile_C_ExecuteUbergraph_BP_BannerEditorTile, CallFunc_GetBannerSmallIconAsset_ReturnValue) == 0x000048, "Member 'BP_BannerEditorTile_C_ExecuteUbergraph_BP_BannerEditorTile::CallFunc_GetBannerSmallIconAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BannerEditorTile_C_ExecuteUbergraph_BP_BannerEditorTile, K2Node_CustomEvent_Object) == 0x000070, "Member 'BP_BannerEditorTile_C_ExecuteUbergraph_BP_BannerEditorTile::K2Node_CustomEvent_Object' has a wrong offset!");
static_assert(offsetof(BP_BannerEditorTile_C_ExecuteUbergraph_BP_BannerEditorTile, K2Node_CreateDelegate_OutputDelegate) == 0x000078, "Member 'BP_BannerEditorTile_C_ExecuteUbergraph_BP_BannerEditorTile::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_BannerEditorTile_C_ExecuteUbergraph_BP_BannerEditorTile, K2Node_DynamicCast_AsTexture_2D) == 0x000088, "Member 'BP_BannerEditorTile_C_ExecuteUbergraph_BP_BannerEditorTile::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(BP_BannerEditorTile_C_ExecuteUbergraph_BP_BannerEditorTile, K2Node_DynamicCast_bSuccess_3) == 0x000090, "Member 'BP_BannerEditorTile_C_ExecuteUbergraph_BP_BannerEditorTile::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_BannerEditorTile_C_ExecuteUbergraph_BP_BannerEditorTile, CallFunc_GetListItemObject_ReturnValue_2) == 0x000098, "Member 'BP_BannerEditorTile_C_ExecuteUbergraph_BP_BannerEditorTile::CallFunc_GetListItemObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BannerEditorTile_C_ExecuteUbergraph_BP_BannerEditorTile, K2Node_DynamicCast_AsFort_Homebase_Banner_Color_Item_1) == 0x0000A0, "Member 'BP_BannerEditorTile_C_ExecuteUbergraph_BP_BannerEditorTile::K2Node_DynamicCast_AsFort_Homebase_Banner_Color_Item_1' has a wrong offset!");
static_assert(offsetof(BP_BannerEditorTile_C_ExecuteUbergraph_BP_BannerEditorTile, K2Node_DynamicCast_bSuccess_4) == 0x0000A8, "Member 'BP_BannerEditorTile_C_ExecuteUbergraph_BP_BannerEditorTile::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_BannerEditorTile_C_ExecuteUbergraph_BP_BannerEditorTile, CallFunc_GetBannerColorSecondaryColor_ReturnValue) == 0x0000AC, "Member 'BP_BannerEditorTile_C_ExecuteUbergraph_BP_BannerEditorTile::CallFunc_GetBannerColorSecondaryColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BannerEditorTile_C_ExecuteUbergraph_BP_BannerEditorTile, CallFunc_GetBannerColorPrimaryColor_ReturnValue) == 0x0000BC, "Member 'BP_BannerEditorTile_C_ExecuteUbergraph_BP_BannerEditorTile::CallFunc_GetBannerColorPrimaryColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BannerEditorTile_C_ExecuteUbergraph_BP_BannerEditorTile, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000D0, "Member 'BP_BannerEditorTile_C_ExecuteUbergraph_BP_BannerEditorTile::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BannerEditorTile_C_ExecuteUbergraph_BP_BannerEditorTile, CallFunc_IsValid_ReturnValue) == 0x0000D8, "Member 'BP_BannerEditorTile_C_ExecuteUbergraph_BP_BannerEditorTile::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BannerEditorTile_C_ExecuteUbergraph_BP_BannerEditorTile, K2Node_Event_ListItemObject) == 0x0000E0, "Member 'BP_BannerEditorTile_C_ExecuteUbergraph_BP_BannerEditorTile::K2Node_Event_ListItemObject' has a wrong offset!");

// Function BP_BannerEditorTile.BP_BannerEditorTile_C.HandleBannerIconLoadGuardFinished
// 0x0008 (0x0008 - 0x0000)
struct BP_BannerEditorTile_C_HandleBannerIconLoadGuardFinished final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BannerEditorTile_C_HandleBannerIconLoadGuardFinished) == 0x000008, "Wrong alignment on BP_BannerEditorTile_C_HandleBannerIconLoadGuardFinished");
static_assert(sizeof(BP_BannerEditorTile_C_HandleBannerIconLoadGuardFinished) == 0x000008, "Wrong size on BP_BannerEditorTile_C_HandleBannerIconLoadGuardFinished");
static_assert(offsetof(BP_BannerEditorTile_C_HandleBannerIconLoadGuardFinished, Object) == 0x000000, "Member 'BP_BannerEditorTile_C_HandleBannerIconLoadGuardFinished::Object' has a wrong offset!");

// Function BP_BannerEditorTile.BP_BannerEditorTile_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct BP_BannerEditorTile_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BannerEditorTile_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on BP_BannerEditorTile_C_OnListItemObjectSet");
static_assert(sizeof(BP_BannerEditorTile_C_OnListItemObjectSet) == 0x000008, "Wrong size on BP_BannerEditorTile_C_OnListItemObjectSet");
static_assert(offsetof(BP_BannerEditorTile_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'BP_BannerEditorTile_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function BP_BannerEditorTile.BP_BannerEditorTile_C.Update Bang State
// 0x0018 (0x0018 - 0x0000)
struct BP_BannerEditorTile_C_Update_Bang_State final
{
public:
	class UObject*                                CallFunc_GetListItemObject_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAccountItem*                       K2Node_DynamicCast_AsFort_Account_Item;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasBeenSeenLocally_ReturnValue;           // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BannerEditorTile_C_Update_Bang_State) == 0x000008, "Wrong alignment on BP_BannerEditorTile_C_Update_Bang_State");
static_assert(sizeof(BP_BannerEditorTile_C_Update_Bang_State) == 0x000018, "Wrong size on BP_BannerEditorTile_C_Update_Bang_State");
static_assert(offsetof(BP_BannerEditorTile_C_Update_Bang_State, CallFunc_GetListItemObject_ReturnValue) == 0x000000, "Member 'BP_BannerEditorTile_C_Update_Bang_State::CallFunc_GetListItemObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BannerEditorTile_C_Update_Bang_State, K2Node_DynamicCast_AsFort_Account_Item) == 0x000008, "Member 'BP_BannerEditorTile_C_Update_Bang_State::K2Node_DynamicCast_AsFort_Account_Item' has a wrong offset!");
static_assert(offsetof(BP_BannerEditorTile_C_Update_Bang_State, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_BannerEditorTile_C_Update_Bang_State::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BannerEditorTile_C_Update_Bang_State, CallFunc_HasBeenSeenLocally_ReturnValue) == 0x000011, "Member 'BP_BannerEditorTile_C_Update_Bang_State::CallFunc_HasBeenSeenLocally_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BannerEditorTile_C_Update_Bang_State, CallFunc_Not_PreBool_ReturnValue) == 0x000012, "Member 'BP_BannerEditorTile_C_Update_Bang_State::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_BannerEditorTile.BP_BannerEditorTile_C.Mark Item As Seen
// 0x0020 (0x0020 - 0x0000)
struct BP_BannerEditorTile_C_Mark_Item_As_Seen final
{
public:
	bool                                          bAlreadySeen;                                      // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetListItemObject_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAccountItem*                       K2Node_DynamicCast_AsFort_Account_Item;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasBeenSeenLocally_ReturnValue;           // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BannerEditorTile_C_Mark_Item_As_Seen) == 0x000008, "Wrong alignment on BP_BannerEditorTile_C_Mark_Item_As_Seen");
static_assert(sizeof(BP_BannerEditorTile_C_Mark_Item_As_Seen) == 0x000020, "Wrong size on BP_BannerEditorTile_C_Mark_Item_As_Seen");
static_assert(offsetof(BP_BannerEditorTile_C_Mark_Item_As_Seen, bAlreadySeen) == 0x000000, "Member 'BP_BannerEditorTile_C_Mark_Item_As_Seen::bAlreadySeen' has a wrong offset!");
static_assert(offsetof(BP_BannerEditorTile_C_Mark_Item_As_Seen, CallFunc_GetListItemObject_ReturnValue) == 0x000008, "Member 'BP_BannerEditorTile_C_Mark_Item_As_Seen::CallFunc_GetListItemObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BannerEditorTile_C_Mark_Item_As_Seen, K2Node_DynamicCast_AsFort_Account_Item) == 0x000010, "Member 'BP_BannerEditorTile_C_Mark_Item_As_Seen::K2Node_DynamicCast_AsFort_Account_Item' has a wrong offset!");
static_assert(offsetof(BP_BannerEditorTile_C_Mark_Item_As_Seen, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_BannerEditorTile_C_Mark_Item_As_Seen::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BannerEditorTile_C_Mark_Item_As_Seen, CallFunc_HasBeenSeenLocally_ReturnValue) == 0x000019, "Member 'BP_BannerEditorTile_C_Mark_Item_As_Seen::CallFunc_HasBeenSeenLocally_ReturnValue' has a wrong offset!");

}

