#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HoverDronePawn

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_HoverDronePawn.BP_HoverDronePawn_C
// 0x0050 (0x03D8 - 0x0388)
class ABP_HoverDronePawn_C final : public AHoverDronePawn
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0388(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          WindAudioEnabled;                                  // 0x0390(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_391[0x7];                                      // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        AltitudeWindAudioComp;                             // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WindAudioAltMin;                                   // 0x03A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WindAudioAltMax;                                   // 0x03A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WindAudioVolMin;                                   // 0x03A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WindAudioVolMax;                                   // 0x03AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SoundWindMovementLoop;                             // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SoundWindAltitudeLoop;                             // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentAltitudeWindVolume;                         // 0x03C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Speed;                                             // 0x03C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        MovementWindAudioComp;                             // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentMovementWindVolume;                         // 0x03D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_HoverDronePawn(int32 EntryPoint);
	void Update_Wind_Audio();
	void ReceiveUnpossessed(class AController* OldController);
	void ReceivePossessed(class AController* NewController);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void SetWindAudioEnabled(bool Enabled);
	void GetWindVolumeFromAltitude(float Altitude, float* Volume);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_HoverDronePawn_C">();
	}
	static class ABP_HoverDronePawn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_HoverDronePawn_C>();
	}
};
static_assert(alignof(ABP_HoverDronePawn_C) == 0x000008, "Wrong alignment on ABP_HoverDronePawn_C");
static_assert(sizeof(ABP_HoverDronePawn_C) == 0x0003D8, "Wrong size on ABP_HoverDronePawn_C");
static_assert(offsetof(ABP_HoverDronePawn_C, UberGraphFrame) == 0x000388, "Member 'ABP_HoverDronePawn_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_HoverDronePawn_C, WindAudioEnabled) == 0x000390, "Member 'ABP_HoverDronePawn_C::WindAudioEnabled' has a wrong offset!");
static_assert(offsetof(ABP_HoverDronePawn_C, AltitudeWindAudioComp) == 0x000398, "Member 'ABP_HoverDronePawn_C::AltitudeWindAudioComp' has a wrong offset!");
static_assert(offsetof(ABP_HoverDronePawn_C, WindAudioAltMin) == 0x0003A0, "Member 'ABP_HoverDronePawn_C::WindAudioAltMin' has a wrong offset!");
static_assert(offsetof(ABP_HoverDronePawn_C, WindAudioAltMax) == 0x0003A4, "Member 'ABP_HoverDronePawn_C::WindAudioAltMax' has a wrong offset!");
static_assert(offsetof(ABP_HoverDronePawn_C, WindAudioVolMin) == 0x0003A8, "Member 'ABP_HoverDronePawn_C::WindAudioVolMin' has a wrong offset!");
static_assert(offsetof(ABP_HoverDronePawn_C, WindAudioVolMax) == 0x0003AC, "Member 'ABP_HoverDronePawn_C::WindAudioVolMax' has a wrong offset!");
static_assert(offsetof(ABP_HoverDronePawn_C, SoundWindMovementLoop) == 0x0003B0, "Member 'ABP_HoverDronePawn_C::SoundWindMovementLoop' has a wrong offset!");
static_assert(offsetof(ABP_HoverDronePawn_C, SoundWindAltitudeLoop) == 0x0003B8, "Member 'ABP_HoverDronePawn_C::SoundWindAltitudeLoop' has a wrong offset!");
static_assert(offsetof(ABP_HoverDronePawn_C, CurrentAltitudeWindVolume) == 0x0003C0, "Member 'ABP_HoverDronePawn_C::CurrentAltitudeWindVolume' has a wrong offset!");
static_assert(offsetof(ABP_HoverDronePawn_C, Speed) == 0x0003C4, "Member 'ABP_HoverDronePawn_C::Speed' has a wrong offset!");
static_assert(offsetof(ABP_HoverDronePawn_C, MovementWindAudioComp) == 0x0003C8, "Member 'ABP_HoverDronePawn_C::MovementWindAudioComp' has a wrong offset!");
static_assert(offsetof(ABP_HoverDronePawn_C, CurrentMovementWindVolume) == 0x0003D0, "Member 'ABP_HoverDronePawn_C::CurrentMovementWindVolume' has a wrong offset!");

}

