#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ReplayPC_Athena

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ReplayPC_Athena.BP_ReplayPC_Athena_C
// 0x00A8 (0x3118 - 0x3070)
class ABP_ReplayPC_Athena_C final : public AFortReplaySpectatorAthena
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x3070(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TMap<float, class USoundMix*>                 PlaybackRateMap;                                   // 0x3078(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	float                                         CurrentPlayRate;                                   // 0x30C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFast;                                           // 0x30CC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30CD[0x3];                                     // 0x30CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        SpeedupLoop;                                       // 0x30D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        SlowdownLoop;                                      // 0x30D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsHudVisible;                                     // 0x30E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30E1[0x7];                                     // 0x30E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        ZoomOutLoop;                                       // 0x30E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        ZoomInLoop;                                        // 0x30F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSkydivingAudioEnabled;                          // 0x30F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsTargetParachuting;                              // 0x30F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsTargetSkydiving;                                // 0x30FA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30FB[0x5];                                     // 0x30FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        SkydivingAudioLoop;                                // 0x3100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPaused;                                         // 0x3108(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3109[0x7];                                     // 0x3109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             CurrentSkydivingSound;                             // 0x3110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ReplayPC_Athena(int32 EntryPoint);
	void Looping_Audio_Update();
	void Handle_Parachute_Audio_State();
	void On_Pause_State_Changed(bool bPaused);
	void OnZoomInBegin();
	void OnZoomInEnd();
	void OnZoomOutBegin();
	void OnZoomOutEnd();
	void OnReplayHudVisibilityChanged(const EHudVisibilityState IsVisible);
	void _Speedup_Loops(float Playback_Multiplier);
	void OnNotifyNewPlaybackMultiplier(float NewMultiplier);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	class USoundBase* GetSkydivingSound();
	void SetSkydivingAudioEnabled(bool Enabled);
	void IsGameplayCamera(bool* Param_IsGameplayCamera);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ReplayPC_Athena_C">();
	}
	static class ABP_ReplayPC_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ReplayPC_Athena_C>();
	}
};
static_assert(alignof(ABP_ReplayPC_Athena_C) == 0x000008, "Wrong alignment on ABP_ReplayPC_Athena_C");
static_assert(sizeof(ABP_ReplayPC_Athena_C) == 0x003118, "Wrong size on ABP_ReplayPC_Athena_C");
static_assert(offsetof(ABP_ReplayPC_Athena_C, UberGraphFrame) == 0x003070, "Member 'ABP_ReplayPC_Athena_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, PlaybackRateMap) == 0x003078, "Member 'ABP_ReplayPC_Athena_C::PlaybackRateMap' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, CurrentPlayRate) == 0x0030C8, "Member 'ABP_ReplayPC_Athena_C::CurrentPlayRate' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, bIsFast) == 0x0030CC, "Member 'ABP_ReplayPC_Athena_C::bIsFast' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, SpeedupLoop) == 0x0030D0, "Member 'ABP_ReplayPC_Athena_C::SpeedupLoop' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, SlowdownLoop) == 0x0030D8, "Member 'ABP_ReplayPC_Athena_C::SlowdownLoop' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, bIsHudVisible) == 0x0030E0, "Member 'ABP_ReplayPC_Athena_C::bIsHudVisible' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, ZoomOutLoop) == 0x0030E8, "Member 'ABP_ReplayPC_Athena_C::ZoomOutLoop' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, ZoomInLoop) == 0x0030F0, "Member 'ABP_ReplayPC_Athena_C::ZoomInLoop' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, bIsSkydivingAudioEnabled) == 0x0030F8, "Member 'ABP_ReplayPC_Athena_C::bIsSkydivingAudioEnabled' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, bIsTargetParachuting) == 0x0030F9, "Member 'ABP_ReplayPC_Athena_C::bIsTargetParachuting' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, bIsTargetSkydiving) == 0x0030FA, "Member 'ABP_ReplayPC_Athena_C::bIsTargetSkydiving' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, SkydivingAudioLoop) == 0x003100, "Member 'ABP_ReplayPC_Athena_C::SkydivingAudioLoop' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, bIsPaused) == 0x003108, "Member 'ABP_ReplayPC_Athena_C::bIsPaused' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, CurrentSkydivingSound) == 0x003110, "Member 'ABP_ReplayPC_Athena_C::CurrentSkydivingSound' has a wrong offset!");

}

