#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SpectatorPC

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_SpectatorPC.BP_SpectatorPC_C.ExecuteUbergraph_BP_SpectatorPC
// 0x0050 (0x0050 - 0x0000)
struct BP_SpectatorPC_C_ExecuteUbergraph_BP_SpectatorPC final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalPlayerController_ReturnValue;      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0xB];                                        // 0x0005(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class UBP_AmbientAudioController_C*           CallFunc_AddComponent_ReturnValue;                 // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpectatorPC_C_ExecuteUbergraph_BP_SpectatorPC) == 0x000010, "Wrong alignment on BP_SpectatorPC_C_ExecuteUbergraph_BP_SpectatorPC");
static_assert(sizeof(BP_SpectatorPC_C_ExecuteUbergraph_BP_SpectatorPC) == 0x000050, "Wrong size on BP_SpectatorPC_C_ExecuteUbergraph_BP_SpectatorPC");
static_assert(offsetof(BP_SpectatorPC_C_ExecuteUbergraph_BP_SpectatorPC, EntryPoint) == 0x000000, "Member 'BP_SpectatorPC_C_ExecuteUbergraph_BP_SpectatorPC::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SpectatorPC_C_ExecuteUbergraph_BP_SpectatorPC, CallFunc_IsLocalPlayerController_ReturnValue) == 0x000004, "Member 'BP_SpectatorPC_C_ExecuteUbergraph_BP_SpectatorPC::CallFunc_IsLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpectatorPC_C_ExecuteUbergraph_BP_SpectatorPC, Temp_struct_Variable) == 0x000010, "Member 'BP_SpectatorPC_C_ExecuteUbergraph_BP_SpectatorPC::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_SpectatorPC_C_ExecuteUbergraph_BP_SpectatorPC, CallFunc_AddComponent_ReturnValue) == 0x000040, "Member 'BP_SpectatorPC_C_ExecuteUbergraph_BP_SpectatorPC::CallFunc_AddComponent_ReturnValue' has a wrong offset!");

}

