#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ClothingSystemRuntime

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "ClothingSystemRuntime_structs.hpp"
#include "ClothingSystemRuntimeInterface_classes.hpp"


namespace SDK
{

// Class ClothingSystemRuntime.ClothingAssetCustomData
// 0x0000 (0x0028 - 0x0028)
class UClothingAssetCustomData final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ClothingAssetCustomData">();
	}
	static class UClothingAssetCustomData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClothingAssetCustomData>();
	}
};
static_assert(alignof(UClothingAssetCustomData) == 0x000008, "Wrong alignment on UClothingAssetCustomData");
static_assert(sizeof(UClothingAssetCustomData) == 0x000028, "Wrong size on UClothingAssetCustomData");

// Class ClothingSystemRuntime.ClothingAsset
// 0x0130 (0x0178 - 0x0048)
class UClothingAsset final : public UClothingAssetBase
{
public:
	class UPhysicsAsset*                          PhysicsAsset;                                      // 0x0048(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FClothConfig                           ClothConfig;                                       // 0x0050(0x00D4)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FClothLODData>                  LODData;                                           // 0x0128(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 LodMap;                                            // 0x0138(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           UsedBoneNames;                                     // 0x0148(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 UsedBoneIndices;                                   // 0x0158(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         ReferenceBoneIndex;                                // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClothingAssetCustomData*               CustomData;                                        // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ClothingAsset">();
	}
	static class UClothingAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClothingAsset>();
	}
};
static_assert(alignof(UClothingAsset) == 0x000008, "Wrong alignment on UClothingAsset");
static_assert(sizeof(UClothingAsset) == 0x000178, "Wrong size on UClothingAsset");
static_assert(offsetof(UClothingAsset, PhysicsAsset) == 0x000048, "Member 'UClothingAsset::PhysicsAsset' has a wrong offset!");
static_assert(offsetof(UClothingAsset, ClothConfig) == 0x000050, "Member 'UClothingAsset::ClothConfig' has a wrong offset!");
static_assert(offsetof(UClothingAsset, LODData) == 0x000128, "Member 'UClothingAsset::LODData' has a wrong offset!");
static_assert(offsetof(UClothingAsset, LodMap) == 0x000138, "Member 'UClothingAsset::LodMap' has a wrong offset!");
static_assert(offsetof(UClothingAsset, UsedBoneNames) == 0x000148, "Member 'UClothingAsset::UsedBoneNames' has a wrong offset!");
static_assert(offsetof(UClothingAsset, UsedBoneIndices) == 0x000158, "Member 'UClothingAsset::UsedBoneIndices' has a wrong offset!");
static_assert(offsetof(UClothingAsset, ReferenceBoneIndex) == 0x000168, "Member 'UClothingAsset::ReferenceBoneIndex' has a wrong offset!");
static_assert(offsetof(UClothingAsset, CustomData) == 0x000170, "Member 'UClothingAsset::CustomData' has a wrong offset!");

// Class ClothingSystemRuntime.ClothingSimulationFactoryNv
// 0x0000 (0x0028 - 0x0028)
class UClothingSimulationFactoryNv final : public UClothingSimulationFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ClothingSimulationFactoryNv">();
	}
	static class UClothingSimulationFactoryNv* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClothingSimulationFactoryNv>();
	}
};
static_assert(alignof(UClothingSimulationFactoryNv) == 0x000008, "Wrong alignment on UClothingSimulationFactoryNv");
static_assert(sizeof(UClothingSimulationFactoryNv) == 0x000028, "Wrong size on UClothingSimulationFactoryNv");

// Class ClothingSystemRuntime.ClothingSimulationInteractorNv
// 0x0010 (0x0040 - 0x0030)
class UClothingSimulationInteractorNv final : public UClothingSimulationInteractor
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DisableGravityOverride();
	void EnableGravityOverride(const struct FVector& InVector);
	void SetAnimDriveDamperStiffness(float InStiffness);
	void SetAnimDriveSpringStiffness(float InStiffness);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ClothingSimulationInteractorNv">();
	}
	static class UClothingSimulationInteractorNv* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClothingSimulationInteractorNv>();
	}
};
static_assert(alignof(UClothingSimulationInteractorNv) == 0x000008, "Wrong alignment on UClothingSimulationInteractorNv");
static_assert(sizeof(UClothingSimulationInteractorNv) == 0x000040, "Wrong size on UClothingSimulationInteractorNv");

}

