#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommonInput

#include "Basic.hpp"

#include "CommonInput_structs.hpp"


namespace SDK::Params
{

// DelegateFunction CommonInput.CommonInputSubsystem.InputMethodChangedDelegate__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct CommonInputSubsystem_InputMethodChangedDelegate__DelegateSignature final
{
public:
	ECommonInputType                              bNewInputType;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonInputSubsystem_InputMethodChangedDelegate__DelegateSignature) == 0x000001, "Wrong alignment on CommonInputSubsystem_InputMethodChangedDelegate__DelegateSignature");
static_assert(sizeof(CommonInputSubsystem_InputMethodChangedDelegate__DelegateSignature) == 0x000001, "Wrong size on CommonInputSubsystem_InputMethodChangedDelegate__DelegateSignature");
static_assert(offsetof(CommonInputSubsystem_InputMethodChangedDelegate__DelegateSignature, bNewInputType) == 0x000000, "Member 'CommonInputSubsystem_InputMethodChangedDelegate__DelegateSignature::bNewInputType' has a wrong offset!");

// Function CommonInput.CommonInputSubsystem.SetCurrentInputType
// 0x0001 (0x0001 - 0x0000)
struct CommonInputSubsystem_SetCurrentInputType final
{
public:
	ECommonInputType                              NewInputType;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonInputSubsystem_SetCurrentInputType) == 0x000001, "Wrong alignment on CommonInputSubsystem_SetCurrentInputType");
static_assert(sizeof(CommonInputSubsystem_SetCurrentInputType) == 0x000001, "Wrong size on CommonInputSubsystem_SetCurrentInputType");
static_assert(offsetof(CommonInputSubsystem_SetCurrentInputType, NewInputType) == 0x000000, "Member 'CommonInputSubsystem_SetCurrentInputType::NewInputType' has a wrong offset!");

// Function CommonInput.CommonInputSubsystem.SetGamepadInputType
// 0x0001 (0x0001 - 0x0000)
struct CommonInputSubsystem_SetGamepadInputType final
{
public:
	ECommonGamepadType                            InGamepadInputType;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonInputSubsystem_SetGamepadInputType) == 0x000001, "Wrong alignment on CommonInputSubsystem_SetGamepadInputType");
static_assert(sizeof(CommonInputSubsystem_SetGamepadInputType) == 0x000001, "Wrong size on CommonInputSubsystem_SetGamepadInputType");
static_assert(offsetof(CommonInputSubsystem_SetGamepadInputType, InGamepadInputType) == 0x000000, "Member 'CommonInputSubsystem_SetGamepadInputType::InGamepadInputType' has a wrong offset!");

// Function CommonInput.CommonInputSubsystem.GetCurrentGamepadType
// 0x0001 (0x0001 - 0x0000)
struct CommonInputSubsystem_GetCurrentGamepadType final
{
public:
	ECommonGamepadType                            ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonInputSubsystem_GetCurrentGamepadType) == 0x000001, "Wrong alignment on CommonInputSubsystem_GetCurrentGamepadType");
static_assert(sizeof(CommonInputSubsystem_GetCurrentGamepadType) == 0x000001, "Wrong size on CommonInputSubsystem_GetCurrentGamepadType");
static_assert(offsetof(CommonInputSubsystem_GetCurrentGamepadType, ReturnValue) == 0x000000, "Member 'CommonInputSubsystem_GetCurrentGamepadType::ReturnValue' has a wrong offset!");

// Function CommonInput.CommonInputSubsystem.GetCurrentInputType
// 0x0001 (0x0001 - 0x0000)
struct CommonInputSubsystem_GetCurrentInputType final
{
public:
	ECommonInputType                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonInputSubsystem_GetCurrentInputType) == 0x000001, "Wrong alignment on CommonInputSubsystem_GetCurrentInputType");
static_assert(sizeof(CommonInputSubsystem_GetCurrentInputType) == 0x000001, "Wrong size on CommonInputSubsystem_GetCurrentInputType");
static_assert(offsetof(CommonInputSubsystem_GetCurrentInputType, ReturnValue) == 0x000000, "Member 'CommonInputSubsystem_GetCurrentInputType::ReturnValue' has a wrong offset!");

// Function CommonInput.CommonInputSubsystem.GetDefaultInputType
// 0x0001 (0x0001 - 0x0000)
struct CommonInputSubsystem_GetDefaultInputType final
{
public:
	ECommonInputType                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonInputSubsystem_GetDefaultInputType) == 0x000001, "Wrong alignment on CommonInputSubsystem_GetDefaultInputType");
static_assert(sizeof(CommonInputSubsystem_GetDefaultInputType) == 0x000001, "Wrong size on CommonInputSubsystem_GetDefaultInputType");
static_assert(offsetof(CommonInputSubsystem_GetDefaultInputType, ReturnValue) == 0x000000, "Member 'CommonInputSubsystem_GetDefaultInputType::ReturnValue' has a wrong offset!");

// Function CommonInput.CommonInputSubsystem.IsUsingPointerInput
// 0x0001 (0x0001 - 0x0000)
struct CommonInputSubsystem_IsUsingPointerInput final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonInputSubsystem_IsUsingPointerInput) == 0x000001, "Wrong alignment on CommonInputSubsystem_IsUsingPointerInput");
static_assert(sizeof(CommonInputSubsystem_IsUsingPointerInput) == 0x000001, "Wrong size on CommonInputSubsystem_IsUsingPointerInput");
static_assert(offsetof(CommonInputSubsystem_IsUsingPointerInput, ReturnValue) == 0x000000, "Member 'CommonInputSubsystem_IsUsingPointerInput::ReturnValue' has a wrong offset!");

// Function CommonInput.CommonInputSubsystem.ShouldShowInputKeys
// 0x0001 (0x0001 - 0x0000)
struct CommonInputSubsystem_ShouldShowInputKeys final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonInputSubsystem_ShouldShowInputKeys) == 0x000001, "Wrong alignment on CommonInputSubsystem_ShouldShowInputKeys");
static_assert(sizeof(CommonInputSubsystem_ShouldShowInputKeys) == 0x000001, "Wrong size on CommonInputSubsystem_ShouldShowInputKeys");
static_assert(offsetof(CommonInputSubsystem_ShouldShowInputKeys, ReturnValue) == 0x000000, "Member 'CommonInputSubsystem_ShouldShowInputKeys::ReturnValue' has a wrong offset!");

}

