#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommonUI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CommonInput_structs.hpp"
#include "CommonUI_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function CommonUI.CommonBorder.SetStyle
// 0x0008 (0x0008 - 0x0000)
struct CommonBorder_SetStyle final
{
public:
	TSubclassOf<class UCommonBorderStyle>         InStyle;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonBorder_SetStyle) == 0x000008, "Wrong alignment on CommonBorder_SetStyle");
static_assert(sizeof(CommonBorder_SetStyle) == 0x000008, "Wrong size on CommonBorder_SetStyle");
static_assert(offsetof(CommonBorder_SetStyle, InStyle) == 0x000000, "Member 'CommonBorder_SetStyle::InStyle' has a wrong offset!");

// DelegateFunction CommonUI.CommonActionWidget.OnInputMethodChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct CommonActionWidget_OnInputMethodChanged__DelegateSignature final
{
public:
	bool                                          bUsingGamepad;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonActionWidget_OnInputMethodChanged__DelegateSignature) == 0x000001, "Wrong alignment on CommonActionWidget_OnInputMethodChanged__DelegateSignature");
static_assert(sizeof(CommonActionWidget_OnInputMethodChanged__DelegateSignature) == 0x000001, "Wrong size on CommonActionWidget_OnInputMethodChanged__DelegateSignature");
static_assert(offsetof(CommonActionWidget_OnInputMethodChanged__DelegateSignature, bUsingGamepad) == 0x000000, "Member 'CommonActionWidget_OnInputMethodChanged__DelegateSignature::bUsingGamepad' has a wrong offset!");

// Function CommonUI.CommonActionWidget.SetIconRimBrush
// 0x0088 (0x0088 - 0x0000)
struct CommonActionWidget_SetIconRimBrush final
{
public:
	struct FSlateBrush                            InIconRimBrush;                                    // 0x0000(0x0088)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonActionWidget_SetIconRimBrush) == 0x000008, "Wrong alignment on CommonActionWidget_SetIconRimBrush");
static_assert(sizeof(CommonActionWidget_SetIconRimBrush) == 0x000088, "Wrong size on CommonActionWidget_SetIconRimBrush");
static_assert(offsetof(CommonActionWidget_SetIconRimBrush, InIconRimBrush) == 0x000000, "Member 'CommonActionWidget_SetIconRimBrush::InIconRimBrush' has a wrong offset!");

// Function CommonUI.CommonActionWidget.SetInputAction
// 0x0010 (0x0010 - 0x0000)
struct CommonActionWidget_SetInputAction final
{
public:
	struct FDataTableRowHandle                    InputActionRow;                                    // 0x0000(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonActionWidget_SetInputAction) == 0x000008, "Wrong alignment on CommonActionWidget_SetInputAction");
static_assert(sizeof(CommonActionWidget_SetInputAction) == 0x000010, "Wrong size on CommonActionWidget_SetInputAction");
static_assert(offsetof(CommonActionWidget_SetInputAction, InputActionRow) == 0x000000, "Member 'CommonActionWidget_SetInputAction::InputActionRow' has a wrong offset!");

// Function CommonUI.CommonActionWidget.GetDisplayText
// 0x0018 (0x0018 - 0x0000)
struct CommonActionWidget_GetDisplayText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonActionWidget_GetDisplayText) == 0x000008, "Wrong alignment on CommonActionWidget_GetDisplayText");
static_assert(sizeof(CommonActionWidget_GetDisplayText) == 0x000018, "Wrong size on CommonActionWidget_GetDisplayText");
static_assert(offsetof(CommonActionWidget_GetDisplayText, ReturnValue) == 0x000000, "Member 'CommonActionWidget_GetDisplayText::ReturnValue' has a wrong offset!");

// Function CommonUI.CommonActionWidget.GetIcon
// 0x0088 (0x0088 - 0x0000)
struct CommonActionWidget_GetIcon final
{
public:
	struct FSlateBrush                            ReturnValue;                                       // 0x0000(0x0088)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonActionWidget_GetIcon) == 0x000008, "Wrong alignment on CommonActionWidget_GetIcon");
static_assert(sizeof(CommonActionWidget_GetIcon) == 0x000088, "Wrong size on CommonActionWidget_GetIcon");
static_assert(offsetof(CommonActionWidget_GetIcon, ReturnValue) == 0x000000, "Member 'CommonActionWidget_GetIcon::ReturnValue' has a wrong offset!");

// Function CommonUI.CommonActionWidget.IsHeldAction
// 0x0001 (0x0001 - 0x0000)
struct CommonActionWidget_IsHeldAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonActionWidget_IsHeldAction) == 0x000001, "Wrong alignment on CommonActionWidget_IsHeldAction");
static_assert(sizeof(CommonActionWidget_IsHeldAction) == 0x000001, "Wrong size on CommonActionWidget_IsHeldAction");
static_assert(offsetof(CommonActionWidget_IsHeldAction, ReturnValue) == 0x000000, "Member 'CommonActionWidget_IsHeldAction::ReturnValue' has a wrong offset!");

// Function CommonUI.CommonUserWidget.OnTouchLeave
// 0x0070 (0x0070 - 0x0000)
struct CommonUserWidget_OnTouchLeave final
{
public:
	struct FPointerEvent                          TouchEvent;                                        // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonUserWidget_OnTouchLeave) == 0x000008, "Wrong alignment on CommonUserWidget_OnTouchLeave");
static_assert(sizeof(CommonUserWidget_OnTouchLeave) == 0x000070, "Wrong size on CommonUserWidget_OnTouchLeave");
static_assert(offsetof(CommonUserWidget_OnTouchLeave, TouchEvent) == 0x000000, "Member 'CommonUserWidget_OnTouchLeave::TouchEvent' has a wrong offset!");

// Function CommonUI.CommonUserWidget.SetConsumePointerInput
// 0x0001 (0x0001 - 0x0000)
struct CommonUserWidget_SetConsumePointerInput final
{
public:
	bool                                          bInConsumePointerInput;                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonUserWidget_SetConsumePointerInput) == 0x000001, "Wrong alignment on CommonUserWidget_SetConsumePointerInput");
static_assert(sizeof(CommonUserWidget_SetConsumePointerInput) == 0x000001, "Wrong size on CommonUserWidget_SetConsumePointerInput");
static_assert(offsetof(CommonUserWidget_SetConsumePointerInput, bInConsumePointerInput) == 0x000000, "Member 'CommonUserWidget_SetConsumePointerInput::bInConsumePointerInput' has a wrong offset!");

// Function CommonUI.CommonActivatablePanel.AddInputActionHandler
// 0x0020 (0x0020 - 0x0000)
struct CommonActivatablePanel_AddInputActionHandler final
{
public:
	class UDataTable*                             DataTable;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   RowName;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(bool* bPassThrough)>           CommitedEvent;                                     // 0x0010(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonActivatablePanel_AddInputActionHandler) == 0x000008, "Wrong alignment on CommonActivatablePanel_AddInputActionHandler");
static_assert(sizeof(CommonActivatablePanel_AddInputActionHandler) == 0x000020, "Wrong size on CommonActivatablePanel_AddInputActionHandler");
static_assert(offsetof(CommonActivatablePanel_AddInputActionHandler, DataTable) == 0x000000, "Member 'CommonActivatablePanel_AddInputActionHandler::DataTable' has a wrong offset!");
static_assert(offsetof(CommonActivatablePanel_AddInputActionHandler, RowName) == 0x000008, "Member 'CommonActivatablePanel_AddInputActionHandler::RowName' has a wrong offset!");
static_assert(offsetof(CommonActivatablePanel_AddInputActionHandler, CommitedEvent) == 0x000010, "Member 'CommonActivatablePanel_AddInputActionHandler::CommitedEvent' has a wrong offset!");

// Function CommonUI.CommonActivatablePanel.AddInputActionHandlerWithPopup
// 0x0028 (0x0028 - 0x0000)
struct CommonActivatablePanel_AddInputActionHandlerWithPopup final
{
public:
	class UDataTable*                             DataTable;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   RowName;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(bool* bPassThrough)>           CommitedEvent;                                     // 0x0010(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UCommonPopupMenu*                       PopupMenu;                                         // 0x0020(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonActivatablePanel_AddInputActionHandlerWithPopup) == 0x000008, "Wrong alignment on CommonActivatablePanel_AddInputActionHandlerWithPopup");
static_assert(sizeof(CommonActivatablePanel_AddInputActionHandlerWithPopup) == 0x000028, "Wrong size on CommonActivatablePanel_AddInputActionHandlerWithPopup");
static_assert(offsetof(CommonActivatablePanel_AddInputActionHandlerWithPopup, DataTable) == 0x000000, "Member 'CommonActivatablePanel_AddInputActionHandlerWithPopup::DataTable' has a wrong offset!");
static_assert(offsetof(CommonActivatablePanel_AddInputActionHandlerWithPopup, RowName) == 0x000008, "Member 'CommonActivatablePanel_AddInputActionHandlerWithPopup::RowName' has a wrong offset!");
static_assert(offsetof(CommonActivatablePanel_AddInputActionHandlerWithPopup, CommitedEvent) == 0x000010, "Member 'CommonActivatablePanel_AddInputActionHandlerWithPopup::CommitedEvent' has a wrong offset!");
static_assert(offsetof(CommonActivatablePanel_AddInputActionHandlerWithPopup, PopupMenu) == 0x000020, "Member 'CommonActivatablePanel_AddInputActionHandlerWithPopup::PopupMenu' has a wrong offset!");

// Function CommonUI.CommonActivatablePanel.AddInputActionHandlerWithProgress
// 0x0030 (0x0030 - 0x0000)
struct CommonActivatablePanel_AddInputActionHandlerWithProgress final
{
public:
	class UDataTable*                             DataTable;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   RowName;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(bool* bPassThrough)>           CommitedEvent;                                     // 0x0010(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(float HeldPercent)>            ProgressEvent;                                     // 0x0020(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonActivatablePanel_AddInputActionHandlerWithProgress) == 0x000008, "Wrong alignment on CommonActivatablePanel_AddInputActionHandlerWithProgress");
static_assert(sizeof(CommonActivatablePanel_AddInputActionHandlerWithProgress) == 0x000030, "Wrong size on CommonActivatablePanel_AddInputActionHandlerWithProgress");
static_assert(offsetof(CommonActivatablePanel_AddInputActionHandlerWithProgress, DataTable) == 0x000000, "Member 'CommonActivatablePanel_AddInputActionHandlerWithProgress::DataTable' has a wrong offset!");
static_assert(offsetof(CommonActivatablePanel_AddInputActionHandlerWithProgress, RowName) == 0x000008, "Member 'CommonActivatablePanel_AddInputActionHandlerWithProgress::RowName' has a wrong offset!");
static_assert(offsetof(CommonActivatablePanel_AddInputActionHandlerWithProgress, CommitedEvent) == 0x000010, "Member 'CommonActivatablePanel_AddInputActionHandlerWithProgress::CommitedEvent' has a wrong offset!");
static_assert(offsetof(CommonActivatablePanel_AddInputActionHandlerWithProgress, ProgressEvent) == 0x000020, "Member 'CommonActivatablePanel_AddInputActionHandlerWithProgress::ProgressEvent' has a wrong offset!");

// Function CommonUI.CommonActivatablePanel.AddInputActionHandlerWithProgressPopup
// 0x0038 (0x0038 - 0x0000)
struct CommonActivatablePanel_AddInputActionHandlerWithProgressPopup final
{
public:
	class UDataTable*                             DataTable;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   RowName;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(bool* bPassThrough)>           CommitedEvent;                                     // 0x0010(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(float HeldPercent)>            ProgressEvent;                                     // 0x0020(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UCommonPopupMenu*                       PopupMenu;                                         // 0x0030(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonActivatablePanel_AddInputActionHandlerWithProgressPopup) == 0x000008, "Wrong alignment on CommonActivatablePanel_AddInputActionHandlerWithProgressPopup");
static_assert(sizeof(CommonActivatablePanel_AddInputActionHandlerWithProgressPopup) == 0x000038, "Wrong size on CommonActivatablePanel_AddInputActionHandlerWithProgressPopup");
static_assert(offsetof(CommonActivatablePanel_AddInputActionHandlerWithProgressPopup, DataTable) == 0x000000, "Member 'CommonActivatablePanel_AddInputActionHandlerWithProgressPopup::DataTable' has a wrong offset!");
static_assert(offsetof(CommonActivatablePanel_AddInputActionHandlerWithProgressPopup, RowName) == 0x000008, "Member 'CommonActivatablePanel_AddInputActionHandlerWithProgressPopup::RowName' has a wrong offset!");
static_assert(offsetof(CommonActivatablePanel_AddInputActionHandlerWithProgressPopup, CommitedEvent) == 0x000010, "Member 'CommonActivatablePanel_AddInputActionHandlerWithProgressPopup::CommitedEvent' has a wrong offset!");
static_assert(offsetof(CommonActivatablePanel_AddInputActionHandlerWithProgressPopup, ProgressEvent) == 0x000020, "Member 'CommonActivatablePanel_AddInputActionHandlerWithProgressPopup::ProgressEvent' has a wrong offset!");
static_assert(offsetof(CommonActivatablePanel_AddInputActionHandlerWithProgressPopup, PopupMenu) == 0x000030, "Member 'CommonActivatablePanel_AddInputActionHandlerWithProgressPopup::PopupMenu' has a wrong offset!");

// Function CommonUI.CommonActivatablePanel.AddInputActionNoHandler
// 0x0010 (0x0010 - 0x0000)
struct CommonActivatablePanel_AddInputActionNoHandler final
{
public:
	class UDataTable*                             DataTable;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   RowName;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonActivatablePanel_AddInputActionNoHandler) == 0x000008, "Wrong alignment on CommonActivatablePanel_AddInputActionNoHandler");
static_assert(sizeof(CommonActivatablePanel_AddInputActionNoHandler) == 0x000010, "Wrong size on CommonActivatablePanel_AddInputActionNoHandler");
static_assert(offsetof(CommonActivatablePanel_AddInputActionNoHandler, DataTable) == 0x000000, "Member 'CommonActivatablePanel_AddInputActionNoHandler::DataTable' has a wrong offset!");
static_assert(offsetof(CommonActivatablePanel_AddInputActionNoHandler, RowName) == 0x000008, "Member 'CommonActivatablePanel_AddInputActionNoHandler::RowName' has a wrong offset!");

// Function CommonUI.CommonActivatablePanel.OnInputModeChanged
// 0x0001 (0x0001 - 0x0000)
struct CommonActivatablePanel_OnInputModeChanged final
{
public:
	bool                                          bUsingGamepad;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonActivatablePanel_OnInputModeChanged) == 0x000001, "Wrong alignment on CommonActivatablePanel_OnInputModeChanged");
static_assert(sizeof(CommonActivatablePanel_OnInputModeChanged) == 0x000001, "Wrong size on CommonActivatablePanel_OnInputModeChanged");
static_assert(offsetof(CommonActivatablePanel_OnInputModeChanged, bUsingGamepad) == 0x000000, "Member 'CommonActivatablePanel_OnInputModeChanged::bUsingGamepad' has a wrong offset!");

// Function CommonUI.CommonActivatablePanel.RemoveInputActionHandler
// 0x0010 (0x0010 - 0x0000)
struct CommonActivatablePanel_RemoveInputActionHandler final
{
public:
	struct FDataTableRowHandle                    InputActionRow;                                    // 0x0000(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonActivatablePanel_RemoveInputActionHandler) == 0x000008, "Wrong alignment on CommonActivatablePanel_RemoveInputActionHandler");
static_assert(sizeof(CommonActivatablePanel_RemoveInputActionHandler) == 0x000010, "Wrong size on CommonActivatablePanel_RemoveInputActionHandler");
static_assert(offsetof(CommonActivatablePanel_RemoveInputActionHandler, InputActionRow) == 0x000000, "Member 'CommonActivatablePanel_RemoveInputActionHandler::InputActionRow' has a wrong offset!");

// Function CommonUI.CommonActivatablePanel.SetActionHandlerState
// 0x0018 (0x0018 - 0x0000)
struct CommonActivatablePanel_SetActionHandlerState final
{
public:
	const class UDataTable*                       DataTable;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   RowName;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputActionState                             State;                                             // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CommonActivatablePanel_SetActionHandlerState) == 0x000008, "Wrong alignment on CommonActivatablePanel_SetActionHandlerState");
static_assert(sizeof(CommonActivatablePanel_SetActionHandlerState) == 0x000018, "Wrong size on CommonActivatablePanel_SetActionHandlerState");
static_assert(offsetof(CommonActivatablePanel_SetActionHandlerState, DataTable) == 0x000000, "Member 'CommonActivatablePanel_SetActionHandlerState::DataTable' has a wrong offset!");
static_assert(offsetof(CommonActivatablePanel_SetActionHandlerState, RowName) == 0x000008, "Member 'CommonActivatablePanel_SetActionHandlerState::RowName' has a wrong offset!");
static_assert(offsetof(CommonActivatablePanel_SetActionHandlerState, State) == 0x000010, "Member 'CommonActivatablePanel_SetActionHandlerState::State' has a wrong offset!");

// Function CommonUI.CommonActivatablePanel.SetActionHandlerStateFromHandle
// 0x0018 (0x0018 - 0x0000)
struct CommonActivatablePanel_SetActionHandlerStateFromHandle final
{
public:
	struct FDataTableRowHandle                    InputActionRow;                                    // 0x0000(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	EInputActionState                             State;                                             // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CommonActivatablePanel_SetActionHandlerStateFromHandle) == 0x000008, "Wrong alignment on CommonActivatablePanel_SetActionHandlerStateFromHandle");
static_assert(sizeof(CommonActivatablePanel_SetActionHandlerStateFromHandle) == 0x000018, "Wrong size on CommonActivatablePanel_SetActionHandlerStateFromHandle");
static_assert(offsetof(CommonActivatablePanel_SetActionHandlerStateFromHandle, InputActionRow) == 0x000000, "Member 'CommonActivatablePanel_SetActionHandlerStateFromHandle::InputActionRow' has a wrong offset!");
static_assert(offsetof(CommonActivatablePanel_SetActionHandlerStateFromHandle, State) == 0x000010, "Member 'CommonActivatablePanel_SetActionHandlerStateFromHandle::State' has a wrong offset!");

// Function CommonUI.CommonActivatablePanel.SetActionHandlerStateFromHandleWithDisabledCommitEvent
// 0x0028 (0x0028 - 0x0000)
struct CommonActivatablePanel_SetActionHandlerStateFromHandleWithDisabledCommitEvent final
{
public:
	struct FDataTableRowHandle                    InputActionRow;                                    // 0x0000(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	EInputActionState                             State;                                             // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool* bPassThrough)>           DisabledCommitEvent;                               // 0x0014(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CommonActivatablePanel_SetActionHandlerStateFromHandleWithDisabledCommitEvent) == 0x000008, "Wrong alignment on CommonActivatablePanel_SetActionHandlerStateFromHandleWithDisabledCommitEvent");
static_assert(sizeof(CommonActivatablePanel_SetActionHandlerStateFromHandleWithDisabledCommitEvent) == 0x000028, "Wrong size on CommonActivatablePanel_SetActionHandlerStateFromHandleWithDisabledCommitEvent");
static_assert(offsetof(CommonActivatablePanel_SetActionHandlerStateFromHandleWithDisabledCommitEvent, InputActionRow) == 0x000000, "Member 'CommonActivatablePanel_SetActionHandlerStateFromHandleWithDisabledCommitEvent::InputActionRow' has a wrong offset!");
static_assert(offsetof(CommonActivatablePanel_SetActionHandlerStateFromHandleWithDisabledCommitEvent, State) == 0x000010, "Member 'CommonActivatablePanel_SetActionHandlerStateFromHandleWithDisabledCommitEvent::State' has a wrong offset!");
static_assert(offsetof(CommonActivatablePanel_SetActionHandlerStateFromHandleWithDisabledCommitEvent, DisabledCommitEvent) == 0x000014, "Member 'CommonActivatablePanel_SetActionHandlerStateFromHandleWithDisabledCommitEvent::DisabledCommitEvent' has a wrong offset!");

// Function CommonUI.CommonActivatablePanel.SetActionHandlerStateWithDisabledCommitEvent
// 0x0028 (0x0028 - 0x0000)
struct CommonActivatablePanel_SetActionHandlerStateWithDisabledCommitEvent final
{
public:
	class UDataTable*                             DataTable;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   RowName;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputActionState                             State;                                             // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool* bPassThrough)>           DisabledCommitEvent;                               // 0x0014(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CommonActivatablePanel_SetActionHandlerStateWithDisabledCommitEvent) == 0x000008, "Wrong alignment on CommonActivatablePanel_SetActionHandlerStateWithDisabledCommitEvent");
static_assert(sizeof(CommonActivatablePanel_SetActionHandlerStateWithDisabledCommitEvent) == 0x000028, "Wrong size on CommonActivatablePanel_SetActionHandlerStateWithDisabledCommitEvent");
static_assert(offsetof(CommonActivatablePanel_SetActionHandlerStateWithDisabledCommitEvent, DataTable) == 0x000000, "Member 'CommonActivatablePanel_SetActionHandlerStateWithDisabledCommitEvent::DataTable' has a wrong offset!");
static_assert(offsetof(CommonActivatablePanel_SetActionHandlerStateWithDisabledCommitEvent, RowName) == 0x000008, "Member 'CommonActivatablePanel_SetActionHandlerStateWithDisabledCommitEvent::RowName' has a wrong offset!");
static_assert(offsetof(CommonActivatablePanel_SetActionHandlerStateWithDisabledCommitEvent, State) == 0x000010, "Member 'CommonActivatablePanel_SetActionHandlerStateWithDisabledCommitEvent::State' has a wrong offset!");
static_assert(offsetof(CommonActivatablePanel_SetActionHandlerStateWithDisabledCommitEvent, DisabledCommitEvent) == 0x000014, "Member 'CommonActivatablePanel_SetActionHandlerStateWithDisabledCommitEvent::DisabledCommitEvent' has a wrong offset!");

// Function CommonUI.CommonActivatablePanel.SetInputActionHandler
// 0x0020 (0x0020 - 0x0000)
struct CommonActivatablePanel_SetInputActionHandler final
{
public:
	struct FDataTableRowHandle                    InputActionRow;                                    // 0x0000(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(bool* bPassThrough)>           CommitedEvent;                                     // 0x0010(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonActivatablePanel_SetInputActionHandler) == 0x000008, "Wrong alignment on CommonActivatablePanel_SetInputActionHandler");
static_assert(sizeof(CommonActivatablePanel_SetInputActionHandler) == 0x000020, "Wrong size on CommonActivatablePanel_SetInputActionHandler");
static_assert(offsetof(CommonActivatablePanel_SetInputActionHandler, InputActionRow) == 0x000000, "Member 'CommonActivatablePanel_SetInputActionHandler::InputActionRow' has a wrong offset!");
static_assert(offsetof(CommonActivatablePanel_SetInputActionHandler, CommitedEvent) == 0x000010, "Member 'CommonActivatablePanel_SetInputActionHandler::CommitedEvent' has a wrong offset!");

// Function CommonUI.CommonActivatablePanel.SetInputActionHandlerWithPopupMenu
// 0x0028 (0x0028 - 0x0000)
struct CommonActivatablePanel_SetInputActionHandlerWithPopupMenu final
{
public:
	struct FDataTableRowHandle                    InputActionRow;                                    // 0x0000(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(bool* bPassThrough)>           CommitedEvent;                                     // 0x0010(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UCommonPopupMenu*                       PopupMenu;                                         // 0x0020(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonActivatablePanel_SetInputActionHandlerWithPopupMenu) == 0x000008, "Wrong alignment on CommonActivatablePanel_SetInputActionHandlerWithPopupMenu");
static_assert(sizeof(CommonActivatablePanel_SetInputActionHandlerWithPopupMenu) == 0x000028, "Wrong size on CommonActivatablePanel_SetInputActionHandlerWithPopupMenu");
static_assert(offsetof(CommonActivatablePanel_SetInputActionHandlerWithPopupMenu, InputActionRow) == 0x000000, "Member 'CommonActivatablePanel_SetInputActionHandlerWithPopupMenu::InputActionRow' has a wrong offset!");
static_assert(offsetof(CommonActivatablePanel_SetInputActionHandlerWithPopupMenu, CommitedEvent) == 0x000010, "Member 'CommonActivatablePanel_SetInputActionHandlerWithPopupMenu::CommitedEvent' has a wrong offset!");
static_assert(offsetof(CommonActivatablePanel_SetInputActionHandlerWithPopupMenu, PopupMenu) == 0x000020, "Member 'CommonActivatablePanel_SetInputActionHandlerWithPopupMenu::PopupMenu' has a wrong offset!");

// Function CommonUI.CommonActivatablePanel.SetInputActionHandlerWithProgress
// 0x0030 (0x0030 - 0x0000)
struct CommonActivatablePanel_SetInputActionHandlerWithProgress final
{
public:
	struct FDataTableRowHandle                    InputActionRow;                                    // 0x0000(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(bool* bPassThrough)>           CommitedEvent;                                     // 0x0010(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(float HeldPercent)>            ProgressEvent;                                     // 0x0020(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonActivatablePanel_SetInputActionHandlerWithProgress) == 0x000008, "Wrong alignment on CommonActivatablePanel_SetInputActionHandlerWithProgress");
static_assert(sizeof(CommonActivatablePanel_SetInputActionHandlerWithProgress) == 0x000030, "Wrong size on CommonActivatablePanel_SetInputActionHandlerWithProgress");
static_assert(offsetof(CommonActivatablePanel_SetInputActionHandlerWithProgress, InputActionRow) == 0x000000, "Member 'CommonActivatablePanel_SetInputActionHandlerWithProgress::InputActionRow' has a wrong offset!");
static_assert(offsetof(CommonActivatablePanel_SetInputActionHandlerWithProgress, CommitedEvent) == 0x000010, "Member 'CommonActivatablePanel_SetInputActionHandlerWithProgress::CommitedEvent' has a wrong offset!");
static_assert(offsetof(CommonActivatablePanel_SetInputActionHandlerWithProgress, ProgressEvent) == 0x000020, "Member 'CommonActivatablePanel_SetInputActionHandlerWithProgress::ProgressEvent' has a wrong offset!");

// Function CommonUI.CommonActivatablePanel.SetInputActionHandlerWithProgressPopupMenu
// 0x0038 (0x0038 - 0x0000)
struct CommonActivatablePanel_SetInputActionHandlerWithProgressPopupMenu final
{
public:
	struct FDataTableRowHandle                    InputActionRow;                                    // 0x0000(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(bool* bPassThrough)>           CommitedEvent;                                     // 0x0010(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(float HeldPercent)>            ProgressEvent;                                     // 0x0020(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UCommonPopupMenu*                       PopupMenu;                                         // 0x0030(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonActivatablePanel_SetInputActionHandlerWithProgressPopupMenu) == 0x000008, "Wrong alignment on CommonActivatablePanel_SetInputActionHandlerWithProgressPopupMenu");
static_assert(sizeof(CommonActivatablePanel_SetInputActionHandlerWithProgressPopupMenu) == 0x000038, "Wrong size on CommonActivatablePanel_SetInputActionHandlerWithProgressPopupMenu");
static_assert(offsetof(CommonActivatablePanel_SetInputActionHandlerWithProgressPopupMenu, InputActionRow) == 0x000000, "Member 'CommonActivatablePanel_SetInputActionHandlerWithProgressPopupMenu::InputActionRow' has a wrong offset!");
static_assert(offsetof(CommonActivatablePanel_SetInputActionHandlerWithProgressPopupMenu, CommitedEvent) == 0x000010, "Member 'CommonActivatablePanel_SetInputActionHandlerWithProgressPopupMenu::CommitedEvent' has a wrong offset!");
static_assert(offsetof(CommonActivatablePanel_SetInputActionHandlerWithProgressPopupMenu, ProgressEvent) == 0x000020, "Member 'CommonActivatablePanel_SetInputActionHandlerWithProgressPopupMenu::ProgressEvent' has a wrong offset!");
static_assert(offsetof(CommonActivatablePanel_SetInputActionHandlerWithProgressPopupMenu, PopupMenu) == 0x000030, "Member 'CommonActivatablePanel_SetInputActionHandlerWithProgressPopupMenu::PopupMenu' has a wrong offset!");

// Function CommonUI.CommonActivatablePanel.GetInputActions
// 0x0018 (0x0018 - 0x0000)
struct CommonActivatablePanel_GetInputActions final
{
public:
	TArray<struct FCommonInputActionHandlerData>  InputActionDataRows;                               // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CommonActivatablePanel_GetInputActions) == 0x000008, "Wrong alignment on CommonActivatablePanel_GetInputActions");
static_assert(sizeof(CommonActivatablePanel_GetInputActions) == 0x000018, "Wrong size on CommonActivatablePanel_GetInputActions");
static_assert(offsetof(CommonActivatablePanel_GetInputActions, InputActionDataRows) == 0x000000, "Member 'CommonActivatablePanel_GetInputActions::InputActionDataRows' has a wrong offset!");
static_assert(offsetof(CommonActivatablePanel_GetInputActions, ReturnValue) == 0x000010, "Member 'CommonActivatablePanel_GetInputActions::ReturnValue' has a wrong offset!");

// Function CommonUI.CommonActivatablePanel.HasInputActionHandler
// 0x0018 (0x0018 - 0x0000)
struct CommonActivatablePanel_HasInputActionHandler final
{
public:
	struct FDataTableRowHandle                    InputActionRow;                                    // 0x0000(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CommonActivatablePanel_HasInputActionHandler) == 0x000008, "Wrong alignment on CommonActivatablePanel_HasInputActionHandler");
static_assert(sizeof(CommonActivatablePanel_HasInputActionHandler) == 0x000018, "Wrong size on CommonActivatablePanel_HasInputActionHandler");
static_assert(offsetof(CommonActivatablePanel_HasInputActionHandler, InputActionRow) == 0x000000, "Member 'CommonActivatablePanel_HasInputActionHandler::InputActionRow' has a wrong offset!");
static_assert(offsetof(CommonActivatablePanel_HasInputActionHandler, ReturnValue) == 0x000010, "Member 'CommonActivatablePanel_HasInputActionHandler::ReturnValue' has a wrong offset!");

// Function CommonUI.CommonActivatablePanel.IsActivated
// 0x0001 (0x0001 - 0x0000)
struct CommonActivatablePanel_IsActivated final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonActivatablePanel_IsActivated) == 0x000001, "Wrong alignment on CommonActivatablePanel_IsActivated");
static_assert(sizeof(CommonActivatablePanel_IsActivated) == 0x000001, "Wrong size on CommonActivatablePanel_IsActivated");
static_assert(offsetof(CommonActivatablePanel_IsActivated, ReturnValue) == 0x000000, "Member 'CommonActivatablePanel_IsActivated::ReturnValue' has a wrong offset!");

// Function CommonUI.CommonActivatablePanel.IsInActivationStack
// 0x0001 (0x0001 - 0x0000)
struct CommonActivatablePanel_IsInActivationStack final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonActivatablePanel_IsInActivationStack) == 0x000001, "Wrong alignment on CommonActivatablePanel_IsInActivationStack");
static_assert(sizeof(CommonActivatablePanel_IsInActivationStack) == 0x000001, "Wrong size on CommonActivatablePanel_IsInActivationStack");
static_assert(offsetof(CommonActivatablePanel_IsInActivationStack, ReturnValue) == 0x000000, "Member 'CommonActivatablePanel_IsInActivationStack::ReturnValue' has a wrong offset!");

// Function CommonUI.CommonActivatablePanel.IsIntroed
// 0x0001 (0x0001 - 0x0000)
struct CommonActivatablePanel_IsIntroed final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonActivatablePanel_IsIntroed) == 0x000001, "Wrong alignment on CommonActivatablePanel_IsIntroed");
static_assert(sizeof(CommonActivatablePanel_IsIntroed) == 0x000001, "Wrong size on CommonActivatablePanel_IsIntroed");
static_assert(offsetof(CommonActivatablePanel_IsIntroed, ReturnValue) == 0x000000, "Member 'CommonActivatablePanel_IsIntroed::ReturnValue' has a wrong offset!");

// Function CommonUI.CommonBorderStyle.GetBackgroundBrush
// 0x0088 (0x0088 - 0x0000)
struct CommonBorderStyle_GetBackgroundBrush final
{
public:
	struct FSlateBrush                            Brush;                                             // 0x0000(0x0088)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonBorderStyle_GetBackgroundBrush) == 0x000008, "Wrong alignment on CommonBorderStyle_GetBackgroundBrush");
static_assert(sizeof(CommonBorderStyle_GetBackgroundBrush) == 0x000088, "Wrong size on CommonBorderStyle_GetBackgroundBrush");
static_assert(offsetof(CommonBorderStyle_GetBackgroundBrush, Brush) == 0x000000, "Member 'CommonBorderStyle_GetBackgroundBrush::Brush' has a wrong offset!");

// Function CommonUI.CommonButtonStyle.GetButtonPadding
// 0x0010 (0x0010 - 0x0000)
struct CommonButtonStyle_GetButtonPadding final
{
public:
	struct FMargin                                OutButtonPadding;                                  // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButtonStyle_GetButtonPadding) == 0x000004, "Wrong alignment on CommonButtonStyle_GetButtonPadding");
static_assert(sizeof(CommonButtonStyle_GetButtonPadding) == 0x000010, "Wrong size on CommonButtonStyle_GetButtonPadding");
static_assert(offsetof(CommonButtonStyle_GetButtonPadding, OutButtonPadding) == 0x000000, "Member 'CommonButtonStyle_GetButtonPadding::OutButtonPadding' has a wrong offset!");

// Function CommonUI.CommonButtonStyle.GetCustomPadding
// 0x0010 (0x0010 - 0x0000)
struct CommonButtonStyle_GetCustomPadding final
{
public:
	struct FMargin                                OutCustomPadding;                                  // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButtonStyle_GetCustomPadding) == 0x000004, "Wrong alignment on CommonButtonStyle_GetCustomPadding");
static_assert(sizeof(CommonButtonStyle_GetCustomPadding) == 0x000010, "Wrong size on CommonButtonStyle_GetCustomPadding");
static_assert(offsetof(CommonButtonStyle_GetCustomPadding, OutCustomPadding) == 0x000000, "Member 'CommonButtonStyle_GetCustomPadding::OutCustomPadding' has a wrong offset!");

// Function CommonUI.CommonButtonStyle.GetDisabledBrush
// 0x0088 (0x0088 - 0x0000)
struct CommonButtonStyle_GetDisabledBrush final
{
public:
	struct FSlateBrush                            Brush;                                             // 0x0000(0x0088)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButtonStyle_GetDisabledBrush) == 0x000008, "Wrong alignment on CommonButtonStyle_GetDisabledBrush");
static_assert(sizeof(CommonButtonStyle_GetDisabledBrush) == 0x000088, "Wrong size on CommonButtonStyle_GetDisabledBrush");
static_assert(offsetof(CommonButtonStyle_GetDisabledBrush, Brush) == 0x000000, "Member 'CommonButtonStyle_GetDisabledBrush::Brush' has a wrong offset!");

// Function CommonUI.CommonButtonStyle.GetDisabledTextStyle
// 0x0008 (0x0008 - 0x0000)
struct CommonButtonStyle_GetDisabledTextStyle final
{
public:
	class UCommonTextStyle*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButtonStyle_GetDisabledTextStyle) == 0x000008, "Wrong alignment on CommonButtonStyle_GetDisabledTextStyle");
static_assert(sizeof(CommonButtonStyle_GetDisabledTextStyle) == 0x000008, "Wrong size on CommonButtonStyle_GetDisabledTextStyle");
static_assert(offsetof(CommonButtonStyle_GetDisabledTextStyle, ReturnValue) == 0x000000, "Member 'CommonButtonStyle_GetDisabledTextStyle::ReturnValue' has a wrong offset!");

// Function CommonUI.CommonButtonStyle.GetMaterialBrush
// 0x0088 (0x0088 - 0x0000)
struct CommonButtonStyle_GetMaterialBrush final
{
public:
	struct FSlateBrush                            Brush;                                             // 0x0000(0x0088)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButtonStyle_GetMaterialBrush) == 0x000008, "Wrong alignment on CommonButtonStyle_GetMaterialBrush");
static_assert(sizeof(CommonButtonStyle_GetMaterialBrush) == 0x000088, "Wrong size on CommonButtonStyle_GetMaterialBrush");
static_assert(offsetof(CommonButtonStyle_GetMaterialBrush, Brush) == 0x000000, "Member 'CommonButtonStyle_GetMaterialBrush::Brush' has a wrong offset!");

// Function CommonUI.CommonButtonStyle.GetNormalBaseBrush
// 0x0088 (0x0088 - 0x0000)
struct CommonButtonStyle_GetNormalBaseBrush final
{
public:
	struct FSlateBrush                            Brush;                                             // 0x0000(0x0088)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButtonStyle_GetNormalBaseBrush) == 0x000008, "Wrong alignment on CommonButtonStyle_GetNormalBaseBrush");
static_assert(sizeof(CommonButtonStyle_GetNormalBaseBrush) == 0x000088, "Wrong size on CommonButtonStyle_GetNormalBaseBrush");
static_assert(offsetof(CommonButtonStyle_GetNormalBaseBrush, Brush) == 0x000000, "Member 'CommonButtonStyle_GetNormalBaseBrush::Brush' has a wrong offset!");

// Function CommonUI.CommonButtonStyle.GetNormalHoveredBrush
// 0x0088 (0x0088 - 0x0000)
struct CommonButtonStyle_GetNormalHoveredBrush final
{
public:
	struct FSlateBrush                            Brush;                                             // 0x0000(0x0088)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButtonStyle_GetNormalHoveredBrush) == 0x000008, "Wrong alignment on CommonButtonStyle_GetNormalHoveredBrush");
static_assert(sizeof(CommonButtonStyle_GetNormalHoveredBrush) == 0x000088, "Wrong size on CommonButtonStyle_GetNormalHoveredBrush");
static_assert(offsetof(CommonButtonStyle_GetNormalHoveredBrush, Brush) == 0x000000, "Member 'CommonButtonStyle_GetNormalHoveredBrush::Brush' has a wrong offset!");

// Function CommonUI.CommonButtonStyle.GetNormalHoveredTextStyle
// 0x0008 (0x0008 - 0x0000)
struct CommonButtonStyle_GetNormalHoveredTextStyle final
{
public:
	class UCommonTextStyle*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButtonStyle_GetNormalHoveredTextStyle) == 0x000008, "Wrong alignment on CommonButtonStyle_GetNormalHoveredTextStyle");
static_assert(sizeof(CommonButtonStyle_GetNormalHoveredTextStyle) == 0x000008, "Wrong size on CommonButtonStyle_GetNormalHoveredTextStyle");
static_assert(offsetof(CommonButtonStyle_GetNormalHoveredTextStyle, ReturnValue) == 0x000000, "Member 'CommonButtonStyle_GetNormalHoveredTextStyle::ReturnValue' has a wrong offset!");

// Function CommonUI.CommonButtonStyle.GetNormalPressedBrush
// 0x0088 (0x0088 - 0x0000)
struct CommonButtonStyle_GetNormalPressedBrush final
{
public:
	struct FSlateBrush                            Brush;                                             // 0x0000(0x0088)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButtonStyle_GetNormalPressedBrush) == 0x000008, "Wrong alignment on CommonButtonStyle_GetNormalPressedBrush");
static_assert(sizeof(CommonButtonStyle_GetNormalPressedBrush) == 0x000088, "Wrong size on CommonButtonStyle_GetNormalPressedBrush");
static_assert(offsetof(CommonButtonStyle_GetNormalPressedBrush, Brush) == 0x000000, "Member 'CommonButtonStyle_GetNormalPressedBrush::Brush' has a wrong offset!");

// Function CommonUI.CommonButtonStyle.GetNormalTextStyle
// 0x0008 (0x0008 - 0x0000)
struct CommonButtonStyle_GetNormalTextStyle final
{
public:
	class UCommonTextStyle*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButtonStyle_GetNormalTextStyle) == 0x000008, "Wrong alignment on CommonButtonStyle_GetNormalTextStyle");
static_assert(sizeof(CommonButtonStyle_GetNormalTextStyle) == 0x000008, "Wrong size on CommonButtonStyle_GetNormalTextStyle");
static_assert(offsetof(CommonButtonStyle_GetNormalTextStyle, ReturnValue) == 0x000000, "Member 'CommonButtonStyle_GetNormalTextStyle::ReturnValue' has a wrong offset!");

// Function CommonUI.CommonButtonStyle.GetSelectedBaseBrush
// 0x0088 (0x0088 - 0x0000)
struct CommonButtonStyle_GetSelectedBaseBrush final
{
public:
	struct FSlateBrush                            Brush;                                             // 0x0000(0x0088)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButtonStyle_GetSelectedBaseBrush) == 0x000008, "Wrong alignment on CommonButtonStyle_GetSelectedBaseBrush");
static_assert(sizeof(CommonButtonStyle_GetSelectedBaseBrush) == 0x000088, "Wrong size on CommonButtonStyle_GetSelectedBaseBrush");
static_assert(offsetof(CommonButtonStyle_GetSelectedBaseBrush, Brush) == 0x000000, "Member 'CommonButtonStyle_GetSelectedBaseBrush::Brush' has a wrong offset!");

// Function CommonUI.CommonButtonStyle.GetSelectedHoveredBrush
// 0x0088 (0x0088 - 0x0000)
struct CommonButtonStyle_GetSelectedHoveredBrush final
{
public:
	struct FSlateBrush                            Brush;                                             // 0x0000(0x0088)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButtonStyle_GetSelectedHoveredBrush) == 0x000008, "Wrong alignment on CommonButtonStyle_GetSelectedHoveredBrush");
static_assert(sizeof(CommonButtonStyle_GetSelectedHoveredBrush) == 0x000088, "Wrong size on CommonButtonStyle_GetSelectedHoveredBrush");
static_assert(offsetof(CommonButtonStyle_GetSelectedHoveredBrush, Brush) == 0x000000, "Member 'CommonButtonStyle_GetSelectedHoveredBrush::Brush' has a wrong offset!");

// Function CommonUI.CommonButtonStyle.GetSelectedHoveredTextStyle
// 0x0008 (0x0008 - 0x0000)
struct CommonButtonStyle_GetSelectedHoveredTextStyle final
{
public:
	class UCommonTextStyle*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButtonStyle_GetSelectedHoveredTextStyle) == 0x000008, "Wrong alignment on CommonButtonStyle_GetSelectedHoveredTextStyle");
static_assert(sizeof(CommonButtonStyle_GetSelectedHoveredTextStyle) == 0x000008, "Wrong size on CommonButtonStyle_GetSelectedHoveredTextStyle");
static_assert(offsetof(CommonButtonStyle_GetSelectedHoveredTextStyle, ReturnValue) == 0x000000, "Member 'CommonButtonStyle_GetSelectedHoveredTextStyle::ReturnValue' has a wrong offset!");

// Function CommonUI.CommonButtonStyle.GetSelectedPressedBrush
// 0x0088 (0x0088 - 0x0000)
struct CommonButtonStyle_GetSelectedPressedBrush final
{
public:
	struct FSlateBrush                            Brush;                                             // 0x0000(0x0088)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButtonStyle_GetSelectedPressedBrush) == 0x000008, "Wrong alignment on CommonButtonStyle_GetSelectedPressedBrush");
static_assert(sizeof(CommonButtonStyle_GetSelectedPressedBrush) == 0x000088, "Wrong size on CommonButtonStyle_GetSelectedPressedBrush");
static_assert(offsetof(CommonButtonStyle_GetSelectedPressedBrush, Brush) == 0x000000, "Member 'CommonButtonStyle_GetSelectedPressedBrush::Brush' has a wrong offset!");

// Function CommonUI.CommonButtonStyle.GetSelectedTextStyle
// 0x0008 (0x0008 - 0x0000)
struct CommonButtonStyle_GetSelectedTextStyle final
{
public:
	class UCommonTextStyle*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButtonStyle_GetSelectedTextStyle) == 0x000008, "Wrong alignment on CommonButtonStyle_GetSelectedTextStyle");
static_assert(sizeof(CommonButtonStyle_GetSelectedTextStyle) == 0x000008, "Wrong size on CommonButtonStyle_GetSelectedTextStyle");
static_assert(offsetof(CommonButtonStyle_GetSelectedTextStyle, ReturnValue) == 0x000000, "Member 'CommonButtonStyle_GetSelectedTextStyle::ReturnValue' has a wrong offset!");

// Function CommonUI.CommonButton.DisableButtonWithReason
// 0x0018 (0x0018 - 0x0000)
struct CommonButton_DisableButtonWithReason final
{
public:
	class FText                                   DisabledReason;                                    // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButton_DisableButtonWithReason) == 0x000008, "Wrong alignment on CommonButton_DisableButtonWithReason");
static_assert(sizeof(CommonButton_DisableButtonWithReason) == 0x000018, "Wrong size on CommonButton_DisableButtonWithReason");
static_assert(offsetof(CommonButton_DisableButtonWithReason, DisabledReason) == 0x000000, "Member 'CommonButton_DisableButtonWithReason::DisabledReason' has a wrong offset!");

// Function CommonUI.CommonButton.HandleTriggeringActionCommited
// 0x0001 (0x0001 - 0x0000)
struct CommonButton_HandleTriggeringActionCommited final
{
public:
	bool                                          bPassThrough;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButton_HandleTriggeringActionCommited) == 0x000001, "Wrong alignment on CommonButton_HandleTriggeringActionCommited");
static_assert(sizeof(CommonButton_HandleTriggeringActionCommited) == 0x000001, "Wrong size on CommonButton_HandleTriggeringActionCommited");
static_assert(offsetof(CommonButton_HandleTriggeringActionCommited, bPassThrough) == 0x000000, "Member 'CommonButton_HandleTriggeringActionCommited::bPassThrough' has a wrong offset!");

// Function CommonUI.CommonButton.NativeOnActionProgress
// 0x0004 (0x0004 - 0x0000)
struct CommonButton_NativeOnActionProgress final
{
public:
	float                                         HeldPercent;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButton_NativeOnActionProgress) == 0x000004, "Wrong alignment on CommonButton_NativeOnActionProgress");
static_assert(sizeof(CommonButton_NativeOnActionProgress) == 0x000004, "Wrong size on CommonButton_NativeOnActionProgress");
static_assert(offsetof(CommonButton_NativeOnActionProgress, HeldPercent) == 0x000000, "Member 'CommonButton_NativeOnActionProgress::HeldPercent' has a wrong offset!");

// Function CommonUI.CommonButton.OnActionProgress
// 0x0004 (0x0004 - 0x0000)
struct CommonButton_OnActionProgress final
{
public:
	float                                         HeldPercent;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButton_OnActionProgress) == 0x000004, "Wrong alignment on CommonButton_OnActionProgress");
static_assert(sizeof(CommonButton_OnActionProgress) == 0x000004, "Wrong size on CommonButton_OnActionProgress");
static_assert(offsetof(CommonButton_OnActionProgress, HeldPercent) == 0x000000, "Member 'CommonButton_OnActionProgress::HeldPercent' has a wrong offset!");

// Function CommonUI.CommonButton.OnInputMethodChanged
// 0x0001 (0x0001 - 0x0000)
struct CommonButton_OnInputMethodChanged final
{
public:
	ECommonInputType                              CurrentInputType;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButton_OnInputMethodChanged) == 0x000001, "Wrong alignment on CommonButton_OnInputMethodChanged");
static_assert(sizeof(CommonButton_OnInputMethodChanged) == 0x000001, "Wrong size on CommonButton_OnInputMethodChanged");
static_assert(offsetof(CommonButton_OnInputMethodChanged, CurrentInputType) == 0x000000, "Member 'CommonButton_OnInputMethodChanged::CurrentInputType' has a wrong offset!");

// Function CommonUI.CommonButton.OnTriggeredInputActionChanged
// 0x0010 (0x0010 - 0x0000)
struct CommonButton_OnTriggeredInputActionChanged final
{
public:
	struct FDataTableRowHandle                    NewTriggeredAction;                                // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButton_OnTriggeredInputActionChanged) == 0x000008, "Wrong alignment on CommonButton_OnTriggeredInputActionChanged");
static_assert(sizeof(CommonButton_OnTriggeredInputActionChanged) == 0x000010, "Wrong size on CommonButton_OnTriggeredInputActionChanged");
static_assert(offsetof(CommonButton_OnTriggeredInputActionChanged, NewTriggeredAction) == 0x000000, "Member 'CommonButton_OnTriggeredInputActionChanged::NewTriggeredAction' has a wrong offset!");

// Function CommonUI.CommonButton.SetClickMethod
// 0x0001 (0x0001 - 0x0000)
struct CommonButton_SetClickMethod final
{
public:
	EButtonClickMethod                            InClickMethod;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButton_SetClickMethod) == 0x000001, "Wrong alignment on CommonButton_SetClickMethod");
static_assert(sizeof(CommonButton_SetClickMethod) == 0x000001, "Wrong size on CommonButton_SetClickMethod");
static_assert(offsetof(CommonButton_SetClickMethod, InClickMethod) == 0x000000, "Member 'CommonButton_SetClickMethod::InClickMethod' has a wrong offset!");

// Function CommonUI.CommonButton.SetInputActionProgressMaterial
// 0x0090 (0x0090 - 0x0000)
struct CommonButton_SetInputActionProgressMaterial final
{
public:
	struct FSlateBrush                            InProgressMaterialBrush;                           // 0x0000(0x0088)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   InProgressMaterialParam;                           // 0x0088(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButton_SetInputActionProgressMaterial) == 0x000008, "Wrong alignment on CommonButton_SetInputActionProgressMaterial");
static_assert(sizeof(CommonButton_SetInputActionProgressMaterial) == 0x000090, "Wrong size on CommonButton_SetInputActionProgressMaterial");
static_assert(offsetof(CommonButton_SetInputActionProgressMaterial, InProgressMaterialBrush) == 0x000000, "Member 'CommonButton_SetInputActionProgressMaterial::InProgressMaterialBrush' has a wrong offset!");
static_assert(offsetof(CommonButton_SetInputActionProgressMaterial, InProgressMaterialParam) == 0x000088, "Member 'CommonButton_SetInputActionProgressMaterial::InProgressMaterialParam' has a wrong offset!");

// Function CommonUI.CommonButton.SetIsInteractableWhenSelected
// 0x0001 (0x0001 - 0x0000)
struct CommonButton_SetIsInteractableWhenSelected final
{
public:
	bool                                          bInInteractableWhenSelected;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButton_SetIsInteractableWhenSelected) == 0x000001, "Wrong alignment on CommonButton_SetIsInteractableWhenSelected");
static_assert(sizeof(CommonButton_SetIsInteractableWhenSelected) == 0x000001, "Wrong size on CommonButton_SetIsInteractableWhenSelected");
static_assert(offsetof(CommonButton_SetIsInteractableWhenSelected, bInInteractableWhenSelected) == 0x000000, "Member 'CommonButton_SetIsInteractableWhenSelected::bInInteractableWhenSelected' has a wrong offset!");

// Function CommonUI.CommonButton.SetIsInteractionEnabled
// 0x0001 (0x0001 - 0x0000)
struct CommonButton_SetIsInteractionEnabled final
{
public:
	bool                                          bInIsInteractionEnabled;                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
