#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ControlRig

#include "Basic.hpp"

#include "AnimationCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "MovieSceneTracks_structs.hpp"
#include "PropertyPath_structs.hpp"
#include "MovieScene_structs.hpp"


namespace SDK
{

// Enum ControlRig.ERigExecutionType
// NumValues: 0x0003
enum class ERigExecutionType : uint8
{
	Runtime                                  = 0,
	Editing                                  = 1,
	Max                                      = 2,
};

// Enum ControlRig.EControlRigOpCode
// NumValues: 0x0005
enum class EControlRigOpCode : uint8
{
	Done                                     = 0,
	Copy                                     = 1,
	Exec                                     = 2,
	Invalid                                  = 3,
	EControlRigOpCode_MAX                    = 4,
};

// Enum ControlRig.EBoneGetterSetterMode
// NumValues: 0x0003
enum class EBoneGetterSetterMode : uint8
{
	LocalSpace                               = 0,
	GlobalSpace                              = 1,
	Max                                      = 2,
};

// Enum ControlRig.ETransformGetterType
// NumValues: 0x0003
enum class ETransformGetterType : uint8
{
	Initial                                  = 0,
	Current                                  = 1,
	Max                                      = 2,
};

// Enum ControlRig.ETransformSpaceMode
// NumValues: 0x0005
enum class ETransformSpaceMode : uint8
{
	LocalSpace                               = 0,
	GlobalSpace                              = 1,
	BaseSpace                                = 2,
	BaseJoint                                = 3,
	Max                                      = 4,
};

// Enum ControlRig.EControlRigDrawHierarchyMode
// NumValues: 0x0002
enum class EControlRigDrawHierarchyMode : uint8
{
	Axes                                     = 0,
	Max                                      = 1,
};

// Enum ControlRig.EControlRigAnimEasingType
// NumValues: 0x0020
enum class EControlRigAnimEasingType : uint8
{
	Linear                                   = 0,
	QuadraticEaseIn                          = 1,
	QuadraticEaseOut                         = 2,
	QuadraticEaseInOut                       = 3,
	CubicEaseIn                              = 4,
	CubicEaseOut                             = 5,
	CubicEaseInOut                           = 6,
	QuarticEaseIn                            = 7,
	QuarticEaseOut                           = 8,
	QuarticEaseInOut                         = 9,
	QuinticEaseIn                            = 10,
	QuinticEaseOut                           = 11,
	QuinticEaseInOut                         = 12,
	SineEaseIn                               = 13,
	SineEaseOut                              = 14,
	SineEaseInOut                            = 15,
	CircularEaseIn                           = 16,
	CircularEaseOut                          = 17,
	CircularEaseInOut                        = 18,
	ExponentialEaseIn                        = 19,
	ExponentialEaseOut                       = 20,
	ExponentialEaseInOut                     = 21,
	ElasticEaseIn                            = 22,
	ElasticEaseOut                           = 23,
	ElasticEaseInOut                         = 24,
	BackEaseIn                               = 25,
	BackEaseOut                              = 26,
	BackEaseInOut                            = 27,
	BounceEaseIn                             = 28,
	BounceEaseOut                            = 29,
	BounceEaseInOut                          = 30,
	EControlRigAnimEasingType_MAX            = 31,
};

// Enum ControlRig.EControlRigRotationOrder
// NumValues: 0x0007
enum class EControlRigRotationOrder : uint8
{
	XYZ                                      = 0,
	XZY                                      = 1,
	YXZ                                      = 2,
	YZX                                      = 3,
	ZXY                                      = 4,
	ZYX                                      = 5,
	EControlRigRotationOrder_MAX             = 6,
};

// Enum ControlRig.ECRSimPointIntegrateType
// NumValues: 0x0003
enum class ECRSimPointIntegrateType : uint8
{
	Verlet                                   = 0,
	SemiExplicitEuler                        = 1,
	ECRSimPointIntegrateType_MAX             = 2,
};

// Enum ControlRig.ECRSimConstraintType
// NumValues: 0x0005
enum class ECRSimConstraintType : uint8
{
	Distance                                 = 0,
	DistanceFromA                            = 1,
	DistanceFromB                            = 2,
	Plane                                    = 3,
	ECRSimConstraintType_MAX                 = 4,
};

// Enum ControlRig.ECRSimPointForceType
// NumValues: 0x0002
enum class ECRSimPointForceType : uint8
{
	Direction                                = 0,
	ECRSimPointForceType_MAX                 = 1,
};

// Enum ControlRig.ECRSimSoftCollisionType
// NumValues: 0x0004
enum class ECRSimSoftCollisionType : uint8
{
	Plane                                    = 0,
	Sphere                                   = 1,
	Cone                                     = 2,
	ECRSimSoftCollisionType_MAX              = 3,
};

// Enum ControlRig.EUnitExecutionType
// NumValues: 0x0005
enum class EUnitExecutionType : uint8
{
	Always                                   = 0,
	InEditingTime                            = 1,
	Disable                                  = 2,
	Initialize                               = 3,
	Max                                      = 4,
};

// Enum ControlRig.EAimMode
// NumValues: 0x0003
enum class EAimMode : uint8
{
	AimAtTarget                              = 0,
	OrientToTarget                           = 1,
	MAX                                      = 2,
};

// Enum ControlRig.EApplyTransformMode
// NumValues: 0x0003
enum class EApplyTransformMode : uint8
{
	Override                                 = 0,
	Additive                                 = 1,
	Max                                      = 2,
};

// Enum ControlRig.ERigUnitDebugPointMode
// NumValues: 0x0003
enum class ERigUnitDebugPointMode : uint8
{
	Point                                    = 0,
	Vector                                   = 1,
	Max                                      = 2,
};

// Enum ControlRig.ERigUnitDebugTransformMode
// NumValues: 0x0004
enum class ERigUnitDebugTransformMode : uint8
{
	Point                                    = 0,
	Axes                                     = 1,
	Box                                      = 2,
	Max                                      = 3,
};

// Enum ControlRig.EControlRigCurveAlignment
// NumValues: 0x0003
enum class EControlRigCurveAlignment : uint8
{
	Front                                    = 0,
	Stretched                                = 1,
	EControlRigCurveAlignment_MAX            = 2,
};

// Enum ControlRig.EControlRigVectorKind
// NumValues: 0x0003
enum class EControlRigVectorKind : uint8
{
	Direction                                = 0,
	Location                                 = 1,
	EControlRigVectorKind_MAX                = 2,
};

// Enum ControlRig.EControlRigModifyBoneMode
// NumValues: 0x0005
enum class EControlRigModifyBoneMode : uint8
{
	OverrideLocal                            = 0,
	OverrideGlobal                           = 1,
	AdditiveLocal                            = 2,
	AdditiveGlobal                           = 3,
	Max                                      = 4,
};

// Enum ControlRig.EControlRigState
// NumValues: 0x0004
enum class EControlRigState : uint8
{
	Init                                     = 0,
	Update                                   = 1,
	Invalid                                  = 2,
	EControlRigState_MAX                     = 3,
};

// ScriptStruct ControlRig.RigUnit
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FRigUnit
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   RigUnitName;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   RigUnitStructName;                                 // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUnitExecutionType                            ExecutionType;                                     // 0x0018(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRigUnit) == 0x000008, "Wrong alignment on FRigUnit");
static_assert(sizeof(FRigUnit) == 0x000020, "Wrong size on FRigUnit");
static_assert(offsetof(FRigUnit, RigUnitName) == 0x000008, "Member 'FRigUnit::RigUnitName' has a wrong offset!");
static_assert(offsetof(FRigUnit, RigUnitStructName) == 0x000010, "Member 'FRigUnit::RigUnitStructName' has a wrong offset!");
static_assert(offsetof(FRigUnit, ExecutionType) == 0x000018, "Member 'FRigUnit::ExecutionType' has a wrong offset!");

// ScriptStruct ControlRig.RigUnit_AnimBase
// 0x0000 (0x0020 - 0x0020)
struct FRigUnit_AnimBase : public FRigUnit
{
};
static_assert(alignof(FRigUnit_AnimBase) == 0x000008, "Wrong alignment on FRigUnit_AnimBase");
static_assert(sizeof(FRigUnit_AnimBase) == 0x000020, "Wrong size on FRigUnit_AnimBase");

// ScriptStruct ControlRig.RigUnit_AnimEvalRichCurve
// 0x00A8 (0x00C8 - 0x0020)
struct FRigUnit_AnimEvalRichCurve final : public FRigUnit_AnimBase
{
public:
	float                                         Value;                                             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRuntimeFloatCurve                     Curve;                                             // 0x0028(0x0088)(NativeAccessSpecifierPublic)
	float                                         SourceMinimum;                                     // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SourceMaximum;                                     // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TargetMinimum;                                     // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TargetMaximum;                                     // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Result;                                            // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRigUnit_AnimEvalRichCurve) == 0x000008, "Wrong alignment on FRigUnit_AnimEvalRichCurve");
static_assert(sizeof(FRigUnit_AnimEvalRichCurve) == 0x0000C8, "Wrong size on FRigUnit_AnimEvalRichCurve");
static_assert(offsetof(FRigUnit_AnimEvalRichCurve, Value) == 0x000020, "Member 'FRigUnit_AnimEvalRichCurve::Value' has a wrong offset!");
static_assert(offsetof(FRigUnit_AnimEvalRichCurve, Curve) == 0x000028, "Member 'FRigUnit_AnimEvalRichCurve::Curve' has a wrong offset!");
static_assert(offsetof(FRigUnit_AnimEvalRichCurve, SourceMinimum) == 0x0000B0, "Member 'FRigUnit_AnimEvalRichCurve::SourceMinimum' has a wrong offset!");
static_assert(offsetof(FRigUnit_AnimEvalRichCurve, SourceMaximum) == 0x0000B4, "Member 'FRigUnit_AnimEvalRichCurve::SourceMaximum' has a wrong offset!");
static_assert(offsetof(FRigUnit_AnimEvalRichCurve, TargetMinimum) == 0x0000B8, "Member 'FRigUnit_AnimEvalRichCurve::TargetMinimum' has a wrong offset!");
static_assert(offsetof(FRigUnit_AnimEvalRichCurve, TargetMaximum) == 0x0000BC, "Member 'FRigUnit_AnimEvalRichCurve::TargetMaximum' has a wrong offset!");
static_assert(offsetof(FRigUnit_AnimEvalRichCurve, Result) == 0x0000C0, "Member 'FRigUnit_AnimEvalRichCurve::Result' has a wrong offset!");

// ScriptStruct ControlRig.RigUnit_SimBase
// 0x0000 (0x0020 - 0x0020)
struct FRigUnit_SimBase : public FRigUnit
{
};
static_assert(alignof(FRigUnit_SimBase) == 0x000008, "Wrong alignment on FRigUnit_SimBase");
static_assert(sizeof(FRigUnit_SimBase) == 0x000020, "Wrong size on FRigUnit_SimBase");

// ScriptStruct ControlRig.RigUnit_AccumulateFloatAdd
// 0x0018 (0x0038 - 0x0020)
struct FRigUnit_AccumulateFloatAdd final : public FRigUnit_SimBase
{
public:
	float                                         Increment;                                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InitialValue;                                      // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIntegrateDeltaTime;                               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Result;                                            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AccumulatedValue;                                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRigUnit_AccumulateFloatAdd) == 0x000008, "Wrong alignment on FRigUnit_AccumulateFloatAdd");
static_assert(sizeof(FRigUnit_AccumulateFloatAdd) == 0x000038, "Wrong size on FRigUnit_AccumulateFloatAdd");
static_assert(offsetof(FRigUnit_AccumulateFloatAdd, Increment) == 0x000020, "Member 'FRigUnit_AccumulateFloatAdd::Increment' has a wrong offset!");
static_assert(offsetof(FRigUnit_AccumulateFloatAdd, InitialValue) == 0x000024, "Member 'FRigUnit_AccumulateFloatAdd::InitialValue' has a wrong offset!");
static_assert(offsetof(FRigUnit_AccumulateFloatAdd, bIntegrateDeltaTime) == 0x000028, "Member 'FRigUnit_AccumulateFloatAdd::bIntegrateDeltaTime' has a wrong offset!");
static_assert(offsetof(FRigUnit_AccumulateFloatAdd, Result) == 0x00002C, "Member 'FRigUnit_AccumulateFloatAdd::Result' has a wrong offset!");
static_assert(offsetof(FRigUnit_AccumulateFloatAdd, AccumulatedValue) == 0x000030, "Member 'FRigUnit_AccumulateFloatAdd::AccumulatedValue' has a wrong offset!");

// ScriptStruct ControlRig.CRSimPointForce
// 0x0018 (0x0018 - 0x0000)
struct FCRSimPointForce final
{
public:
	ECRSimPointForceType                          ForceType;                                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Vector;                                            // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Coefficient;                                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNormalize;                                        // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCRSimPointForce) == 0x000004, "Wrong alignment on FCRSimPointForce");
static_assert(sizeof(FCRSimPointForce) == 0x000018, "Wrong size on FCRSimPointForce");
static_assert(offsetof(FCRSimPointForce, ForceType) == 0x000000, "Member 'FCRSimPointForce::ForceType' has a wrong offset!");
static_assert(offsetof(FCRSimPointForce, Vector) == 0x000004, "Member 'FCRSimPointForce::Vector' has a wrong offset!");
static_assert(offsetof(FCRSimPointForce, Coefficient) == 0x000010, "Member 'FCRSimPointForce::Coefficient' has a wrong offset!");
static_assert(offsetof(FCRSimPointForce, bNormalize) == 0x000014, "Member 'FCRSimPointForce::bNormalize' has a wrong offset!");

// ScriptStruct ControlRig.ConstraintNodeData
// 0x00B0 (0x00B0 - 0x0000)
struct FConstraintNodeData final
{
public:
	struct FTransform                             RelativeParent;                                    // 0x0000(0x0030)(IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FConstraintOffset                      ConstraintOffset;                                  // 0x0030(0x0060)(NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   LinkedNode;                                        // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FTransformConstraint>           Constraints;                                       // 0x0098(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FConstraintNodeData) == 0x000010, "Wrong alignment on FConstraintNodeData");
static_assert(sizeof(FConstraintNodeData) == 0x0000B0, "Wrong size on FConstraintNodeData");
static_assert(offsetof(FConstraintNodeData, RelativeParent) == 0x000000, "Member 'FConstraintNodeData::RelativeParent' has a wrong offset!");
static_assert(offsetof(FConstraintNodeData, ConstraintOffset) == 0x000030, "Member 'FConstraintNodeData::ConstraintOffset' has a wrong offset!");
static_assert(offsetof(FConstraintNodeData, LinkedNode) == 0x000090, "Member 'FConstraintNodeData::LinkedNode' has a wrong offset!");
static_assert(offsetof(FConstraintNodeData, Constraints) == 0x000098, "Member 'FConstraintNodeData::Constraints' has a wrong offset!");

// ScriptStruct ControlRig.AnimationHierarchy
// 0x0010 (0x0088 - 0x0078)
struct FAnimationHierarchy final : public FNodeHierarchyWithUserData
{
public:
	TArray<struct FConstraintNodeData>            UserData;                                          // 0x0078(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAnimationHierarchy) == 0x000008, "Wrong alignment on FAnimationHierarchy");
static_assert(sizeof(FAnimationHierarchy) == 0x000088, "Wrong size on FAnimationHierarchy");
static_assert(offsetof(FAnimationHierarchy, UserData) == 0x000078, "Member 'FAnimationHierarchy::UserData' has a wrong offset!");

// ScriptStruct ControlRig.RigBone
// 0x00C0 (0x00C0 - 0x0000)
struct FRigBone final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ParentName;                                        // 0x0008(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ParentIndex;                                       // 0x0010(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0xC];                                       // 0x0014(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             InitialTransform;                                  // 0x0020(0x0030)(Edit, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FTransform                             GlobalTransform;                                   // 0x0050(0x0030)(Edit, Transient, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FTransform                             LocalTransform;                                    // 0x0080(0x0030)(Edit, Transient, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 Dependents;                                        // 0x00B0(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRigBone) == 0x000010, "Wrong alignment on FRigBone");
static_assert(sizeof(FRigBone) == 0x0000C0, "Wrong size on FRigBone");
static_assert(offsetof(FRigBone, Name) == 0x000000, "Member 'FRigBone::Name' has a wrong offset!");
static_assert(offsetof(FRigBone, ParentName) == 0x000008, "Member 'FRigBone::ParentName' has a wrong offset!");
static_assert(offsetof(FRigBone, ParentIndex) == 0x000010, "Member 'FRigBone::ParentIndex' has a wrong offset!");
static_assert(offsetof(FRigBone, InitialTransform) == 0x000020, "Member 'FRigBone::InitialTransform' has a wrong offset!");
static_assert(offsetof(FRigBone, GlobalTransform) == 0x000050, "Member 'FRigBone::GlobalTransform' has a wrong offset!");
static_assert(offsetof(FRigBone, LocalTransform) == 0x000080, "Member 'FRigBone::LocalTransform' has a wrong offset!");
static_assert(offsetof(FRigBone, Dependents) == 0x0000B0, "Member 'FRigBone::Dependents' has a wrong offset!");

// ScriptStruct ControlRig.RigUnit_MathBase
// 0x0000 (0x0020 - 0x0020)
struct FRigUnit_MathBase : public FRigUnit
{
};
static_assert(alignof(FRigUnit_MathBase) == 0x000008, "Wrong alignment on FRigUnit_MathBase");
static_assert(sizeof(FRigUnit_MathBase) == 0x000020, "Wrong size on FRigUnit_MathBase");

// ScriptStruct ControlRig.RigUnit_MathFloatBase
// 0x0000 (0x0020 - 0x0020)
struct FRigUnit_MathFloatBase : public FRigUnit_MathBase
{
};
static_assert(alignof(FRigUnit_MathFloatBase) == 0x000008, "Wrong alignment on FRigUnit_MathFloatBase");
static_assert(sizeof(FRigUnit_MathFloatBase) == 0x000020, "Wrong size on FRigUnit_MathFloatBase");

// ScriptStruct ControlRig.RigUnit_MathFloatUnaryOp
// 0x0008 (0x0028 - 0x0020)
struct FRigUnit_MathFloatUnaryOp : public FRigUnit_MathFloatBase
{
public:
	float                                         Value;                                             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Result;                                            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRigUnit_MathFloatUnaryOp) == 0x000008, "Wrong alignment on FRigUnit_MathFloatUnaryOp");
static_assert(sizeof(FRigUnit_MathFloatUnaryOp) == 0x000028, "Wrong size on FRigUnit_MathFloatUnaryOp");
static_assert(offsetof(FRigUnit_MathFloatUnaryOp, Value) == 0x000020, "Member 'FRigUnit_MathFloatUnaryOp::Value' has a wrong offset!");
static_assert(offsetof(FRigUnit_MathFloatUnaryOp, Result) == 0x000024, "Member 'FRigUnit_MathFloatUnaryOp::Result' has a wrong offset!");

// ScriptStruct ControlRig.RigUnit_MathFloatCos
// 0x0000 (0x0028 - 0x0028)
struct FRigUnit_MathFloatCos final : public FRigUnit_MathFloatUnaryOp
{
};
static_assert(alignof(FRigUnit_MathFloatCos) == 0x000008, "Wrong alignment on FRigUnit_MathFloatCos");
static_assert(sizeof(FRigUnit_MathFloatCos) == 0x000028, "Wrong size on FRigUnit_MathFloatCos");

// ScriptStruct ControlRig.AnimNode_ControlRigBase
// 0x0068 (0x00C0 - 0x0058)
struct FAnimNode_ControlRigBase : public FAnimNode_CustomProperty
{
public:
	TArray<class FName>                           ControlRigNodeMapping;                             // 0x0058(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TMap<class FName, uint16>                     CurveMappingUIDs;                                  // 0x0068(0x0050)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UNodeMappingContainer>   NodeMappingContainer;                              // 0x00B8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};
static_assert(alignof(FAnimNode_ControlRigBase) == 0x000008, "Wrong alignment on FAnimNode_ControlRigBase");
static_assert(sizeof(FAnimNode_ControlRigBase) == 0x0000C0, "Wrong size on FAnimNode_ControlRigBase");
static_assert(offsetof(FAnimNode_ControlRigBase, ControlRigNodeMapping) == 0x000058, "Member 'FAnimNode_ControlRigBase::ControlRigNodeMapping' has a wrong offset!");
static_assert(offsetof(FAnimNode_ControlRigBase, CurveMappingUIDs) == 0x000068, "Member 'FAnimNode_ControlRigBase::CurveMappingUIDs' has a wrong offset!");
static_assert(offsetof(FAnimNode_ControlRigBase, NodeMappingContainer) == 0x0000B8, "Member 'FAnimNode_ControlRigBase::NodeMappingContainer' has a wrong offset!");

// ScriptStruct ControlRig.AnimNode_ControlRig_ExternalSource
// 0x0008 (0x00C8 - 0x00C0)
struct FAnimNode_ControlRig_ExternalSource final : public FAnimNode_ControlRigBase
{
public:
	TWeakObjectPtr<class UControlRig>             ControlRig;                                        // 0x00C0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FAnimNode_ControlRig_ExternalSource) == 0x000008, "Wrong alignment on FAnimNode_ControlRig_ExternalSource");
static_assert(sizeof(FAnimNode_ControlRig_ExternalSource) == 0x0000C8, "Wrong size on FAnimNode_ControlRig_ExternalSource");
static_assert(offsetof(FAnimNode_ControlRig_ExternalSource, ControlRig) == 0x0000C0, "Member 'FAnimNode_ControlRig_ExternalSource::ControlRig' has a wrong offset!");

// ScriptStruct ControlRig.RigUnit_AimBone_Target
// 0x0028 (0x0028 - 0x0000)
struct FRigUnit_AimBone_Target final
{
public:
	float                                         Weight;                                            // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Axis;                                              // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Target;                                            // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EControlRigVectorKind                         Kind;                                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Space;                                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRigUnit_AimBone_Target) == 0x000004, "Wrong alignment on FRigUnit_AimBone_Target");
static_assert(sizeof(FRigUnit_AimBone_Target) == 0x000028, "Wrong size on FRigUnit_AimBone_Target");
static_assert(offsetof(FRigUnit_AimBone_Target, Weight) == 0x000000, "Member 'FRigUnit_AimBone_Target::Weight' has a wrong offset!");
static_assert(offsetof(FRigUnit_AimBone_Target, Axis) == 0x000004, "Member 'FRigUnit_AimBone_Target::Axis' has a wrong offset!");
static_assert(offsetof(FRigUnit_AimBone_Target, Target) == 0x000010, "Member 'FRigUnit_AimBone_Target::Target' has a wrong offset!");
static_assert(offsetof(FRigUnit_AimBone_Target, Kind) == 0x00001C, "Member 'FRigUnit_AimBone_Target::Kind' has a wrong offset!");
static_assert(offsetof(FRigUnit_AimBone_Target, Space) == 0x000020, "Member 'FRigUnit_AimBone_Target::Space' has a wrong offset!");

// ScriptStruct ControlRig.ControlRigExecuteContext
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) FControlRigExecuteContext final
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FControlRigExecuteContext) == 0x000008, "Wrong alignment on FControlRigExecuteContext");
static_assert(sizeof(FControlRigExecuteContext) == 0x000018, "Wrong size on FControlRigExecuteContext");

// ScriptStruct ControlRig.RigUnitMutable
// 0x0018 (0x0038 - 0x0020)
struct FRigUnitMutable : public FRigUnit
{
public:
	struct FControlRigExecuteContext              ExecuteContext;                                    // 0x0020(0x0018)(Transient, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRigUnitMutable) == 0x000008, "Wrong alignment on FRigUnitMutable");
static_assert(sizeof(FRigUnitMutable) == 0x000038, "Wrong size on FRigUnitMutable");
static_assert(offsetof(FRigUnitMutable, ExecuteContext) == 0x000020, "Member 'FRigUnitMutable::ExecuteContext' has a wrong offset!");

// ScriptStruct ControlRig.RigUnit_HighlevelBaseMutable
// 0x0000 (0x0038 - 0x0038)
struct FRigUnit_HighlevelBaseMutable : public FRigUnitMutable
{
};
static_assert(alignof(FRigUnit_HighlevelBaseMutable) == 0x000008, "Wrong alignment on FRigUnit_HighlevelBaseMutable");
static_assert(sizeof(FRigUnit_HighlevelBaseMutable) == 0x000038, "Wrong size on FRigUnit_HighlevelBaseMutable");

// ScriptStruct ControlRig.RigUnit_AimBone_DebugSettings
// 0x0040 (0x0040 - 0x0000)
struct FRigUnit_AimBone_DebugSettings final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Scale;                                             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             WorldOffset;                                       // 0x0010(0x0030)(IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRigUnit_AimBone_DebugSettings) == 0x000010, "Wrong alignment on FRigUnit_AimBone_DebugSettings");
static_assert(sizeof(FRigUnit_AimBone_DebugSettings) == 0x000040, "Wrong size on FRigUnit_AimBone_DebugSettings");
static_assert(offsetof(FRigUnit_AimBone_DebugSettings, bEnabled) == 0x000000, "Member 'FRigUnit_AimBone_DebugSettings::bEnabled' has a wrong offset!");
static_assert(offsetof(FRigUnit_AimBone_DebugSettings, Scale) == 0x000004, "Member 'FRigUnit_AimBone_DebugSettings::Scale' has a wrong offset!");
static_assert(offsetof(FRigUnit_AimBone_DebugSettings, WorldOffset) == 0x000010, "Member 'FRigUnit_AimBone_DebugSettings::WorldOffset' has a wrong offset!");

// ScriptStruct ControlRig.RigUnit_AimBone
// 0x00C8 (0x0100 - 0x0038)
struct FRigUnit_AimBone final : public FRigUnit_HighlevelBaseMutable
{
public:
	class FName                                   Bone;                                              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRigUnit_AimBone_Target                Primary;                                           // 0x0040(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FRigUnit_AimBone_Target                Secondary;                                         // 0x0068(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bPropagateToChildren;                              // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0xF];                                       // 0x0091(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_AimBone_DebugSettings         DebugSettings;                                     // 0x00A0(0x0040)(NoDestructor, NativeAccessSpecifierPublic)
	int32                                         BoneIndex;                                         // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PrimaryCachedSpaceName;                            // 0x00E4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PrimaryCachedSpaceIndex;                           // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SecondaryCachedSpaceName;                          // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SecondaryCachedSpaceIndex;                         // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRigUnit_AimBone) == 0x000010, "Wrong alignment on FRigUnit_AimBone");
static_assert(sizeof(FRigUnit_AimBone) == 0x000100, "Wrong size on FRigUnit_AimBone");
static_assert(offsetof(FRigUnit_AimBone, Bone) == 0x000038, "Member 'FRigUnit_AimBone::Bone' has a wrong offset!");
static_assert(offsetof(FRigUnit_AimBone, Primary) == 0x000040, "Member 'FRigUnit_AimBone::Primary' has a wrong offset!");
static_assert(offsetof(FRigUnit_AimBone, Secondary) == 0x000068, "Member 'FRigUnit_AimBone::Secondary' has a wrong offset!");
static_assert(offsetof(FRigUnit_AimBone, bPropagateToChildren) == 0x000090, "Member 'FRigUnit_AimBone::bPropagateToChildren' has a wrong offset!");
static_assert(offsetof(FRigUnit_AimBone, DebugSettings) == 0x0000A0, "Member 'FRigUnit_AimBone::DebugSettings' has a wrong offset!");
static_assert(offsetof(FRigUnit_AimBone, BoneIndex) == 0x0000E0, "Member 'FRigUnit_AimBone::BoneIndex' has a wrong offset!");
static_assert(offsetof(FRigUnit_AimBone, PrimaryCachedSpaceName) == 0x0000E4, "Member 'FRigUnit_AimBone::PrimaryCachedSpaceName' has a wrong offset!");
static_assert(offsetof(FRigUnit_AimBone, PrimaryCachedSpaceIndex) == 0x0000EC, "Member 'FRigUnit_AimBone::PrimaryCachedSpaceIndex' has a wrong offset!");
static_assert(offsetof(FRigUnit_AimBone, SecondaryCachedSpaceName) == 0x0000F0, "Member 'FRigUnit_AimBone::SecondaryCachedSpaceName' has a wrong offset!");
static_assert(offsetof(FRigUnit_AimBone, SecondaryCachedSpaceIndex) == 0x0000F8, "Member 'FRigUnit_AimBone::SecondaryCachedSpaceIndex' has a wrong offset!");

// ScriptStruct ControlRig.RigHierarchy
// 0x0060 (0x0060 - 0x0000)
struct FRigHierarchy final
{
public:
	TArray<struct FRigBone>                       Bones;                                             // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class FName, int32>                      NameToIndexMapping;                                // 0x0010(0x0050)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRigHierarchy) == 0x000008, "Wrong alignment on FRigHierarchy");
static_assert(sizeof(FRigHierarchy) == 0x000060, "Wrong size on FRigHierarchy");
static_assert(offsetof(FRigHierarchy, Bones) == 0x000000, "Member 'FRigHierarchy::Bones' has a wrong offset!");
static_assert(offsetof(FRigHierarchy, NameToIndexMapping) == 0x000010, "Member 'FRigHierarchy::NameToIndexMapping' has a wrong offset!");

// ScriptStruct ControlRig.RigHierarchyContainer
// 0x00C0 (0x00C0 - 0x0000)
struct FRigHierarchyContainer final
{
public:
	uint8                                         Pad_0[0x60];                                       // 0x0000(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigHierarchy                          BaseHierarchy;                                     // 0x0060(0x0060)(NativeAccessSpecifierPublic)
};
static_assert(alignof(FRigHierarchyContainer) == 0x000008, "Wrong alignment on FRigHierarchyContainer");
static_assert(sizeof(FRigHierarchyContainer) == 0x0000C0, "Wrong size on FRigHierarchyContainer");
static_assert(offsetof(FRigHierarchyContainer, BaseHierarchy) == 0x000060, "Member 'FRigHierarchyContainer::BaseHierarchy' has a wrong offset!");

// ScriptStruct ControlRig.RigUnit_RandomVector
// 0x0030 (0x0050 - 0x0020)
struct FRigUnit_RandomVector final : public FRigUnit_MathBase
{
public:
	int32                                         Seed;                                              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Minimum;                                           // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Maximum;                                           // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Result;                                            // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LastResult;                                        // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LastSeed;                                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeLeft;                                          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRigUnit_RandomVector) == 0x000008, "Wrong alignment on FRigUnit_RandomVector");
static_assert(sizeof(FRigUnit_RandomVector) == 0x000050, "Wrong size on FRigUnit_RandomVector");
static_assert(offsetof(FRigUnit_RandomVector, Seed) == 0x000020, "Member 'FRigUnit_RandomVector::Seed' has a wrong offset!");
static_assert(offsetof(FRigUnit_RandomVector, Minimum) == 0x000024, "Member 'FRigUnit_RandomVector::Minimum' has a wrong offset!");
static_assert(offsetof(FRigUnit_RandomVector, Maximum) == 0x000028, "Member 'FRigUnit_RandomVector::Maximum' has a wrong offset!");
static_assert(offsetof(FRigUnit_RandomVector, Duration) == 0x00002C, "Member 'FRigUnit_RandomVector::Duration' has a wrong offset!");
static_assert(offsetof(FRigUnit_RandomVector, Result) == 0x000030, "Member 'FRigUnit_RandomVector::Result' has a wrong offset!");
static_assert(offsetof(FRigUnit_RandomVector, LastResult) == 0x00003C, "Member 'FRigUnit_RandomVector::LastResult' has a wrong offset!");
static_assert(offsetof(FRigUnit_RandomVector, LastSeed) == 0x000048, "Member 'FRigUnit_RandomVector::LastSeed' has a wrong offset!");
static_assert(offsetof(FRigUnit_RandomVector, TimeLeft) == 0x00004C, "Member 'FRigUnit_RandomVector::TimeLeft' has a wrong offset!");

// ScriptStruct ControlRig.RigUnit_MathVectorBase
// 0x0000 (0x0020 - 0x0020)
struct FRigUnit_MathVectorBase : public FRigUnit_MathBase
{
};
static_assert(alignof(FRigUnit_MathVectorBase) == 0x000008, "Wrong alignment on FRigUnit_MathVectorBase");
static_assert(sizeof(FRigUnit_MathVectorBase) == 0x000020, "Wrong size on FRigUnit_MathVectorBase");

// ScriptStruct ControlRig.RigUnit_MathVectorBinaryOp
// 0x0028 (0x0048 - 0x0020)
struct FRigUnit_MathVectorBinaryOp : public FRigUnit_MathVectorBase
{
public:
	struct FVector                                A;                                                 // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                B;                                                 // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Result;                                            // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRigUnit_MathVectorBinaryOp) == 0x000008, "Wrong alignment on FRigUnit_MathVectorBinaryOp");
static_assert(sizeof(FRigUnit_MathVectorBinaryOp) == 0x000048, "Wrong size on FRigUnit_MathVectorBinaryOp");
static_assert(offsetof(FRigUnit_MathVectorBinaryOp, A) == 0x000020, "Member 'FRigUnit_MathVectorBinaryOp::A' has a wrong offset!");
static_assert(offsetof(FRigUnit_MathVectorBinaryOp, B) == 0x00002C, "Member 'FRigUnit_MathVectorBinaryOp::B' has a wrong offset!");
static_assert(offsetof(FRigUnit_MathVectorBinaryOp, Result) == 0x000038, "Member 'FRigUnit_MathVectorBinaryOp::Result' has a wrong offset!");

// ScriptStruct ControlRig.RigUnit_CCDIK_RotationLimit
// 0x000C (0x000C - 0x0000)
struct FRigUnit_CCDIK_RotationLimit final
{
public:
	class FName                                   Bone;                                              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Limit;                                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRigUnit_CCDIK_RotationLimit) == 0x000004, "Wrong alignment on FRigUnit_CCDIK_RotationLimit");
static_assert(sizeof(FRigUnit_CCDIK_RotationLimit) == 0x00000C, "Wrong size on FRigUnit_CCDIK_RotationLimit");
static_assert(offsetof(FRigUnit_CCDIK_RotationLimit, Bone) == 0x000000, "Member 'FRigUnit_CCDIK_RotationLimit::Bone' has a wrong offset!");
static_assert(offsetof(FRigUnit_CCDIK_RotationLimit, Limit) == 0x000008, "Member 'FRigUnit_CCDIK_RotationLimit::Limit' has a wrong offset!");

// ScriptStruct ControlRig.RigUnit_CCDIK
// 0x00B8 (0x00F0 - 0x0038)
struct FRigUnit_CCDIK final : public FRigUnit_HighlevelBaseMutable
{
public:
	class FName                                   StartBone;                                         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   EffectorBone;                                      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             EffectorTransform;                                 // 0x0050(0x0030)(IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         Precision;                                         // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxIterations;                                     // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStartFromTail;                                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BaseRotationLimit;                                 // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FRigUnit_CCDIK_RotationLimit>   RotationLimits;                                    // 0x0090(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bPropagateToChildren;                              // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A1[0x4F];                                      // 0x00A1(0x004F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRigUnit_CCDIK) == 0x000010, "Wrong alignment on FRigUnit_CCDIK");
static_assert(sizeof(FRigUnit_CCDIK) == 0x0000F0, "Wrong size on FRigUnit_CCDIK");
static_assert(offsetof(FRigUnit_CCDIK, StartBone) == 0x000038, "Member 'FRigUnit_CCDIK::StartBone' has a wrong offset!");
static_assert(offsetof(FRigUnit_CCDIK, EffectorBone) == 0x000040, "Member 'FRigUnit_CCDIK::EffectorBone' has a wrong offset!");
static_assert(offsetof(FRigUnit_CCDIK, EffectorTransform) == 0x000050, "Member 'FRigUnit_CCDIK::EffectorTransform' has a wrong offset!");
static_assert(offsetof(FRigUnit_CCDIK, Precision) == 0x000080, "Member 'FRigUnit_CCDIK::Precision' has a wrong offset!");
static_assert(offsetof(FRigUnit_CCDIK, MaxIterations) == 0x000084, "Member 'FRigUnit_CCDIK::MaxIterations' has a wrong offset!");
static_assert(offsetof(FRigUnit_CCDIK, bStartFromTail) == 0x000088, "Member 'FRigUnit_CCDIK::bStartFromTail' has a wrong offset!");
static_assert(offsetof(FRigUnit_CCDIK, BaseRotationLimit) == 0x00008C, "Member 'FRigUnit_CCDIK::BaseRotationLimit' has a wrong offset!");
static_assert(offsetof(FRigUnit_CCDIK, RotationLimits) == 0x000090, "Member 'FRigUnit_CCDIK::RotationLimits' has a wrong offset!");
static_assert(offsetof(FRigUnit_CCDIK, bPropagateToChildren) == 0x0000A0, "Member 'FRigUnit_CCDIK::bPropagateToChildren' has a wrong offset!");

// ScriptStruct ControlRig.AnimNode_ControlRig
// 0x0160 (0x0220 - 0x00C0)
struct FAnimNode_ControlRig final : public FAnimNode_ControlRigBase
{
public:
	struct FPoseLink                              Source;                                            // 0x00C0(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	TSubclassOf<class UControlRig>                ControlRigClass;                                   // 0x00D0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UControlRig*                            ControlRig;                                        // 0x00D8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<class FName, class FName>                InputMapping;                                      // 0x00E0(0x0050)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TMap<class FName, class FName>                OutputMapping;                                     // 0x0130(0x0050)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_180[0xA0];                                     // 0x0180(0x00A0)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAnimNode_ControlRig) == 0x000008, "Wrong alignment on FAnimNode_ControlRig");
static_assert(sizeof(FAnimNode_ControlRig) == 0x000220, "Wrong size on FAnimNode_ControlRig");
static_assert(offsetof(FAnimNode_ControlRig, Source) == 0x0000C0, "Member 'FAnimNode_ControlRig::Source' has a wrong offset!");
static_assert(offsetof(FAnimNode_ControlRig, ControlRigClass) == 0x0000D0, "Member 'FAnimNode_ControlRig::ControlRigClass' has a wrong offset!");
static_assert(offsetof(FAnimNode_ControlRig, ControlRig) == 0x0000D8, "Member 'FAnimNode_ControlRig::ControlRig' has a wrong offset!");
static_assert(offsetof(FAnimNode_ControlRig, InputMapping) == 0x0000E0, "Member 'FAnimNode_ControlRig::InputMapping' has a wrong offset!");
static_assert(offsetof(FAnimNode_ControlRig, OutputMapping) == 0x000130, "Member 'FAnimNode_ControlRig::OutputMapping' has a wrong offset!");

// ScriptStruct ControlRig.RigUnit_QuaternionToAxisAndAngle
// 0x0020 (0x0040 - 0x0020)
struct FRigUnit_QuaternionToAxisAndAngle final : public FRigUnit
{
public:
	struct FQuat                                  Argument;                                          // 0x0020(0x0010)(IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                Axis;                                              // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Angle;                                             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRigUnit_QuaternionToAxisAndAngle) == 0x000010, "Wrong alignment on FRigUnit_QuaternionToAxisAndAngle");
static_assert(sizeof(FRigUnit_QuaternionToAxisAndAngle) == 0x000040, "Wrong size on FRigUnit_QuaternionToAxisAndAngle");
static_assert(offsetof(FRigUnit_QuaternionToAxisAndAngle, Argument) == 0x000020, "Member 'FRigUnit_QuaternionToAxisAndAngle::Argument' has a wrong offset!");
static_assert(offsetof(FRigUnit_QuaternionToAxisAndAngle, Axis) == 0x000030, "Member 'FRigUnit_QuaternionToAxisAndAngle::Axis' has a wrong offset!");
static_assert(offsetof(FRigUnit_QuaternionToAxisAndAngle, Angle) == 0x00003C, "Member 'FRigUnit_QuaternionToAxisAndAngle::Angle' has a wrong offset!");

// ScriptStruct ControlRig.RigUnit_MathFloatSign
// 0x0000 (0x0028 - 0x0028)
struct FRigUnit_MathFloatSign final : public FRigUnit_MathFloatUnaryOp
{
};
static_assert(alignof(FRigUnit_MathFloatSign) == 0x000008, "Wrong alignment on FRigUnit_MathFloatSign");
static_assert(sizeof(FRigUnit_MathFloatSign) == 0x000028, "Wrong size on FRigUnit_MathFloatSign");

// ScriptStruct ControlRig.CRSimPoint
// 0x0028 (0x0028 - 0x0000)
struct FCRSimPoint final
{
public:
	float                                         Mass;                                              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Size;                                              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LinearDamping;                                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InheritMotion;                                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Position;                                          // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LinearVelocity;                                    // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCRSimPoint) == 0x000004, "Wrong alignment on FCRSimPoint");
static_assert(sizeof(FCRSimPoint) == 0x000028, "Wrong size on FCRSimPoint");
static_assert(offsetof(FCRSimPoint, Mass) == 0x000000, "Member 'FCRSimPoint::Mass' has a wrong offset!");
static_assert(offsetof(FCRSimPoint, Size) == 0x000004, "Member 'FCRSimPoint::Size' has a wrong offset!");
static_assert(offsetof(FCRSimPoint, LinearDamping) == 0x000008, "Member 'FCRSimPoint::LinearDamping' has a wrong offset!");
static_assert(offsetof(FCRSimPoint, InheritMotion) == 0x00000C, "Member 'FCRSimPoint::InheritMotion' has a wrong offset!");
static_assert(offsetof(FCRSimPoint, Position) == 0x000010, "Member 'FCRSimPoint::Position' has a wrong offset!");
static_assert(offsetof(FCRSimPoint, LinearVelocity) == 0x00001C, "Member 'FCRSimPoint::LinearVelocity' has a wrong offset!");

// ScriptStruct ControlRig.ControlRigBindingTemplate
// 0x0000 (0x00B0 - 0x00B0)
struct FControlRigBindingTemplate final : public FMovieSceneSpawnSectionTemplate
{
};
static_assert(alignof(FControlRigBindingTemplate) == 0x000008, "Wrong alignment on FControlRigBindingTemplate");
static_assert(sizeof(FControlRigBindingTemplate) == 0x0000B0, "Wrong size on FControlRigBindingTemplate");

// ScriptStruct ControlRig.ControlRigComponentInstanceData
// 0x0008 (0x0060 - 0x0058)
struct FControlRigComponentInstanceData final : public FActorComponentInstanceData
{
public:
	class UControlRig*                            AnimControlRig;                                    // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FControlRigComponentInstanceData) == 0x000008, "Wrong alignment on FControlRigComponentInstanceData");
static_assert(sizeof(FControlRigComponentInstanceData) == 0x000060, "Wrong size on FControlRigComponentInstanceData");
static_assert(offsetof(FControlRigComponentInstanceData, AnimControlRig) == 0x000058, "Member 'FControlRigComponentInstanceData::AnimControlRig' has a wrong offset!");

// ScriptStruct ControlRig.ControlRigOperator
// 0x0078 (0x0078 - 0x0000)
struct FControlRigOperator final
{
public:
	EControlRigOpCode                             OpCode;                                            // 0x0000(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PropertyPath1;                                     // 0x0008(0x0010)(ZeroConstructor, Deprecated, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PropertyPath2;                                     // 0x0018(0x0010)(ZeroConstructor, Deprecated, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCachedPropertyPath                    CachedPropertyPath1;                               // 0x0028(0x0028)(Edit, EditConst, NativeAccessSpecifierPublic)
	struct FCachedPropertyPath                    CachedPropertyPath2;                               // 0x0050(0x0028)(Edit, EditConst, NativeAccessSpecifierPublic)
};
static_assert(alignof(FControlRigOperator) == 0x000008, "Wrong alignment on FControlRigOperator");
static_assert(sizeof(FControlRigOperator) == 0x000078, "Wrong size on FControlRigOperator");
static_assert(offsetof(FControlRigOperator, OpCode) == 0x000000, "Member 'FControlRigOperator::OpCode' has a wrong offset!");
static_assert(offsetof(FControlRigOperator, PropertyPath1) == 0x000008, "Member 'FControlRigOperator::PropertyPath1' has a wrong offset!");
static_assert(offsetof(FControlRigOperator, PropertyPath2) == 0x000018, "Member 'FControlRigOperator::PropertyPath2' has a wrong offset!");
static_assert(offsetof(FControlRigOperator, CachedPropertyPath1) == 0x000028, "Member 'FControlRigOperator::CachedPropertyPath1' has a wrong offset!");
static_assert(offsetof(FControlRigOperator, CachedPropertyPath2) == 0x000050, "Member 'FControlRigOperator::CachedPropertyPath2' has a wrong offset!");

// ScriptStruct ControlRig.RigUnit_MathVectorMul
// 0x0000 (0x0048 - 0x0048)
struct FRigUnit_MathVectorMul final : public FRigUnit_MathVectorBinaryOp
{
};
static_assert(alignof(FRigUnit_MathVectorMul) == 0x000008, "Wrong alignment on FRigUnit_MathVectorMul");
static_assert(sizeof(FRigUnit_MathVectorMul) == 0x000048, "Wrong size on FRigUnit_MathVectorMul");

// ScriptStruct ControlRig.RigUnit_AccumulateFloatLerp
// 0x0018 (0x0038 - 0x0020)
struct FRigUnit_AccumulateFloatLerp final : public FRigUnit_SimBase
{
public:
	float                                         TargetValue;                                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InitialValue;                                      // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Blend;                                             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIntegrateDeltaTime;                               // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Result;                                            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AccumulatedValue;                                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRigUnit_AccumulateFloatLerp) == 0x000008, "Wrong alignment on FRigUnit_AccumulateFloatLerp");
