#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EpicCMSUIFramework

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum EpicCMSUIFramework.EDateType
// NumValues: 0x0004
enum class EDateType : uint8
{
	None                                     = 0,
	Coming                                   = 1,
	Ending                                   = 2,
	EDateType_MAX                            = 3,
};

// ScriptStruct EpicCMSUIFramework.EpicCMSLayoutTypeMapping
// 0x0028 (0x0030 - 0x0008)
struct FEpicCMSLayoutTypeMapping final : public FTableRowBase
{
public:
	TSoftClassPtr<class UClass>                   LayoutType;                                        // 0x0008(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FEpicCMSLayoutTypeMapping) == 0x000008, "Wrong alignment on FEpicCMSLayoutTypeMapping");
static_assert(sizeof(FEpicCMSLayoutTypeMapping) == 0x000030, "Wrong size on FEpicCMSLayoutTypeMapping");
static_assert(offsetof(FEpicCMSLayoutTypeMapping, LayoutType) == 0x000008, "Member 'FEpicCMSLayoutTypeMapping::LayoutType' has a wrong offset!");

// ScriptStruct EpicCMSUIFramework.SlotDescription
// 0x0014 (0x0014 - 0x0000)
struct FSlotDescription final
{
public:
	class FName                                   SlotName;                                          // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ColumnCount;                                       // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RowCount;                                          // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseFeaturedTextStyle;                             // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableAutoScroll;                                 // 0x0011(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSlotDescription) == 0x000004, "Wrong alignment on FSlotDescription");
static_assert(sizeof(FSlotDescription) == 0x000014, "Wrong size on FSlotDescription");
static_assert(offsetof(FSlotDescription, SlotName) == 0x000000, "Member 'FSlotDescription::SlotName' has a wrong offset!");
static_assert(offsetof(FSlotDescription, ColumnCount) == 0x000008, "Member 'FSlotDescription::ColumnCount' has a wrong offset!");
static_assert(offsetof(FSlotDescription, RowCount) == 0x00000C, "Member 'FSlotDescription::RowCount' has a wrong offset!");
static_assert(offsetof(FSlotDescription, bUseFeaturedTextStyle) == 0x000010, "Member 'FSlotDescription::bUseFeaturedTextStyle' has a wrong offset!");
static_assert(offsetof(FSlotDescription, bEnableAutoScroll) == 0x000011, "Member 'FSlotDescription::bEnableAutoScroll' has a wrong offset!");

// ScriptStruct EpicCMSUIFramework.EpicCMSTileTypeMapping
// 0x0028 (0x0030 - 0x0008)
struct FEpicCMSTileTypeMapping final : public FTableRowBase
{
public:
	TSoftClassPtr<class UClass>                   TileClass;                                         // 0x0008(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FEpicCMSTileTypeMapping) == 0x000008, "Wrong alignment on FEpicCMSTileTypeMapping");
static_assert(sizeof(FEpicCMSTileTypeMapping) == 0x000030, "Wrong size on FEpicCMSTileTypeMapping");
static_assert(offsetof(FEpicCMSTileTypeMapping, TileClass) == 0x000008, "Member 'FEpicCMSTileTypeMapping::TileClass' has a wrong offset!");

// ScriptStruct EpicCMSUIFramework.TileDefinition
// 0x0088 (0x0088 - 0x0000)
struct FTileDefinition final
{
public:
	class FString                                 TypeString;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Title;                                             // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Subtitle;                                          // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Eyebrow;                                           // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Link;                                              // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GroupID;                                           // 0x0050(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              Countdown;                                         // 0x0060(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDateType                                     CountdownType;                                     // 0x0068(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 MediaUrl;                                          // 0x0070(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsVisible;                                         // 0x0080(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FTileDefinition) == 0x000008, "Wrong alignment on FTileDefinition");
static_assert(sizeof(FTileDefinition) == 0x000088, "Wrong size on FTileDefinition");
static_assert(offsetof(FTileDefinition, TypeString) == 0x000000, "Member 'FTileDefinition::TypeString' has a wrong offset!");
static_assert(offsetof(FTileDefinition, Title) == 0x000010, "Member 'FTileDefinition::Title' has a wrong offset!");
static_assert(offsetof(FTileDefinition, Subtitle) == 0x000020, "Member 'FTileDefinition::Subtitle' has a wrong offset!");
static_assert(offsetof(FTileDefinition, Eyebrow) == 0x000030, "Member 'FTileDefinition::Eyebrow' has a wrong offset!");
static_assert(offsetof(FTileDefinition, Link) == 0x000040, "Member 'FTileDefinition::Link' has a wrong offset!");
static_assert(offsetof(FTileDefinition, GroupID) == 0x000050, "Member 'FTileDefinition::GroupID' has a wrong offset!");
static_assert(offsetof(FTileDefinition, Countdown) == 0x000060, "Member 'FTileDefinition::Countdown' has a wrong offset!");
static_assert(offsetof(FTileDefinition, CountdownType) == 0x000068, "Member 'FTileDefinition::CountdownType' has a wrong offset!");
static_assert(offsetof(FTileDefinition, MediaUrl) == 0x000070, "Member 'FTileDefinition::MediaUrl' has a wrong offset!");
static_assert(offsetof(FTileDefinition, IsVisible) == 0x000080, "Member 'FTileDefinition::IsVisible' has a wrong offset!");

}

