#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortniteUI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Party_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "FortniteUI_structs.hpp"
#include "CommonUI_structs.hpp"
#include "CommonUI_classes.hpp"
#include "CommonInput_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "BlueprintContext_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "SlateCore_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "SocialUMG_structs.hpp"
#include "SocialUMG_classes.hpp"
#include "InputCore_structs.hpp"
#include "EpicCMSUIFramework_classes.hpp"
#include "McpProfileSys_structs.hpp"
#include "GameSubCatalog_structs.hpp"
#include "Slate_structs.hpp"
#include "LauncherSocialTypes_structs.hpp"


namespace SDK
{

// Class FortniteUI.FortGadgetsWidgetBase
// 0x0020 (0x0250 - 0x0230)
class UFortGadgetsWidgetBase final : public UCommonUserWidget
{
public:
	class UFortLazyImage*                         GadgetIcon1;                                       // 0x0230(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortLazyImage*                         GadgetIcon2;                                       // 0x0238(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UFortLazyImage*>                 Gadgets;                                           // 0x0240(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	class UWidget* OnGenerateTooltipWidget(const class FText& Header, const class FText& Description);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGadgetsWidgetBase">();
	}
	static class UFortGadgetsWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGadgetsWidgetBase>();
	}
};
static_assert(alignof(UFortGadgetsWidgetBase) == 0x000008, "Wrong alignment on UFortGadgetsWidgetBase");
static_assert(sizeof(UFortGadgetsWidgetBase) == 0x000250, "Wrong size on UFortGadgetsWidgetBase");
static_assert(offsetof(UFortGadgetsWidgetBase, GadgetIcon1) == 0x000230, "Member 'UFortGadgetsWidgetBase::GadgetIcon1' has a wrong offset!");
static_assert(offsetof(UFortGadgetsWidgetBase, GadgetIcon2) == 0x000238, "Member 'UFortGadgetsWidgetBase::GadgetIcon2' has a wrong offset!");
static_assert(offsetof(UFortGadgetsWidgetBase, Gadgets) == 0x000240, "Member 'UFortGadgetsWidgetBase::Gadgets' has a wrong offset!");

// Class FortniteUI.AthenaChallengeScreenTileBase
// 0x0018 (0x0B58 - 0x0B40)
class UAthenaChallengeScreenTileBase : public UCommonButton
{
public:
	class UCommonTextBlock*                       Text_ChallengeName;                                // 0x0B40(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortLazyImage*                         LazyImage_RewardPreview;                           // 0x0B48(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B50[0x8];                                      // 0x0B50(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnChallengeSetEstablished(const struct FFortChallengeSetStyle& DisplayStyle, bool bIsComplete, bool bIsLocked);
	void OnContainsPartyAssistedChallengeChanged(bool bHasPartyAssistedChallenge);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaChallengeScreenTileBase">();
	}
	static class UAthenaChallengeScreenTileBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaChallengeScreenTileBase>();
	}
};
static_assert(alignof(UAthenaChallengeScreenTileBase) == 0x000008, "Wrong alignment on UAthenaChallengeScreenTileBase");
static_assert(sizeof(UAthenaChallengeScreenTileBase) == 0x000B58, "Wrong size on UAthenaChallengeScreenTileBase");
static_assert(offsetof(UAthenaChallengeScreenTileBase, Text_ChallengeName) == 0x000B40, "Member 'UAthenaChallengeScreenTileBase::Text_ChallengeName' has a wrong offset!");
static_assert(offsetof(UAthenaChallengeScreenTileBase, LazyImage_RewardPreview) == 0x000B48, "Member 'UAthenaChallengeScreenTileBase::LazyImage_RewardPreview' has a wrong offset!");

// Class FortniteUI.AthenaChallengeSetTile
// 0x0030 (0x0B88 - 0x0B58)
class UAthenaChallengeSetTile : public UAthenaChallengeScreenTileBase
{
public:
	uint8                                         Pad_B58[0x10];                                     // 0x0B58(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaChallengeProgressBar*            ChallengeProgress_QuestsCompleted;                 // 0x0B68(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ChallengeContext;                             // 0x0B70(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortLazyImage*                         LazyImage_CustomBackground;                        // 0x0B78(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   RichText_UnavailableReason;                        // 0x0B80(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaChallengeSetTile">();
	}
	static class UAthenaChallengeSetTile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaChallengeSetTile>();
	}
};
static_assert(alignof(UAthenaChallengeSetTile) == 0x000008, "Wrong alignment on UAthenaChallengeSetTile");
static_assert(sizeof(UAthenaChallengeSetTile) == 0x000B88, "Wrong size on UAthenaChallengeSetTile");
static_assert(offsetof(UAthenaChallengeSetTile, ChallengeProgress_QuestsCompleted) == 0x000B68, "Member 'UAthenaChallengeSetTile::ChallengeProgress_QuestsCompleted' has a wrong offset!");
static_assert(offsetof(UAthenaChallengeSetTile, Text_ChallengeContext) == 0x000B70, "Member 'UAthenaChallengeSetTile::Text_ChallengeContext' has a wrong offset!");
static_assert(offsetof(UAthenaChallengeSetTile, LazyImage_CustomBackground) == 0x000B78, "Member 'UAthenaChallengeSetTile::LazyImage_CustomBackground' has a wrong offset!");
static_assert(offsetof(UAthenaChallengeSetTile, RichText_UnavailableReason) == 0x000B80, "Member 'UAthenaChallengeSetTile::RichText_UnavailableReason' has a wrong offset!");

// Class FortniteUI.FortHUDElementWidget
// 0x0030 (0x0260 - 0x0230)
class UFortHUDElementWidget : public UCommonUserWidget
{
public:
	struct FGameplayTag                           ElementTag;                                        // 0x0230(0x0008)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  HUDElementTag;                                     // 0x0238(0x0020)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	ESlateVisibility                              HiddenVisibility;                                  // 0x0258(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleOnHUDElementVisibilityChanged(const struct FGameplayTagContainer& HiddenHUDElementTags);
	void HandleOnHUDResetToDefaults();
	void OnVisibilitySetEvent(ESlateVisibility InVisibility);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortHUDElementWidget">();
	}
	static class UFortHUDElementWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortHUDElementWidget>();
	}
};
static_assert(alignof(UFortHUDElementWidget) == 0x000008, "Wrong alignment on UFortHUDElementWidget");
static_assert(sizeof(UFortHUDElementWidget) == 0x000260, "Wrong size on UFortHUDElementWidget");
static_assert(offsetof(UFortHUDElementWidget, ElementTag) == 0x000230, "Member 'UFortHUDElementWidget::ElementTag' has a wrong offset!");
static_assert(offsetof(UFortHUDElementWidget, HUDElementTag) == 0x000238, "Member 'UFortHUDElementWidget::HUDElementTag' has a wrong offset!");
static_assert(offsetof(UFortHUDElementWidget, HiddenVisibility) == 0x000258, "Member 'UFortHUDElementWidget::HiddenVisibility' has a wrong offset!");

// Class FortniteUI.FortPlatformIcon
// 0x00D8 (0x01D8 - 0x0100)
class UFortPlatformIcon final : public UWidget
{
public:
	bool                                          bCollapseIfNotCrossplay;                           // 0x0100(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              DesiredSize;                                       // 0x0104(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            TintColor;                                         // 0x0110(0x0028)(Edit, NativeAccessSpecifierPrivate)
	struct FSlateBrush                            IconBrush;                                         // 0x0138(0x0088)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1C0[0x18];                                     // 0x01C0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlatformIcon">();
	}
	static class UFortPlatformIcon* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlatformIcon>();
	}
};
static_assert(alignof(UFortPlatformIcon) == 0x000008, "Wrong alignment on UFortPlatformIcon");
static_assert(sizeof(UFortPlatformIcon) == 0x0001D8, "Wrong size on UFortPlatformIcon");
static_assert(offsetof(UFortPlatformIcon, bCollapseIfNotCrossplay) == 0x000100, "Member 'UFortPlatformIcon::bCollapseIfNotCrossplay' has a wrong offset!");
static_assert(offsetof(UFortPlatformIcon, DesiredSize) == 0x000104, "Member 'UFortPlatformIcon::DesiredSize' has a wrong offset!");
static_assert(offsetof(UFortPlatformIcon, TintColor) == 0x000110, "Member 'UFortPlatformIcon::TintColor' has a wrong offset!");
static_assert(offsetof(UFortPlatformIcon, IconBrush) == 0x000138, "Member 'UFortPlatformIcon::IconBrush' has a wrong offset!");

// Class FortniteUI.LTMWidgetBase
// 0x0010 (0x0270 - 0x0260)
class ULTMWidgetBase : public UFortHUDElementWidget
{
public:
	TSubclassOf<class AFortGameplayMutator>       MutatorClassToWaitFor;                             // 0x0260(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_268[0x8];                                      // 0x0268(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnGamePhaseChanged(EAthenaGamePhase NewPhase);
	void OnHandleSpectatingChanged(class AFortPlayerStateZone* SpectatingTarget);

	uint8 GetViewingTeam() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LTMWidgetBase">();
	}
	static class ULTMWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULTMWidgetBase>();
	}
};
static_assert(alignof(ULTMWidgetBase) == 0x000008, "Wrong alignment on ULTMWidgetBase");
static_assert(sizeof(ULTMWidgetBase) == 0x000270, "Wrong size on ULTMWidgetBase");
static_assert(offsetof(ULTMWidgetBase, MutatorClassToWaitFor) == 0x000260, "Member 'ULTMWidgetBase::MutatorClassToWaitFor' has a wrong offset!");

// Class FortniteUI.FortActivatablePanel
// 0x0028 (0x0340 - 0x0318)
class UFortActivatablePanel : public UCommonActivatablePanel
{
public:
	bool                                          bIsPushedOnToContentPanelStack;                    // 0x0318(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAlreadyOnContentPanelStack;                     // 0x0319(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputPriority                                InputPriority;                                     // 0x031A(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsClosableByPlayerInput;                          // 0x031B(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31C[0x24];                                     // 0x031C(0x0024)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AsyncPlaySound2D(const class UObject* WorldContextObject, TSoftObjectPtr<class USoundBase> SoundToLoad, float VolumeMultiplier, float PitchMultiplier, float StartTime);
	void RestoreCenterWidget(class UWidget* FallbackWidget);
	void RestoreScrollWidget(class UWidget* FallbackWidget);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivatablePanel">();
	}
	static class UFortActivatablePanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivatablePanel>();
	}
};
static_assert(alignof(UFortActivatablePanel) == 0x000008, "Wrong alignment on UFortActivatablePanel");
static_assert(sizeof(UFortActivatablePanel) == 0x000340, "Wrong size on UFortActivatablePanel");
static_assert(offsetof(UFortActivatablePanel, bIsPushedOnToContentPanelStack) == 0x000318, "Member 'UFortActivatablePanel::bIsPushedOnToContentPanelStack' has a wrong offset!");
static_assert(offsetof(UFortActivatablePanel, bIsAlreadyOnContentPanelStack) == 0x000319, "Member 'UFortActivatablePanel::bIsAlreadyOnContentPanelStack' has a wrong offset!");
static_assert(offsetof(UFortActivatablePanel, InputPriority) == 0x00031A, "Member 'UFortActivatablePanel::InputPriority' has a wrong offset!");
static_assert(offsetof(UFortActivatablePanel, bIsClosableByPlayerInput) == 0x00031B, "Member 'UFortActivatablePanel::bIsClosableByPlayerInput' has a wrong offset!");

// Class FortniteUI.FortActivatablePanelWithItemPreview
// 0x0128 (0x0468 - 0x0340)
class UFortActivatablePanelWithItemPreview : public UFortActivatablePanel
{
public:
	uint8                                         Pad_340[0x8];                                      // 0x0340(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemView*                          ItemViewObject;                                    // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    ItemViewUnifiedSupportsCameraControlInputAction;   // 0x0350(0x0010)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    ItemViewUnifiedZoomInputAction;                    // 0x0360(0x0010)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    ItemViewZoomOutInputAction;                        // 0x0370(0x0010)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    ItemViewZoomInInputAction;                         // 0x0380(0x0010)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    ItemViewRotateInputAction;                         // 0x0390(0x0010)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_3A0[0x94];                                     // 0x03A0(0x0094)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          AllowItemRotation;                                 // 0x0434(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          AllowItemZooming;                                  // 0x0435(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          AutomaticallyRegisterCameraView;                   // 0x0436(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_437[0x1];                                      // 0x0437(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             ActionDataTable;                                   // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                       AnimationToHideItemInfo;                           // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAutoShowDetails;                                  // 0x0448(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bItemDetailsHidden;                                // 0x0449(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_44A[0x2];                                      // 0x044A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HideItemInfoHeaderDurationSecs;                    // 0x044C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_450[0x18];                                     // 0x0450(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UWidget* GetWidgetForFramingViewedItem();
	void HideItemDetails();
	void OnCosmeticSpecialActionPressed_0(bool* bPassThrough);
	void OnCosmeticSpecialActionPressed_1(bool* bPassThrough);
	void OnCosmeticSpecialActionPressed_2(bool* bPassThrough);
	void OnCosmeticSpecialActionPressed_3(bool* bPassThrough);
	void OnCosmeticSpecialActionPressed_4(bool* bPassThrough);
	void OnCosmeticSpecialActionPressed_5(bool* bPassThrough);
	void OnCosmeticSpecialActionPressed_6(bool* bPassThrough);
	void OnCosmeticSpecialActionPressed_7(bool* bPassThrough);
	void OnItemPreviewChanged(class AActor* NewPrefab, class UFortItem* NewItem);
	void OnVaultItemsViewed(const TArray<class UFortItem*>& Items);
	void ShowItemDetails();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivatablePanelWithItemPreview">();
	}
	static class UFortActivatablePanelWithItemPreview* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivatablePanelWithItemPreview>();
	}
};
static_assert(alignof(UFortActivatablePanelWithItemPreview) == 0x000008, "Wrong alignment on UFortActivatablePanelWithItemPreview");
static_assert(sizeof(UFortActivatablePanelWithItemPreview) == 0x000468, "Wrong size on UFortActivatablePanelWithItemPreview");
static_assert(offsetof(UFortActivatablePanelWithItemPreview, ItemViewObject) == 0x000348, "Member 'UFortActivatablePanelWithItemPreview::ItemViewObject' has a wrong offset!");
static_assert(offsetof(UFortActivatablePanelWithItemPreview, ItemViewUnifiedSupportsCameraControlInputAction) == 0x000350, "Member 'UFortActivatablePanelWithItemPreview::ItemViewUnifiedSupportsCameraControlInputAction' has a wrong offset!");
static_assert(offsetof(UFortActivatablePanelWithItemPreview, ItemViewUnifiedZoomInputAction) == 0x000360, "Member 'UFortActivatablePanelWithItemPreview::ItemViewUnifiedZoomInputAction' has a wrong offset!");
static_assert(offsetof(UFortActivatablePanelWithItemPreview, ItemViewZoomOutInputAction) == 0x000370, "Member 'UFortActivatablePanelWithItemPreview::ItemViewZoomOutInputAction' has a wrong offset!");
static_assert(offsetof(UFortActivatablePanelWithItemPreview, ItemViewZoomInInputAction) == 0x000380, "Member 'UFortActivatablePanelWithItemPreview::ItemViewZoomInInputAction' has a wrong offset!");
static_assert(offsetof(UFortActivatablePanelWithItemPreview, ItemViewRotateInputAction) == 0x000390, "Member 'UFortActivatablePanelWithItemPreview::ItemViewRotateInputAction' has a wrong offset!");
static_assert(offsetof(UFortActivatablePanelWithItemPreview, AllowItemRotation) == 0x000434, "Member 'UFortActivatablePanelWithItemPreview::AllowItemRotation' has a wrong offset!");
static_assert(offsetof(UFortActivatablePanelWithItemPreview, AllowItemZooming) == 0x000435, "Member 'UFortActivatablePanelWithItemPreview::AllowItemZooming' has a wrong offset!");
static_assert(offsetof(UFortActivatablePanelWithItemPreview, AutomaticallyRegisterCameraView) == 0x000436, "Member 'UFortActivatablePanelWithItemPreview::AutomaticallyRegisterCameraView' has a wrong offset!");
static_assert(offsetof(UFortActivatablePanelWithItemPreview, ActionDataTable) == 0x000438, "Member 'UFortActivatablePanelWithItemPreview::ActionDataTable' has a wrong offset!");
static_assert(offsetof(UFortActivatablePanelWithItemPreview, AnimationToHideItemInfo) == 0x000440, "Member 'UFortActivatablePanelWithItemPreview::AnimationToHideItemInfo' has a wrong offset!");
static_assert(offsetof(UFortActivatablePanelWithItemPreview, bAutoShowDetails) == 0x000448, "Member 'UFortActivatablePanelWithItemPreview::bAutoShowDetails' has a wrong offset!");
static_assert(offsetof(UFortActivatablePanelWithItemPreview, bItemDetailsHidden) == 0x000449, "Member 'UFortActivatablePanelWithItemPreview::bItemDetailsHidden' has a wrong offset!");
static_assert(offsetof(UFortActivatablePanelWithItemPreview, HideItemInfoHeaderDurationSecs) == 0x00044C, "Member 'UFortActivatablePanelWithItemPreview::HideItemInfoHeaderDurationSecs' has a wrong offset!");

// Class FortniteUI.AthenaChallengeSetBaseDetails
// 0x0020 (0x0488 - 0x0468)
class UAthenaChallengeSetBaseDetails : public UFortActivatablePanelWithItemPreview
{
public:
	uint8                                         Pad_468[0x20];                                     // 0x0468(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaChallengeSetBaseDetails">();
	}
	static class UAthenaChallengeSetBaseDetails* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaChallengeSetBaseDetails>();
	}
};
static_assert(alignof(UAthenaChallengeSetBaseDetails) == 0x000008, "Wrong alignment on UAthenaChallengeSetBaseDetails");
static_assert(sizeof(UAthenaChallengeSetBaseDetails) == 0x000488, "Wrong size on UAthenaChallengeSetBaseDetails");

// Class FortniteUI.AthenaChallengeSetImageGrid
// 0x0080 (0x0508 - 0x0488)
class UAthenaChallengeSetImageGrid final : public UAthenaChallengeSetBaseDetails
{
public:
	uint8                                         Pad_488[0x30];                                     // 0x0488(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       Text_ChallengeContext;                             // 0x04B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ChallengeSetName;                             // 0x04C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeProgressBar*            ChallengeProgress_Completion;                      // 0x04C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeCountdownDisplay*       Countdown_TimeRemaining;                           // 0x04D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortSwipePanel*                        SwipePanel_ChangeSet;                              // 0x04D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeListEntry_CompletionReward* CompletionReward_Entry;                            // 0x04E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeSetListView*            ChallengeDetail_List;                              // 0x04E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeDetailImageGrid*        ChallengeDetail_ImageGrid;                         // 0x04F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                          Button_PreviousSet;                                // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                          Button_NextSet;                                    // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void ApplyNextSort();
	void OnChallengeSetEstablished(const struct FFortChallengeSetStyle& DisplayStyle, bool bIsComplete);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaChallengeSetImageGrid">();
	}
	static class UAthenaChallengeSetImageGrid* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaChallengeSetImageGrid>();
	}
};
static_assert(alignof(UAthenaChallengeSetImageGrid) == 0x000008, "Wrong alignment on UAthenaChallengeSetImageGrid");
static_assert(sizeof(UAthenaChallengeSetImageGrid) == 0x000508, "Wrong size on UAthenaChallengeSetImageGrid");
static_assert(offsetof(UAthenaChallengeSetImageGrid, Text_ChallengeContext) == 0x0004B8, "Member 'UAthenaChallengeSetImageGrid::Text_ChallengeContext' has a wrong offset!");
static_assert(offsetof(UAthenaChallengeSetImageGrid, Text_ChallengeSetName) == 0x0004C0, "Member 'UAthenaChallengeSetImageGrid::Text_ChallengeSetName' has a wrong offset!");
static_assert(offsetof(UAthenaChallengeSetImageGrid, ChallengeProgress_Completion) == 0x0004C8, "Member 'UAthenaChallengeSetImageGrid::ChallengeProgress_Completion' has a wrong offset!");
static_assert(offsetof(UAthenaChallengeSetImageGrid, Countdown_TimeRemaining) == 0x0004D0, "Member 'UAthenaChallengeSetImageGrid::Countdown_TimeRemaining' has a wrong offset!");
static_assert(offsetof(UAthenaChallengeSetImageGrid, SwipePanel_ChangeSet) == 0x0004D8, "Member 'UAthenaChallengeSetImageGrid::SwipePanel_ChangeSet' has a wrong offset!");
static_assert(offsetof(UAthenaChallengeSetImageGrid, CompletionReward_Entry) == 0x0004E0, "Member 'UAthenaChallengeSetImageGrid::CompletionReward_Entry' has a wrong offset!");
static_assert(offsetof(UAthenaChallengeSetImageGrid, ChallengeDetail_List) == 0x0004E8, "Member 'UAthenaChallengeSetImageGrid::ChallengeDetail_List' has a wrong offset!");
static_assert(offsetof(UAthenaChallengeSetImageGrid, ChallengeDetail_ImageGrid) == 0x0004F0, "Member 'UAthenaChallengeSetImageGrid::ChallengeDetail_ImageGrid' has a wrong offset!");
static_assert(offsetof(UAthenaChallengeSetImageGrid, Button_PreviousSet) == 0x0004F8, "Member 'UAthenaChallengeSetImageGrid::Button_PreviousSet' has a wrong offset!");
static_assert(offsetof(UAthenaChallengeSetImageGrid, Button_NextSet) == 0x000500, "Member 'UAthenaChallengeSetImageGrid::Button_NextSet' has a wrong offset!");

// Class FortniteUI.FortUIStateTrigger
// 0x0008 (0x0030 - 0x0028)
class UFortUIStateTrigger : public UObject
{
public:
	EFortUIState                                  UIState;                                           // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortUIStateTrigger">();
	}
	static class UFortUIStateTrigger* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortUIStateTrigger>();
	}
};
static_assert(alignof(UFortUIStateTrigger) == 0x000008, "Wrong alignment on UFortUIStateTrigger");
static_assert(sizeof(UFortUIStateTrigger) == 0x000030, "Wrong size on UFortUIStateTrigger");
static_assert(offsetof(UFortUIStateTrigger, UIState) == 0x000028, "Member 'UFortUIStateTrigger::UIState' has a wrong offset!");

// Class FortniteUI.FortUIStateTrigger_AthenaSpectator
// 0x0000 (0x0030 - 0x0030)
class UFortUIStateTrigger_AthenaSpectator final : public UFortUIStateTrigger
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortUIStateTrigger_AthenaSpectator">();
	}
	static class UFortUIStateTrigger_AthenaSpectator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortUIStateTrigger_AthenaSpectator>();
	}
};
static_assert(alignof(UFortUIStateTrigger_AthenaSpectator) == 0x000008, "Wrong alignment on UFortUIStateTrigger_AthenaSpectator");
static_assert(sizeof(UFortUIStateTrigger_AthenaSpectator) == 0x000030, "Wrong size on UFortUIStateTrigger_AthenaSpectator");

// Class FortniteUI.AshtonWidgetBase
// 0x0018 (0x0288 - 0x0270)
class UAshtonWidgetBase final : public ULTMWidgetBase
{
public:
	class AFortAthenaMutator_Ashton*              AshtonMutatorRef;                                  // 0x0270(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_278[0x10];                                     // 0x0278(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCloseWidget();
	void OnOpenWidget();
	void OnStoneChanged(EAshtonStoneType StoneType, EAshtonStoneStateType StoneState);
	void OnStoneListChanged();
	void OnVillainRespawnCountChanged(int32 NumRespawnsLeft, float RespawnPercentLeft);
	void OnVillainRespawnsRemainingChanged();
	void UpdateAllUI(bool bFirstUpdate);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AshtonWidgetBase">();
	}
	static class UAshtonWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAshtonWidgetBase>();
	}
};
static_assert(alignof(UAshtonWidgetBase) == 0x000008, "Wrong alignment on UAshtonWidgetBase");
static_assert(sizeof(UAshtonWidgetBase) == 0x000288, "Wrong size on UAshtonWidgetBase");
static_assert(offsetof(UAshtonWidgetBase, AshtonMutatorRef) == 0x000270, "Member 'UAshtonWidgetBase::AshtonMutatorRef' has a wrong offset!");

// Class FortniteUI.AsyncAction_FortPlayerSurveyDispatcherDisplaySurveys
// 0x0020 (0x0050 - 0x0030)
class UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys final : public UBlueprintAsyncActionBase
{
public:
	UMulticastInlineDelegateProperty_             Finished;                                          // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UFortPlayerSurveyDispatcher*            Dispatcher;                                        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys* DisplaySurveys(class UFortPlayerSurveyDispatcher* Param_Dispatcher, int32 SurveyCount);

	void HandleAllSurveysFinished(class UObject* Source);
	void OnAllSurveysFinishedDelegate__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AsyncAction_FortPlayerSurveyDispatcherDisplaySurveys">();
	}
	static class UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys>();
	}
};
static_assert(alignof(UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys) == 0x000008, "Wrong alignment on UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys");
static_assert(sizeof(UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys) == 0x000050, "Wrong size on UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys");
static_assert(offsetof(UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys, Finished) == 0x000030, "Member 'UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys::Finished' has a wrong offset!");
static_assert(offsetof(UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys, Dispatcher) == 0x000040, "Member 'UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys::Dispatcher' has a wrong offset!");

// Class FortniteUI.AthenaChallengeProgressBar
// 0x0010 (0x0238 - 0x0228)
class UAthenaChallengeProgressBar final : public UUserWidget
{
public:
	class UProgressBar*                           ProgressBar_StepsCompleted;                        // 0x0228(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   RichText_Progress;                                 // 0x0230(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaChallengeProgressBar">();
	}
	static class UAthenaChallengeProgressBar* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaChallengeProgressBar>();
	}
};
static_assert(alignof(UAthenaChallengeProgressBar) == 0x000008, "Wrong alignment on UAthenaChallengeProgressBar");
static_assert(sizeof(UAthenaChallengeProgressBar) == 0x000238, "Wrong size on UAthenaChallengeProgressBar");
static_assert(offsetof(UAthenaChallengeProgressBar, ProgressBar_StepsCompleted) == 0x000228, "Member 'UAthenaChallengeProgressBar::ProgressBar_StepsCompleted' has a wrong offset!");
static_assert(offsetof(UAthenaChallengeProgressBar, RichText_Progress) == 0x000230, "Member 'UAthenaChallengeProgressBar::RichText_Progress' has a wrong offset!");

// Class FortniteUI.AthenaAccountContext
// 0x0000 (0x0030 - 0x0030)
class UAthenaAccountContext final : public UBlueprintContextBase
{
public:
	void GetBattleBookPurchaseLimit(int32* MaxNumLevelsPossibleToPurchase, int32* BonusLevelsGranted);
	class UAthenaSeasonItemDefinition* GetCurrentSeasonDefinition();
	void SimulateBattleBookPurchase(int32 NumLevelsToPurchase, int32* BonusLevelsGranted, bool* bOverLimit);

	class FText GetCurrentSeasonName() const;
	int32 GetCurrentSeasonNumber() const;
	bool IsAtMaxBattlePassTier() const;
	bool ShouldReplaceBattleStarsWithAlternateReward() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaAccountContext">();
	}
	static class UAthenaAccountContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaAccountContext>();
	}
};
static_assert(alignof(UAthenaAccountContext) == 0x000008, "Wrong alignment on UAthenaAccountContext");
static_assert(sizeof(UAthenaAccountContext) == 0x000030, "Wrong size on UAthenaAccountContext");

// Class FortniteUI.FortPlayerPowerRating
// 0x0020 (0x0250 - 0x0230)
class UFortPlayerPowerRating : public UCommonUserWidget
{
public:
	UMulticastInlineDelegateProperty_             OnPowerRatingUpdated;                              // 0x0230(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_240[0x10];                                     // 0x0240(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnBasePowerRatingUpdated(int32 BasePowerRating);
	void OnPowerRatingProgressUpdated(float BaseRatingProgress, float TeamRatingProgress);
	void OnPowerRatingUpdated__DelegateSignature();
	void OnTeamMembershipChanged();
	void OnTeamPowerRatingUpdated(int32 TeamPowerRating);
	void RepresentLocalPlayer();

	int32 GetBasePowerRating() const;
	int32 GetTeamPowerRating() const;
	bool HasTeamMembers() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerPowerRating">();
	}
	static class UFortPlayerPowerRating* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerPowerRating>();
	}
};
static_assert(alignof(UFortPlayerPowerRating) == 0x000008, "Wrong alignment on UFortPlayerPowerRating");
static_assert(sizeof(UFortPlayerPowerRating) == 0x000250, "Wrong size on UFortPlayerPowerRating");
static_assert(offsetof(UFortPlayerPowerRating, OnPowerRatingUpdated) == 0x000230, "Member 'UFortPlayerPowerRating::OnPowerRatingUpdated' has a wrong offset!");

// Class FortniteUI.FortUIScoreReport
// 0x0008 (0x0030 - 0x0028)
class UFortUIScoreReport final : public UObject
{
public:
	class UFortLocalPlayer*                       LocalPlayer;                                       // 0x0028(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	int32 GetBadgeScore(class UFortItem* BadgeItem) const;
	class AFortPlayerPawn* GetCurrentPlayerPawn(int32 ScoreReportIndex) const;
	class AFortPlayerState* GetCurrentPlayerState(int32 ScoreReportIndex) const;
	float GetDifficultBonusMultiplier() const;
	int32 GetDifficultBonusScore() const;
	float GetLevelProgress(int32 Level, int32 DisplayXp) const;
	int32 GetPlayerCount() const;
	void GetPlayerIDFromScoreReportIndex(int32 ScoreReportIndex, struct FUniqueNetIdRepl* OutUniqueNetIdRepl) const;
	class FText GetPlayerName(int32 ScoreReportIndex) const;
	class FString GetPlayerPlatform(int32 ScoreReportIndex) const;
	int32 GetPlayerScore(int32 ScoreReportIndex, EFortUIScoreType ScoreType) const;
	int32 GetScoreReportIndex(const struct FUniqueNetIdRepl& PlayerID) const;
	void GetScoreReportIndicesByPlayerID(TArray<int32>* SortedScoreReportIndices) const;
	int32 GetTeamScore(EFortUIScoreType ScoreType) const;
	bool GetXpInfo(int32 ScoreReportIndex, struct FFortUIXpInfo* OutXpInfo) const;
	int32 GetXpToCompleteLevel(int32 Level) const;
	bool IsLocalPlayer(int32 ScoreReportIndex) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortUIScoreReport">();
	}
	static class UFortUIScoreReport* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortUIScoreReport>();
	}
};
static_assert(alignof(UFortUIScoreReport) == 0x000008, "Wrong alignment on UFortUIScoreReport");
static_assert(sizeof(UFortUIScoreReport) == 0x000030, "Wrong size on UFortUIScoreReport");
static_assert(offsetof(UFortUIScoreReport, LocalPlayer) == 0x000028, "Member 'UFortUIScoreReport::LocalPlayer' has a wrong offset!");

// Class FortniteUI.AthenaChallengeScreenTile_Daily
// 0x0010 (0x0B68 - 0x0B58)
class UAthenaChallengeScreenTile_Daily final : public UAthenaChallengeScreenTileBase
{
public:
	class UImage*                                 Image_PartyAssist;                                 // 0x0B58(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                       EntryBox_MinimalInfoDailies;                       // 0x0B60(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaChallengeScreenTile_Daily">();
	}
	static class UAthenaChallengeScreenTile_Daily* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaChallengeScreenTile_Daily>();
	}
};
static_assert(alignof(UAthenaChallengeScreenTile_Daily) == 0x000008, "Wrong alignment on UAthenaChallengeScreenTile_Daily");
static_assert(sizeof(UAthenaChallengeScreenTile_Daily) == 0x000B68, "Wrong size on UAthenaChallengeScreenTile_Daily");
static_assert(offsetof(UAthenaChallengeScreenTile_Daily, Image_PartyAssist) == 0x000B58, "Member 'UAthenaChallengeScreenTile_Daily::Image_PartyAssist' has a wrong offset!");
static_assert(offsetof(UAthenaChallengeScreenTile_Daily, EntryBox_MinimalInfoDailies) == 0x000B60, "Member 'UAthenaChallengeScreenTile_Daily::EntryBox_MinimalInfoDailies' has a wrong offset!");

// Class FortniteUI.HUDLayoutToolPlacementWidget
// 0x0290 (0x04C0 - 0x0230)
class UHUDLayoutToolPlacementWidget final : public UCommonUserWidget
{
public:
	uint8                                         Pad_230[0x8];                                      // 0x0230(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bCanMoveWidget;                                    // 0x0238(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UBacchusHUDElement>         HUDElementClass;                                   // 0x0240(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           HUDElementTagOverride;                             // 0x0248(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsBlockingWidget;                                 // 0x0250(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsMandatoryOnScreen;                              // 0x0251(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_252[0x6];                                      // 0x0252(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBorder*                                SelectionBorder;                                   // 0x0258(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBorder*                                DisplayScaleBorder;                                // 0x0260(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UOverlay*                               MainOverlay;                                       // 0x0268(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCanEditVisibilityOverride;                        // 0x0270(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_271[0x3];                                      // 0x0271(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Property_0;                                        // 0x0274(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Property_1;                                        // 0x0278(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Property_2;                                        // 0x027C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Property_3;                                        // 0x0280(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, float>                      FloatProperties;                                   // 0x0288(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Protected, NativeAccessSpecifierProtected)
	struct FHUDLayoutDataEntry                    DefaultEntry;                                      // 0x02D8(0x0180)(Transient, Protected, NativeAccessSpecifierProtected)
	class UBacchusHUDElement*                     BacchusHUDElement;                                 // 0x0458(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_460[0x60];                                     // 0x0460(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnInsideGridStateChange(bool bInsideGrid);
	void OnLayoutVisibilityChanged(bool bShowCombat, bool bShowBuild, bool bShowEdit, bool bShowCreative);
	void OnResetToDefault();
	void OnWidgetSelected(class UHUDLayoutToolPlacementWidget* InSelectedWidget);
	void ResetIfMandatoryOffScreen();

	struct FGameplayTag BP_GetMobileVisualType() const;
	bool CanEditVisibility() const;
	bool GetIsOverlapping() const;
	bool IsInsideGrid() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HUDLayoutToolPlacementWidget">();
	}
	static class UHUDLayoutToolPlacementWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHUDLayoutToolPlacementWidget>();
	}
};
static_assert(alignof(UHUDLayoutToolPlacementWidget) == 0x000008, "Wrong alignment on UHUDLayoutToolPlacementWidget");
static_assert(sizeof(UHUDLayoutToolPlacementWidget) == 0x0004C0, "Wrong size on UHUDLayoutToolPlacementWidget");
static_assert(offsetof(UHUDLayoutToolPlacementWidget, bCanMoveWidget) == 0x000238, "Member 'UHUDLayoutToolPlacementWidget::bCanMoveWidget' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolPlacementWidget, HUDElementClass) == 0x000240, "Member 'UHUDLayoutToolPlacementWidget::HUDElementClass' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolPlacementWidget, HUDElementTagOverride) == 0x000248, "Member 'UHUDLayoutToolPlacementWidget::HUDElementTagOverride' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolPlacementWidget, bIsBlockingWidget) == 0x000250, "Member 'UHUDLayoutToolPlacementWidget::bIsBlockingWidget' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolPlacementWidget, bIsMandatoryOnScreen) == 0x000251, "Member 'UHUDLayoutToolPlacementWidget::bIsMandatoryOnScreen' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolPlacementWidget, SelectionBorder) == 0x000258, "Member 'UHUDLayoutToolPlacementWidget::SelectionBorder' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolPlacementWidget, DisplayScaleBorder) == 0x000260, "Member 'UHUDLayoutToolPlacementWidget::DisplayScaleBorder' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolPlacementWidget, MainOverlay) == 0x000268, "Member 'UHUDLayoutToolPlacementWidget::MainOverlay' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolPlacementWidget, bCanEditVisibilityOverride) == 0x000270, "Member 'UHUDLayoutToolPlacementWidget::bCanEditVisibilityOverride' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolPlacementWidget, Property_0) == 0x000274, "Member 'UHUDLayoutToolPlacementWidget::Property_0' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolPlacementWidget, Property_1) == 0x000278, "Member 'UHUDLayoutToolPlacementWidget::Property_1' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolPlacementWidget, Property_2) == 0x00027C, "Member 'UHUDLayoutToolPlacementWidget::Property_2' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolPlacementWidget, Property_3) == 0x000280, "Member 'UHUDLayoutToolPlacementWidget::Property_3' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolPlacementWidget, FloatProperties) == 0x000288, "Member 'UHUDLayoutToolPlacementWidget::FloatProperties' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolPlacementWidget, DefaultEntry) == 0x0002D8, "Member 'UHUDLayoutToolPlacementWidget::DefaultEntry' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolPlacementWidget, BacchusHUDElement) == 0x000458, "Member 'UHUDLayoutToolPlacementWidget::BacchusHUDElement' has a wrong offset!");

// Class FortniteUI.AthenaPlayerHitPointBarBase
// 0x0038 (0x0260 - 0x0228)
class UAthenaPlayerHitPointBarBase final : public UUserWidget
{
public:
	uint8                                         Pad_228[0x10];                                     // 0x0228(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaPlayerViewModel*                 PlayerVM;                                          // 0x0238(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EHealthBarType                                BarType;                                           // 0x0240(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_241[0x3];                                      // 0x0241(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ValueCurrent;                                      // 0x0244(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BeginDeltaInterpDelayMin;                          // 0x0248(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BeginDeltaInterpDelayMax;                          // 0x024C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ValueLast;                                         // 0x0250(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ValueMax;                                          // 0x0254(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LastToCurrentUpdateRate;                           // 0x0258(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnDBNOStateChanged(bool IsDBNO);
	void OnDeltaChanged();
	void OnMaxValueChanged(float Value);
	void OnValueChangedWithReason(float Value, EFortHitPointModificationReason Reason);
	void SetDataSource(class UAthenaPlayerViewModel* PlayerViewModel);

	float GetCurrentValuePercentage() const;
	float GetLastValuePercentage() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaPlayerHitPointBarBase">();
	}
	static class UAthenaPlayerHitPointBarBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaPlayerHitPointBarBase>();
	}
};
static_assert(alignof(UAthenaPlayerHitPointBarBase) == 0x000008, "Wrong alignment on UAthenaPlayerHitPointBarBase");
static_assert(sizeof(UAthenaPlayerHitPointBarBase) == 0x000260, "Wrong size on UAthenaPlayerHitPointBarBase");
static_assert(offsetof(UAthenaPlayerHitPointBarBase, PlayerVM) == 0x000238, "Member 'UAthenaPlayerHitPointBarBase::PlayerVM' has a wrong offset!");
static_assert(offsetof(UAthenaPlayerHitPointBarBase, BarType) == 0x000240, "Member 'UAthenaPlayerHitPointBarBase::BarType' has a wrong offset!");
static_assert(offsetof(UAthenaPlayerHitPointBarBase, ValueCurrent) == 0x000244, "Member 'UAthenaPlayerHitPointBarBase::ValueCurrent' has a wrong offset!");
static_assert(offsetof(UAthenaPlayerHitPointBarBase, BeginDeltaInterpDelayMin) == 0x000248, "Member 'UAthenaPlayerHitPointBarBase::BeginDeltaInterpDelayMin' has a wrong offset!");
static_assert(offsetof(UAthenaPlayerHitPointBarBase, BeginDeltaInterpDelayMax) == 0x00024C, "Member 'UAthenaPlayerHitPointBarBase::BeginDeltaInterpDelayMax' has a wrong offset!");
static_assert(offsetof(UAthenaPlayerHitPointBarBase, ValueLast) == 0x000250, "Member 'UAthenaPlayerHitPointBarBase::ValueLast' has a wrong offset!");
static_assert(offsetof(UAthenaPlayerHitPointBarBase, ValueMax) == 0x000254, "Member 'UAthenaPlayerHitPointBarBase::ValueMax' has a wrong offset!");
static_assert(offsetof(UAthenaPlayerHitPointBarBase, LastToCurrentUpdateRate) == 0x000258, "Member 'UAthenaPlayerHitPointBarBase::LastToCurrentUpdateRate' has a wrong offset!");

// Class FortniteUI.AthenaAIKillsBase
// 0x0018 (0x0278 - 0x0260)
class UAthenaAIKillsBase final : public UFortHUDElementWidget
{
public:
	class UTextBlock*                             KillsText;                                         // 0x0260(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UObject*                                KillsSource;                                       // 0x0268(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCustomKillSource;                                 // 0x0270(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetKillsSourcePlayerController(class AFortPlayerControllerAthena* InPlayerController);
	void SetKillsSourcePlayerState(class AFortPlayerStateAthena* InPlayerState);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaAIKillsBase">();
	}
	static class UAthenaAIKillsBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaAIKillsBase>();
	}
};
static_assert(alignof(UAthenaAIKillsBase) == 0x000008, "Wrong alignment on UAthenaAIKillsBase");
static_assert(sizeof(UAthenaAIKillsBase) == 0x000278, "Wrong size on UAthenaAIKillsBase");
static_assert(offsetof(UAthenaAIKillsBase, KillsText) == 0x000260, "Member 'UAthenaAIKillsBase::KillsText' has a wrong offset!");
static_assert(offsetof(UAthenaAIKillsBase, KillsSource) == 0x000268, "Member 'UAthenaAIKillsBase::KillsSource' has a wrong offset!");
static_assert(offsetof(UAthenaAIKillsBase, bCustomKillSource) == 0x000270, "Member 'UAthenaAIKillsBase::bCustomKillSource' has a wrong offset!");

// Class FortniteUI.AthenaAwardAlertBase
// 0x0008 (0x0230 - 0x0228)
class UAthenaAwardAlertBase final : public UUserWidget
{
public:
	class UAthenaPlayerViewModel*                 PlayerVM;                                          // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnAwardGranted(class UFortAwardItemDefinition* AwardDefinition);
	void SetDataSource(class UAthenaPlayerViewModel* PlayerViewModel);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaAwardAlertBase">();
	}
	static class UAthenaAwardAlertBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaAwardAlertBase>();
	}
};
static_assert(alignof(UAthenaAwardAlertBase) == 0x000008, "Wrong alignment on UAthenaAwardAlertBase");
static_assert(sizeof(UAthenaAwardAlertBase) == 0x000230, "Wrong size on UAthenaAwardAlertBase");
static_assert(offsetof(UAthenaAwardAlertBase, PlayerVM) == 0x000228, "Member 'UAthenaAwardAlertBase::PlayerVM' has a wrong offset!");

// Class FortniteUI.AthenaPostMatchDetailedStats
// 0x00C8 (0x02F8 - 0x0230)
class UAthenaPostMatchDetailedStats final : public UCommonUserWidget
{
public:
	uint8                                         Pad_230[0x8];                                      // 0x0230(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
