#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortniteUI

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "MediaUtils_structs.hpp"
#include "Engine_structs.hpp"
#include "Party_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "CommonUI_structs.hpp"
#include "CommonInput_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "GameSubCatalog_structs.hpp"
#include "SocialUMG_structs.hpp"


namespace SDK::Params
{

// Function FortniteUI.FortGadgetsWidgetBase.OnGenerateTooltipWidget
// 0x0038 (0x0038 - 0x0000)
struct FortGadgetsWidgetBase_OnGenerateTooltipWidget final
{
public:
	class FText                                   Header;                                            // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   Description;                                       // 0x0018(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UWidget*                                ReturnValue;                                       // 0x0030(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortGadgetsWidgetBase_OnGenerateTooltipWidget) == 0x000008, "Wrong alignment on FortGadgetsWidgetBase_OnGenerateTooltipWidget");
static_assert(sizeof(FortGadgetsWidgetBase_OnGenerateTooltipWidget) == 0x000038, "Wrong size on FortGadgetsWidgetBase_OnGenerateTooltipWidget");
static_assert(offsetof(FortGadgetsWidgetBase_OnGenerateTooltipWidget, Header) == 0x000000, "Member 'FortGadgetsWidgetBase_OnGenerateTooltipWidget::Header' has a wrong offset!");
static_assert(offsetof(FortGadgetsWidgetBase_OnGenerateTooltipWidget, Description) == 0x000018, "Member 'FortGadgetsWidgetBase_OnGenerateTooltipWidget::Description' has a wrong offset!");
static_assert(offsetof(FortGadgetsWidgetBase_OnGenerateTooltipWidget, ReturnValue) == 0x000030, "Member 'FortGadgetsWidgetBase_OnGenerateTooltipWidget::ReturnValue' has a wrong offset!");

// Function FortniteUI.AthenaChallengeScreenTileBase.OnChallengeSetEstablished
// 0x0088 (0x0088 - 0x0000)
struct AthenaChallengeScreenTileBase_OnChallengeSetEstablished final
{
public:
	struct FFortChallengeSetStyle                 DisplayStyle;                                      // 0x0000(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bIsComplete;                                       // 0x0080(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsLocked;                                         // 0x0081(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AthenaChallengeScreenTileBase_OnChallengeSetEstablished) == 0x000008, "Wrong alignment on AthenaChallengeScreenTileBase_OnChallengeSetEstablished");
static_assert(sizeof(AthenaChallengeScreenTileBase_OnChallengeSetEstablished) == 0x000088, "Wrong size on AthenaChallengeScreenTileBase_OnChallengeSetEstablished");
static_assert(offsetof(AthenaChallengeScreenTileBase_OnChallengeSetEstablished, DisplayStyle) == 0x000000, "Member 'AthenaChallengeScreenTileBase_OnChallengeSetEstablished::DisplayStyle' has a wrong offset!");
static_assert(offsetof(AthenaChallengeScreenTileBase_OnChallengeSetEstablished, bIsComplete) == 0x000080, "Member 'AthenaChallengeScreenTileBase_OnChallengeSetEstablished::bIsComplete' has a wrong offset!");
static_assert(offsetof(AthenaChallengeScreenTileBase_OnChallengeSetEstablished, bIsLocked) == 0x000081, "Member 'AthenaChallengeScreenTileBase_OnChallengeSetEstablished::bIsLocked' has a wrong offset!");

// Function FortniteUI.AthenaChallengeScreenTileBase.OnContainsPartyAssistedChallengeChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaChallengeScreenTileBase_OnContainsPartyAssistedChallengeChanged final
{
public:
	bool                                          bHasPartyAssistedChallenge;                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AthenaChallengeScreenTileBase_OnContainsPartyAssistedChallengeChanged) == 0x000001, "Wrong alignment on AthenaChallengeScreenTileBase_OnContainsPartyAssistedChallengeChanged");
static_assert(sizeof(AthenaChallengeScreenTileBase_OnContainsPartyAssistedChallengeChanged) == 0x000001, "Wrong size on AthenaChallengeScreenTileBase_OnContainsPartyAssistedChallengeChanged");
static_assert(offsetof(AthenaChallengeScreenTileBase_OnContainsPartyAssistedChallengeChanged, bHasPartyAssistedChallenge) == 0x000000, "Member 'AthenaChallengeScreenTileBase_OnContainsPartyAssistedChallengeChanged::bHasPartyAssistedChallenge' has a wrong offset!");

// Function FortniteUI.FortHUDElementWidget.HandleOnHUDElementVisibilityChanged
// 0x0020 (0x0020 - 0x0000)
struct FortHUDElementWidget_HandleOnHUDElementVisibilityChanged final
{
public:
	struct FGameplayTagContainer                  HiddenHUDElementTags;                              // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortHUDElementWidget_HandleOnHUDElementVisibilityChanged) == 0x000008, "Wrong alignment on FortHUDElementWidget_HandleOnHUDElementVisibilityChanged");
static_assert(sizeof(FortHUDElementWidget_HandleOnHUDElementVisibilityChanged) == 0x000020, "Wrong size on FortHUDElementWidget_HandleOnHUDElementVisibilityChanged");
static_assert(offsetof(FortHUDElementWidget_HandleOnHUDElementVisibilityChanged, HiddenHUDElementTags) == 0x000000, "Member 'FortHUDElementWidget_HandleOnHUDElementVisibilityChanged::HiddenHUDElementTags' has a wrong offset!");

// Function FortniteUI.FortHUDElementWidget.OnVisibilitySetEvent
// 0x0001 (0x0001 - 0x0000)
struct FortHUDElementWidget_OnVisibilitySetEvent final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortHUDElementWidget_OnVisibilitySetEvent) == 0x000001, "Wrong alignment on FortHUDElementWidget_OnVisibilitySetEvent");
static_assert(sizeof(FortHUDElementWidget_OnVisibilitySetEvent) == 0x000001, "Wrong size on FortHUDElementWidget_OnVisibilitySetEvent");
static_assert(offsetof(FortHUDElementWidget_OnVisibilitySetEvent, InVisibility) == 0x000000, "Member 'FortHUDElementWidget_OnVisibilitySetEvent::InVisibility' has a wrong offset!");

// Function FortniteUI.LTMWidgetBase.OnGamePhaseChanged
// 0x0001 (0x0001 - 0x0000)
struct LTMWidgetBase_OnGamePhaseChanged final
{
public:
	EAthenaGamePhase                              NewPhase;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LTMWidgetBase_OnGamePhaseChanged) == 0x000001, "Wrong alignment on LTMWidgetBase_OnGamePhaseChanged");
static_assert(sizeof(LTMWidgetBase_OnGamePhaseChanged) == 0x000001, "Wrong size on LTMWidgetBase_OnGamePhaseChanged");
static_assert(offsetof(LTMWidgetBase_OnGamePhaseChanged, NewPhase) == 0x000000, "Member 'LTMWidgetBase_OnGamePhaseChanged::NewPhase' has a wrong offset!");

// Function FortniteUI.LTMWidgetBase.OnHandleSpectatingChanged
// 0x0008 (0x0008 - 0x0000)
struct LTMWidgetBase_OnHandleSpectatingChanged final
{
public:
	class AFortPlayerStateZone*                   SpectatingTarget;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LTMWidgetBase_OnHandleSpectatingChanged) == 0x000008, "Wrong alignment on LTMWidgetBase_OnHandleSpectatingChanged");
static_assert(sizeof(LTMWidgetBase_OnHandleSpectatingChanged) == 0x000008, "Wrong size on LTMWidgetBase_OnHandleSpectatingChanged");
static_assert(offsetof(LTMWidgetBase_OnHandleSpectatingChanged, SpectatingTarget) == 0x000000, "Member 'LTMWidgetBase_OnHandleSpectatingChanged::SpectatingTarget' has a wrong offset!");

// Function FortniteUI.LTMWidgetBase.GetViewingTeam
// 0x0001 (0x0001 - 0x0000)
struct LTMWidgetBase_GetViewingTeam final
{
public:
	uint8                                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LTMWidgetBase_GetViewingTeam) == 0x000001, "Wrong alignment on LTMWidgetBase_GetViewingTeam");
static_assert(sizeof(LTMWidgetBase_GetViewingTeam) == 0x000001, "Wrong size on LTMWidgetBase_GetViewingTeam");
static_assert(offsetof(LTMWidgetBase_GetViewingTeam, ReturnValue) == 0x000000, "Member 'LTMWidgetBase_GetViewingTeam::ReturnValue' has a wrong offset!");

// Function FortniteUI.FortActivatablePanel.AsyncPlaySound2D
// 0x0040 (0x0040 - 0x0000)
struct FortActivatablePanel_AsyncPlaySound2D final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class USoundBase>              SoundToLoad;                                       // 0x0008(0x0028)(Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VolumeMultiplier;                                  // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PitchMultiplier;                                   // 0x0034(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartTime;                                         // 0x0038(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortActivatablePanel_AsyncPlaySound2D) == 0x000008, "Wrong alignment on FortActivatablePanel_AsyncPlaySound2D");
static_assert(sizeof(FortActivatablePanel_AsyncPlaySound2D) == 0x000040, "Wrong size on FortActivatablePanel_AsyncPlaySound2D");
static_assert(offsetof(FortActivatablePanel_AsyncPlaySound2D, WorldContextObject) == 0x000000, "Member 'FortActivatablePanel_AsyncPlaySound2D::WorldContextObject' has a wrong offset!");
static_assert(offsetof(FortActivatablePanel_AsyncPlaySound2D, SoundToLoad) == 0x000008, "Member 'FortActivatablePanel_AsyncPlaySound2D::SoundToLoad' has a wrong offset!");
static_assert(offsetof(FortActivatablePanel_AsyncPlaySound2D, VolumeMultiplier) == 0x000030, "Member 'FortActivatablePanel_AsyncPlaySound2D::VolumeMultiplier' has a wrong offset!");
static_assert(offsetof(FortActivatablePanel_AsyncPlaySound2D, PitchMultiplier) == 0x000034, "Member 'FortActivatablePanel_AsyncPlaySound2D::PitchMultiplier' has a wrong offset!");
static_assert(offsetof(FortActivatablePanel_AsyncPlaySound2D, StartTime) == 0x000038, "Member 'FortActivatablePanel_AsyncPlaySound2D::StartTime' has a wrong offset!");

// Function FortniteUI.FortActivatablePanel.RestoreCenterWidget
// 0x0008 (0x0008 - 0x0000)
struct FortActivatablePanel_RestoreCenterWidget final
{
public:
	class UWidget*                                FallbackWidget;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortActivatablePanel_RestoreCenterWidget) == 0x000008, "Wrong alignment on FortActivatablePanel_RestoreCenterWidget");
static_assert(sizeof(FortActivatablePanel_RestoreCenterWidget) == 0x000008, "Wrong size on FortActivatablePanel_RestoreCenterWidget");
static_assert(offsetof(FortActivatablePanel_RestoreCenterWidget, FallbackWidget) == 0x000000, "Member 'FortActivatablePanel_RestoreCenterWidget::FallbackWidget' has a wrong offset!");

// Function FortniteUI.FortActivatablePanel.RestoreScrollWidget
// 0x0008 (0x0008 - 0x0000)
struct FortActivatablePanel_RestoreScrollWidget final
{
public:
	class UWidget*                                FallbackWidget;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortActivatablePanel_RestoreScrollWidget) == 0x000008, "Wrong alignment on FortActivatablePanel_RestoreScrollWidget");
static_assert(sizeof(FortActivatablePanel_RestoreScrollWidget) == 0x000008, "Wrong size on FortActivatablePanel_RestoreScrollWidget");
static_assert(offsetof(FortActivatablePanel_RestoreScrollWidget, FallbackWidget) == 0x000000, "Member 'FortActivatablePanel_RestoreScrollWidget::FallbackWidget' has a wrong offset!");

// Function FortniteUI.FortActivatablePanelWithItemPreview.GetWidgetForFramingViewedItem
// 0x0008 (0x0008 - 0x0000)
struct FortActivatablePanelWithItemPreview_GetWidgetForFramingViewedItem final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortActivatablePanelWithItemPreview_GetWidgetForFramingViewedItem) == 0x000008, "Wrong alignment on FortActivatablePanelWithItemPreview_GetWidgetForFramingViewedItem");
static_assert(sizeof(FortActivatablePanelWithItemPreview_GetWidgetForFramingViewedItem) == 0x000008, "Wrong size on FortActivatablePanelWithItemPreview_GetWidgetForFramingViewedItem");
static_assert(offsetof(FortActivatablePanelWithItemPreview_GetWidgetForFramingViewedItem, ReturnValue) == 0x000000, "Member 'FortActivatablePanelWithItemPreview_GetWidgetForFramingViewedItem::ReturnValue' has a wrong offset!");

// Function FortniteUI.FortActivatablePanelWithItemPreview.OnCosmeticSpecialActionPressed_0
// 0x0001 (0x0001 - 0x0000)
struct FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_0 final
{
public:
	bool                                          bPassThrough;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_0) == 0x000001, "Wrong alignment on FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_0");
static_assert(sizeof(FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_0) == 0x000001, "Wrong size on FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_0");
static_assert(offsetof(FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_0, bPassThrough) == 0x000000, "Member 'FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_0::bPassThrough' has a wrong offset!");

// Function FortniteUI.FortActivatablePanelWithItemPreview.OnCosmeticSpecialActionPressed_1
// 0x0001 (0x0001 - 0x0000)
struct FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_1 final
{
public:
	bool                                          bPassThrough;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_1) == 0x000001, "Wrong alignment on FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_1");
static_assert(sizeof(FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_1) == 0x000001, "Wrong size on FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_1");
static_assert(offsetof(FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_1, bPassThrough) == 0x000000, "Member 'FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_1::bPassThrough' has a wrong offset!");

// Function FortniteUI.FortActivatablePanelWithItemPreview.OnCosmeticSpecialActionPressed_2
// 0x0001 (0x0001 - 0x0000)
struct FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_2 final
{
public:
	bool                                          bPassThrough;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_2) == 0x000001, "Wrong alignment on FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_2");
static_assert(sizeof(FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_2) == 0x000001, "Wrong size on FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_2");
static_assert(offsetof(FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_2, bPassThrough) == 0x000000, "Member 'FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_2::bPassThrough' has a wrong offset!");

// Function FortniteUI.FortActivatablePanelWithItemPreview.OnCosmeticSpecialActionPressed_3
// 0x0001 (0x0001 - 0x0000)
struct FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_3 final
{
public:
	bool                                          bPassThrough;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_3) == 0x000001, "Wrong alignment on FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_3");
static_assert(sizeof(FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_3) == 0x000001, "Wrong size on FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_3");
static_assert(offsetof(FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_3, bPassThrough) == 0x000000, "Member 'FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_3::bPassThrough' has a wrong offset!");

// Function FortniteUI.FortActivatablePanelWithItemPreview.OnCosmeticSpecialActionPressed_4
// 0x0001 (0x0001 - 0x0000)
struct FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_4 final
{
public:
	bool                                          bPassThrough;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_4) == 0x000001, "Wrong alignment on FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_4");
static_assert(sizeof(FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_4) == 0x000001, "Wrong size on FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_4");
static_assert(offsetof(FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_4, bPassThrough) == 0x000000, "Member 'FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_4::bPassThrough' has a wrong offset!");

// Function FortniteUI.FortActivatablePanelWithItemPreview.OnCosmeticSpecialActionPressed_5
// 0x0001 (0x0001 - 0x0000)
struct FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_5 final
{
public:
	bool                                          bPassThrough;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_5) == 0x000001, "Wrong alignment on FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_5");
static_assert(sizeof(FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_5) == 0x000001, "Wrong size on FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_5");
static_assert(offsetof(FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_5, bPassThrough) == 0x000000, "Member 'FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_5::bPassThrough' has a wrong offset!");

// Function FortniteUI.FortActivatablePanelWithItemPreview.OnCosmeticSpecialActionPressed_6
// 0x0001 (0x0001 - 0x0000)
struct FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_6 final
{
public:
	bool                                          bPassThrough;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_6) == 0x000001, "Wrong alignment on FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_6");
static_assert(sizeof(FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_6) == 0x000001, "Wrong size on FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_6");
static_assert(offsetof(FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_6, bPassThrough) == 0x000000, "Member 'FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_6::bPassThrough' has a wrong offset!");

// Function FortniteUI.FortActivatablePanelWithItemPreview.OnCosmeticSpecialActionPressed_7
// 0x0001 (0x0001 - 0x0000)
struct FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_7 final
{
public:
	bool                                          bPassThrough;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_7) == 0x000001, "Wrong alignment on FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_7");
static_assert(sizeof(FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_7) == 0x000001, "Wrong size on FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_7");
static_assert(offsetof(FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_7, bPassThrough) == 0x000000, "Member 'FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_7::bPassThrough' has a wrong offset!");

// Function FortniteUI.FortActivatablePanelWithItemPreview.OnItemPreviewChanged
// 0x0010 (0x0010 - 0x0000)
struct FortActivatablePanelWithItemPreview_OnItemPreviewChanged final
{
public:
	class AActor*                                 NewPrefab;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortItem*                              NewItem;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortActivatablePanelWithItemPreview_OnItemPreviewChanged) == 0x000008, "Wrong alignment on FortActivatablePanelWithItemPreview_OnItemPreviewChanged");
static_assert(sizeof(FortActivatablePanelWithItemPreview_OnItemPreviewChanged) == 0x000010, "Wrong size on FortActivatablePanelWithItemPreview_OnItemPreviewChanged");
static_assert(offsetof(FortActivatablePanelWithItemPreview_OnItemPreviewChanged, NewPrefab) == 0x000000, "Member 'FortActivatablePanelWithItemPreview_OnItemPreviewChanged::NewPrefab' has a wrong offset!");
static_assert(offsetof(FortActivatablePanelWithItemPreview_OnItemPreviewChanged, NewItem) == 0x000008, "Member 'FortActivatablePanelWithItemPreview_OnItemPreviewChanged::NewItem' has a wrong offset!");

// Function FortniteUI.FortActivatablePanelWithItemPreview.OnVaultItemsViewed
// 0x0010 (0x0010 - 0x0000)
struct FortActivatablePanelWithItemPreview_OnVaultItemsViewed final
{
public:
	TArray<class UFortItem*>                      Items;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortActivatablePanelWithItemPreview_OnVaultItemsViewed) == 0x000008, "Wrong alignment on FortActivatablePanelWithItemPreview_OnVaultItemsViewed");
static_assert(sizeof(FortActivatablePanelWithItemPreview_OnVaultItemsViewed) == 0x000010, "Wrong size on FortActivatablePanelWithItemPreview_OnVaultItemsViewed");
static_assert(offsetof(FortActivatablePanelWithItemPreview_OnVaultItemsViewed, Items) == 0x000000, "Member 'FortActivatablePanelWithItemPreview_OnVaultItemsViewed::Items' has a wrong offset!");

// Function FortniteUI.AthenaChallengeSetImageGrid.OnChallengeSetEstablished
// 0x0088 (0x0088 - 0x0000)
struct AthenaChallengeSetImageGrid_OnChallengeSetEstablished final
{
public:
	struct FFortChallengeSetStyle                 DisplayStyle;                                      // 0x0000(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bIsComplete;                                       // 0x0080(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AthenaChallengeSetImageGrid_OnChallengeSetEstablished) == 0x000008, "Wrong alignment on AthenaChallengeSetImageGrid_OnChallengeSetEstablished");
static_assert(sizeof(AthenaChallengeSetImageGrid_OnChallengeSetEstablished) == 0x000088, "Wrong size on AthenaChallengeSetImageGrid_OnChallengeSetEstablished");
static_assert(offsetof(AthenaChallengeSetImageGrid_OnChallengeSetEstablished, DisplayStyle) == 0x000000, "Member 'AthenaChallengeSetImageGrid_OnChallengeSetEstablished::DisplayStyle' has a wrong offset!");
static_assert(offsetof(AthenaChallengeSetImageGrid_OnChallengeSetEstablished, bIsComplete) == 0x000080, "Member 'AthenaChallengeSetImageGrid_OnChallengeSetEstablished::bIsComplete' has a wrong offset!");

// Function FortniteUI.AshtonWidgetBase.OnStoneChanged
// 0x0002 (0x0002 - 0x0000)
struct AshtonWidgetBase_OnStoneChanged final
{
public:
	EAshtonStoneType                              StoneType;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAshtonStoneStateType                         StoneState;                                        // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AshtonWidgetBase_OnStoneChanged) == 0x000001, "Wrong alignment on AshtonWidgetBase_OnStoneChanged");
static_assert(sizeof(AshtonWidgetBase_OnStoneChanged) == 0x000002, "Wrong size on AshtonWidgetBase_OnStoneChanged");
static_assert(offsetof(AshtonWidgetBase_OnStoneChanged, StoneType) == 0x000000, "Member 'AshtonWidgetBase_OnStoneChanged::StoneType' has a wrong offset!");
static_assert(offsetof(AshtonWidgetBase_OnStoneChanged, StoneState) == 0x000001, "Member 'AshtonWidgetBase_OnStoneChanged::StoneState' has a wrong offset!");

// Function FortniteUI.AshtonWidgetBase.OnVillainRespawnCountChanged
// 0x0008 (0x0008 - 0x0000)
struct AshtonWidgetBase_OnVillainRespawnCountChanged final
{
public:
	int32                                         NumRespawnsLeft;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RespawnPercentLeft;                                // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AshtonWidgetBase_OnVillainRespawnCountChanged) == 0x000004, "Wrong alignment on AshtonWidgetBase_OnVillainRespawnCountChanged");
static_assert(sizeof(AshtonWidgetBase_OnVillainRespawnCountChanged) == 0x000008, "Wrong size on AshtonWidgetBase_OnVillainRespawnCountChanged");
static_assert(offsetof(AshtonWidgetBase_OnVillainRespawnCountChanged, NumRespawnsLeft) == 0x000000, "Member 'AshtonWidgetBase_OnVillainRespawnCountChanged::NumRespawnsLeft' has a wrong offset!");
static_assert(offsetof(AshtonWidgetBase_OnVillainRespawnCountChanged, RespawnPercentLeft) == 0x000004, "Member 'AshtonWidgetBase_OnVillainRespawnCountChanged::RespawnPercentLeft' has a wrong offset!");

// Function FortniteUI.AshtonWidgetBase.UpdateAllUI
// 0x0001 (0x0001 - 0x0000)
struct AshtonWidgetBase_UpdateAllUI final
{
public:
	bool                                          bFirstUpdate;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AshtonWidgetBase_UpdateAllUI) == 0x000001, "Wrong alignment on AshtonWidgetBase_UpdateAllUI");
static_assert(sizeof(AshtonWidgetBase_UpdateAllUI) == 0x000001, "Wrong size on AshtonWidgetBase_UpdateAllUI");
static_assert(offsetof(AshtonWidgetBase_UpdateAllUI, bFirstUpdate) == 0x000000, "Member 'AshtonWidgetBase_UpdateAllUI::bFirstUpdate' has a wrong offset!");

// Function FortniteUI.AsyncAction_FortPlayerSurveyDispatcherDisplaySurveys.DisplaySurveys
// 0x0018 (0x0018 - 0x0000)
struct AsyncAction_FortPlayerSurveyDispatcherDisplaySurveys_DisplaySurveys final
{
public:
	class UFortPlayerSurveyDispatcher*            Param_Dispatcher;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SurveyCount;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys* ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AsyncAction_FortPlayerSurveyDispatcherDisplaySurveys_DisplaySurveys) == 0x000008, "Wrong alignment on AsyncAction_FortPlayerSurveyDispatcherDisplaySurveys_DisplaySurveys");
static_assert(sizeof(AsyncAction_FortPlayerSurveyDispatcherDisplaySurveys_DisplaySurveys) == 0x000018, "Wrong size on AsyncAction_FortPlayerSurveyDispatcherDisplaySurveys_DisplaySurveys");
static_assert(offsetof(AsyncAction_FortPlayerSurveyDispatcherDisplaySurveys_DisplaySurveys, Param_Dispatcher) == 0x000000, "Member 'AsyncAction_FortPlayerSurveyDispatcherDisplaySurveys_DisplaySurveys::Param_Dispatcher' has a wrong offset!");
static_assert(offsetof(AsyncAction_FortPlayerSurveyDispatcherDisplaySurveys_DisplaySurveys, SurveyCount) == 0x000008, "Member 'AsyncAction_FortPlayerSurveyDispatcherDisplaySurveys_DisplaySurveys::SurveyCount' has a wrong offset!");
static_assert(offsetof(AsyncAction_FortPlayerSurveyDispatcherDisplaySurveys_DisplaySurveys, ReturnValue) == 0x000010, "Member 'AsyncAction_FortPlayerSurveyDispatcherDisplaySurveys_DisplaySurveys::ReturnValue' has a wrong offset!");

// Function FortniteUI.AsyncAction_FortPlayerSurveyDispatcherDisplaySurveys.HandleAllSurveysFinished
// 0x0008 (0x0008 - 0x0000)
struct AsyncAction_FortPlayerSurveyDispatcherDisplaySurveys_HandleAllSurveysFinished final
{
public:
	class UObject*                                Source;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AsyncAction_FortPlayerSurveyDispatcherDisplaySurveys_HandleAllSurveysFinished) == 0x000008, "Wrong alignment on AsyncAction_FortPlayerSurveyDispatcherDisplaySurveys_HandleAllSurveysFinished");
static_assert(sizeof(AsyncAction_FortPlayerSurveyDispatcherDisplaySurveys_HandleAllSurveysFinished) == 0x000008, "Wrong size on AsyncAction_FortPlayerSurveyDispatcherDisplaySurveys_HandleAllSurveysFinished");
static_assert(offsetof(AsyncAction_FortPlayerSurveyDispatcherDisplaySurveys_HandleAllSurveysFinished, Source) == 0x000000, "Member 'AsyncAction_FortPlayerSurveyDispatcherDisplaySurveys_HandleAllSurveysFinished::Source' has a wrong offset!");

// Function FortniteUI.AthenaAccountContext.GetBattleBookPurchaseLimit
// 0x0008 (0x0008 - 0x0000)
struct AthenaAccountContext_GetBattleBookPurchaseLimit final
{
public:
	int32                                         MaxNumLevelsPossibleToPurchase;                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BonusLevelsGranted;                                // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AthenaAccountContext_GetBattleBookPurchaseLimit) == 0x000004, "Wrong alignment on AthenaAccountContext_GetBattleBookPurchaseLimit");
static_assert(sizeof(AthenaAccountContext_GetBattleBookPurchaseLimit) == 0x000008, "Wrong size on AthenaAccountContext_GetBattleBookPurchaseLimit");
static_assert(offsetof(AthenaAccountContext_GetBattleBookPurchaseLimit, MaxNumLevelsPossibleToPurchase) == 0x000000, "Member 'AthenaAccountContext_GetBattleBookPurchaseLimit::MaxNumLevelsPossibleToPurchase' has a wrong offset!");
static_assert(offsetof(AthenaAccountContext_GetBattleBookPurchaseLimit, BonusLevelsGranted) == 0x000004, "Member 'AthenaAccountContext_GetBattleBookPurchaseLimit::BonusLevelsGranted' has a wrong offset!");

// Function FortniteUI.AthenaAccountContext.GetCurrentSeasonDefinition
// 0x0008 (0x0008 - 0x0000)
struct AthenaAccountContext_GetCurrentSeasonDefinition final
{
public:
	class UAthenaSeasonItemDefinition*            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AthenaAccountContext_GetCurrentSeasonDefinition) == 0x000008, "Wrong alignment on AthenaAccountContext_GetCurrentSeasonDefinition");
static_assert(sizeof(AthenaAccountContext_GetCurrentSeasonDefinition) == 0x000008, "Wrong size on AthenaAccountContext_GetCurrentSeasonDefinition");
static_assert(offsetof(AthenaAccountContext_GetCurrentSeasonDefinition, ReturnValue) == 0x000000, "Member 'AthenaAccountContext_GetCurrentSeasonDefinition::ReturnValue' has a wrong offset!");

// Function FortniteUI.AthenaAccountContext.SimulateBattleBookPurchase
// 0x000C (0x000C - 0x0000)
struct AthenaAccountContext_SimulateBattleBookPurchase final
{
public:
	int32                                         NumLevelsToPurchase;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BonusLevelsGranted;                                // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverLimit;                                        // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AthenaAccountContext_SimulateBattleBookPurchase) == 0x000004, "Wrong alignment on AthenaAccountContext_SimulateBattleBookPurchase");
static_assert(sizeof(AthenaAccountContext_SimulateBattleBookPurchase) == 0x00000C, "Wrong size on AthenaAccountContext_SimulateBattleBookPurchase");
static_assert(offsetof(AthenaAccountContext_SimulateBattleBookPurchase, NumLevelsToPurchase) == 0x000000, "Member 'AthenaAccountContext_SimulateBattleBookPurchase::NumLevelsToPurchase' has a wrong offset!");
static_assert(offsetof(AthenaAccountContext_SimulateBattleBookPurchase, BonusLevelsGranted) == 0x000004, "Member 'AthenaAccountContext_SimulateBattleBookPurchase::BonusLevelsGranted' has a wrong offset!");
static_assert(offsetof(AthenaAccountContext_SimulateBattleBookPurchase, bOverLimit) == 0x000008, "Member 'AthenaAccountContext_SimulateBattleBookPurchase::bOverLimit' has a wrong offset!");

// Function FortniteUI.AthenaAccountContext.GetCurrentSeasonName
// 0x0018 (0x0018 - 0x0000)
struct AthenaAccountContext_GetCurrentSeasonName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AthenaAccountContext_GetCurrentSeasonName) == 0x000008, "Wrong alignment on AthenaAccountContext_GetCurrentSeasonName");
static_assert(sizeof(AthenaAccountContext_GetCurrentSeasonName) == 0x000018, "Wrong size on AthenaAccountContext_GetCurrentSeasonName");
static_assert(offsetof(AthenaAccountContext_GetCurrentSeasonName, ReturnValue) == 0x000000, "Member 'AthenaAccountContext_GetCurrentSeasonName::ReturnValue' has a wrong offset!");

// Function FortniteUI.AthenaAccountContext.GetCurrentSeasonNumber
// 0x0004 (0x0004 - 0x0000)
struct AthenaAccountContext_GetCurrentSeasonNumber final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AthenaAccountContext_GetCurrentSeasonNumber) == 0x000004, "Wrong alignment on AthenaAccountContext_GetCurrentSeasonNumber");
static_assert(sizeof(AthenaAccountContext_GetCurrentSeasonNumber) == 0x000004, "Wrong size on AthenaAccountContext_GetCurrentSeasonNumber");
static_assert(offsetof(AthenaAccountContext_GetCurrentSeasonNumber, ReturnValue) == 0x000000, "Member 'AthenaAccountContext_GetCurrentSeasonNumber::ReturnValue' has a wrong offset!");

// Function FortniteUI.AthenaAccountContext.IsAtMaxBattlePassTier
// 0x0001 (0x0001 - 0x0000)
struct AthenaAccountContext_IsAtMaxBattlePassTier final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AthenaAccountContext_IsAtMaxBattlePassTier) == 0x000001, "Wrong alignment on AthenaAccountContext_IsAtMaxBattlePassTier");
static_assert(sizeof(AthenaAccountContext_IsAtMaxBattlePassTier) == 0x000001, "Wrong size on AthenaAccountContext_IsAtMaxBattlePassTier");
static_assert(offsetof(AthenaAccountContext_IsAtMaxBattlePassTier, ReturnValue) == 0x000000, "Member 'AthenaAccountContext_IsAtMaxBattlePassTier::ReturnValue' has a wrong offset!");

// Function FortniteUI.AthenaAccountContext.ShouldReplaceBattleStarsWithAlternateReward
// 0x0001 (0x0001 - 0x0000)
struct AthenaAccountContext_ShouldReplaceBattleStarsWithAlternateReward final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AthenaAccountContext_ShouldReplaceBattleStarsWithAlternateReward) == 0x000001, "Wrong alignment on AthenaAccountContext_ShouldReplaceBattleStarsWithAlternateReward");
static_assert(sizeof(AthenaAccountContext_ShouldReplaceBattleStarsWithAlternateReward) == 0x000001, "Wrong size on AthenaAccountContext_ShouldReplaceBattleStarsWithAlternateReward");
static_assert(offsetof(AthenaAccountContext_ShouldReplaceBattleStarsWithAlternateReward, ReturnValue) == 0x000000, "Member 'AthenaAccountContext_ShouldReplaceBattleStarsWithAlternateReward::ReturnValue' has a wrong offset!");

// Function FortniteUI.FortPlayerPowerRating.OnBasePowerRatingUpdated
// 0x0004 (0x0004 - 0x0000)
struct FortPlayerPowerRating_OnBasePowerRatingUpdated final
{
public:
	int32                                         BasePowerRating;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortPlayerPowerRating_OnBasePowerRatingUpdated) == 0x000004, "Wrong alignment on FortPlayerPowerRating_OnBasePowerRatingUpdated");
static_assert(sizeof(FortPlayerPowerRating_OnBasePowerRatingUpdated) == 0x000004, "Wrong size on FortPlayerPowerRating_OnBasePowerRatingUpdated");
static_assert(offsetof(FortPlayerPowerRating_OnBasePowerRatingUpdated, BasePowerRating) == 0x000000, "Member 'FortPlayerPowerRating_OnBasePowerRatingUpdated::BasePowerRating' has a wrong offset!");

// Function FortniteUI.FortPlayerPowerRating.OnPowerRatingProgressUpdated
// 0x0008 (0x0008 - 0x0000)
struct FortPlayerPowerRating_OnPowerRatingProgressUpdated final
{
public:
	float                                         BaseRatingProgress;                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TeamRatingProgress;                                // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortPlayerPowerRating_OnPowerRatingProgressUpdated) == 0x000004, "Wrong alignment on FortPlayerPowerRating_OnPowerRatingProgressUpdated");
static_assert(sizeof(FortPlayerPowerRating_OnPowerRatingProgressUpdated) == 0x000008, "Wrong size on FortPlayerPowerRating_OnPowerRatingProgressUpdated");
static_assert(offsetof(FortPlayerPowerRating_OnPowerRatingProgressUpdated, BaseRatingProgress) == 0x000000, "Member 'FortPlayerPowerRating_OnPowerRatingProgressUpdated::BaseRatingProgress' has a wrong offset!");
static_assert(offsetof(FortPlayerPowerRating_OnPowerRatingProgressUpdated, TeamRatingProgress) == 0x000004, "Member 'FortPlayerPowerRating_OnPowerRatingProgressUpdated::TeamRatingProgress' has a wrong offset!");

// Function FortniteUI.FortPlayerPowerRating.OnTeamPowerRatingUpdated
// 0x0004 (0x0004 - 0x0000)
struct FortPlayerPowerRating_OnTeamPowerRatingUpdated final
{
public:
	int32                                         TeamPowerRating;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortPlayerPowerRating_OnTeamPowerRatingUpdated) == 0x000004, "Wrong alignment on FortPlayerPowerRating_OnTeamPowerRatingUpdated");
static_assert(sizeof(FortPlayerPowerRating_OnTeamPowerRatingUpdated) == 0x000004, "Wrong size on FortPlayerPowerRating_OnTeamPowerRatingUpdated");
static_assert(offsetof(FortPlayerPowerRating_OnTeamPowerRatingUpdated, TeamPowerRating) == 0x000000, "Member 'FortPlayerPowerRating_OnTeamPowerRatingUpdated::TeamPowerRating' has a wrong offset!");

// Function FortniteUI.FortPlayerPowerRating.GetBasePowerRating
// 0x0004 (0x0004 - 0x0000)
struct FortPlayerPowerRating_GetBasePowerRating final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortPlayerPowerRating_GetBasePowerRating) == 0x000004, "Wrong alignment on FortPlayerPowerRating_GetBasePowerRating");
static_assert(sizeof(FortPlayerPowerRating_GetBasePowerRating) == 0x000004, "Wrong size on FortPlayerPowerRating_GetBasePowerRating");
static_assert(offsetof(FortPlayerPowerRating_GetBasePowerRating, ReturnValue) == 0x000000, "Member 'FortPlayerPowerRating_GetBasePowerRating::ReturnValue' has a wrong offset!");

// Function FortniteUI.FortPlayerPowerRating.GetTeamPowerRating
// 0x0004 (0x0004 - 0x0000)
struct FortPlayerPowerRating_GetTeamPowerRating final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortPlayerPowerRating_GetTeamPowerRating) == 0x000004, "Wrong alignment on FortPlayerPowerRating_GetTeamPowerRating");
static_assert(sizeof(FortPlayerPowerRating_GetTeamPowerRating) == 0x000004, "Wrong size on FortPlayerPowerRating_GetTeamPowerRating");
static_assert(offsetof(FortPlayerPowerRating_GetTeamPowerRating, ReturnValue) == 0x000000, "Member 'FortPlayerPowerRating_GetTeamPowerRating::ReturnValue' has a wrong offset!");

// Function FortniteUI.FortPlayerPowerRating.HasTeamMembers
// 0x0001 (0x0001 - 0x0000)
struct FortPlayerPowerRating_HasTeamMembers final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortPlayerPowerRating_HasTeamMembers) == 0x000001, "Wrong alignment on FortPlayerPowerRating_HasTeamMembers");
static_assert(sizeof(FortPlayerPowerRating_HasTeamMembers) == 0x000001, "Wrong size on FortPlayerPowerRating_HasTeamMembers");
static_assert(offsetof(FortPlayerPowerRating_HasTeamMembers, ReturnValue) == 0x000000, "Member 'FortPlayerPowerRating_HasTeamMembers::ReturnValue' has a wrong offset!");

// Function FortniteUI.FortUIScoreReport.GetBadgeScore
// 0x0010 (0x0010 - 0x0000)
struct FortUIScoreReport_GetBadgeScore final
{
public:
	class UFortItem*                              BadgeItem;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortUIScoreReport_GetBadgeScore) == 0x000008, "Wrong alignment on FortUIScoreReport_GetBadgeScore");
static_assert(sizeof(FortUIScoreReport_GetBadgeScore) == 0x000010, "Wrong size on FortUIScoreReport_GetBadgeScore");
static_assert(offsetof(FortUIScoreReport_GetBadgeScore, BadgeItem) == 0x000000, "Member 'FortUIScoreReport_GetBadgeScore::BadgeItem' has a wrong offset!");
static_assert(offsetof(FortUIScoreReport_GetBadgeScore, ReturnValue) == 0x000008, "Member 'FortUIScoreReport_GetBadgeScore::ReturnValue' has a wrong offset!");

// Function FortniteUI.FortUIScoreReport.GetCurrentPlayerPawn
// 0x0010 (0x0010 - 0x0000)
struct FortUIScoreReport_GetCurrentPlayerPawn final
{
public:
	int32                                         ScoreReportIndex;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortUIScoreReport_GetCurrentPlayerPawn) == 0x000008, "Wrong alignment on FortUIScoreReport_GetCurrentPlayerPawn");
static_assert(sizeof(FortUIScoreReport_GetCurrentPlayerPawn) == 0x000010, "Wrong size on FortUIScoreReport_GetCurrentPlayerPawn");
static_assert(offsetof(FortUIScoreReport_GetCurrentPlayerPawn, ScoreReportIndex) == 0x000000, "Member 'FortUIScoreReport_GetCurrentPlayerPawn::ScoreReportIndex' has a wrong offset!");
static_assert(offsetof(FortUIScoreReport_GetCurrentPlayerPawn, ReturnValue) == 0x000008, "Member 'FortUIScoreReport_GetCurrentPlayerPawn::ReturnValue' has a wrong offset!");

// Function FortniteUI.FortUIScoreReport.GetCurrentPlayerState
// 0x0010 (0x0010 - 0x0000)
struct FortUIScoreReport_GetCurrentPlayerState final
{
public:
	int32                                         ScoreReportIndex;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerState*                       ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortUIScoreReport_GetCurrentPlayerState) == 0x000008, "Wrong alignment on FortUIScoreReport_GetCurrentPlayerState");
static_assert(sizeof(FortUIScoreReport_GetCurrentPlayerState) == 0x000010, "Wrong size on FortUIScoreReport_GetCurrentPlayerState");
static_assert(offsetof(FortUIScoreReport_GetCurrentPlayerState, ScoreReportIndex) == 0x000000, "Member 'FortUIScoreReport_GetCurrentPlayerState::ScoreReportIndex' has a wrong offset!");
static_assert(offsetof(FortUIScoreReport_GetCurrentPlayerState, ReturnValue) == 0x000008, "Member 'FortUIScoreReport_GetCurrentPlayerState::ReturnValue' has a wrong offset!");

// Function FortniteUI.FortUIScoreReport.GetDifficultBonusMultiplier
// 0x0004 (0x0004 - 0x0000)
struct FortUIScoreReport_GetDifficultBonusMultiplier final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortUIScoreReport_GetDifficultBonusMultiplier) == 0x000004, "Wrong alignment on FortUIScoreReport_GetDifficultBonusMultiplier");
static_assert(sizeof(FortUIScoreReport_GetDifficultBonusMultiplier) == 0x000004, "Wrong size on FortUIScoreReport_GetDifficultBonusMultiplier");
static_assert(offsetof(FortUIScoreReport_GetDifficultBonusMultiplier, ReturnValue) == 0x000000, "Member 'FortUIScoreReport_GetDifficultBonusMultiplier::ReturnValue' has a wrong offset!");

// Function FortniteUI.FortUIScoreReport.GetDifficultBonusScore
// 0x0004 (0x0004 - 0x0000)
struct FortUIScoreReport_GetDifficultBonusScore final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortUIScoreReport_GetDifficultBonusScore) == 0x000004, "Wrong alignment on FortUIScoreReport_GetDifficultBonusScore");
static_assert(sizeof(FortUIScoreReport_GetDifficultBonusScore) == 0x000004, "Wrong size on FortUIScoreReport_GetDifficultBonusScore");
static_assert(offsetof(FortUIScoreReport_GetDifficultBonusScore, ReturnValue) == 0x000000, "Member 'FortUIScoreReport_GetDifficultBonusScore::ReturnValue' has a wrong offset!");

// Function FortniteUI.FortUIScoreReport.GetLevelProgress
// 0x000C (0x000C - 0x0000)
struct FortUIScoreReport_GetLevelProgress final
{
public:
	int32                                         Level;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DisplayXp;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortUIScoreReport_GetLevelProgress) == 0x000004, "Wrong alignment on FortUIScoreReport_GetLevelProgress");
static_assert(sizeof(FortUIScoreReport_GetLevelProgress) == 0x00000C, "Wrong size on FortUIScoreReport_GetLevelProgress");
static_assert(offsetof(FortUIScoreReport_GetLevelProgress, Level) == 0x000000, "Member 'FortUIScoreReport_GetLevelProgress::Level' has a wrong offset!");
static_assert(offsetof(FortUIScoreReport_GetLevelProgress, DisplayXp) == 0x000004, "Member 'FortUIScoreReport_GetLevelProgress::DisplayXp' has a wrong offset!");
static_assert(offsetof(FortUIScoreReport_GetLevelProgress, ReturnValue) == 0x000008, "Member 'FortUIScoreReport_GetLevelProgress::ReturnValue' has a wrong offset!");

// Function FortniteUI.FortUIScoreReport.GetPlayerCount
// 0x0004 (0x0004 - 0x0000)
struct FortUIScoreReport_GetPlayerCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortUIScoreReport_GetPlayerCount) == 0x000004, "Wrong alignment on FortUIScoreReport_GetPlayerCount");
static_assert(sizeof(FortUIScoreReport_GetPlayerCount) == 0x000004, "Wrong size on FortUIScoreReport_GetPlayerCount");
static_assert(offsetof(FortUIScoreReport_GetPlayerCount, ReturnValue) == 0x000000, "Member 'FortUIScoreReport_GetPlayerCount::ReturnValue' has a wrong offset!");

// Function FortniteUI.FortUIScoreReport.GetPlayerIDFromScoreReportIndex
// 0x0030 (0x0030 - 0x0000)
struct FortUIScoreReport_GetPlayerIDFromScoreReportIndex final
{
public:
	int32                                         ScoreReportIndex;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       OutUniqueNetIdRepl;                                // 0x0008(0x0028)(Parm, OutParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortUIScoreReport_GetPlayerIDFromScoreReportIndex) == 0x000008, "Wrong alignment on FortUIScoreReport_GetPlayerIDFromScoreReportIndex");
static_assert(sizeof(FortUIScoreReport_GetPlayerIDFromScoreReportIndex) == 0x000030, "Wrong size on FortUIScoreReport_GetPlayerIDFromScoreReportIndex");
static_assert(offsetof(FortUIScoreReport_GetPlayerIDFromScoreReportIndex, ScoreReportIndex) == 0x000000, "Member 'FortUIScoreReport_GetPlayerIDFromScoreReportIndex::ScoreReportIndex' has a wrong offset!");
static_assert(offsetof(FortUIScoreReport_GetPlayerIDFromScoreReportIndex, OutUniqueNetIdRepl) == 0x000008, "Member 'FortUIScoreReport_GetPlayerIDFromScoreReportIndex::OutUniqueNetIdRepl' has a wrong offset!");

// Function FortniteUI.FortUIScoreReport.GetPlayerName
// 0x0020 (0x0020 - 0x0000)
struct FortUIScoreReport_GetPlayerName final
{
public:
	int32                                         ScoreReportIndex;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortUIScoreReport_GetPlayerName) == 0x000008, "Wrong alignment on FortUIScoreReport_GetPlayerName");
static_assert(sizeof(FortUIScoreReport_GetPlayerName) == 0x000020, "Wrong size on FortUIScoreReport_GetPlayerName");
static_assert(offsetof(FortUIScoreReport_GetPlayerName, ScoreReportIndex) == 0x000000, "Member 'FortUIScoreReport_GetPlayerName::ScoreReportIndex' has a wrong offset!");
static_assert(offsetof(FortUIScoreReport_GetPlayerName, ReturnValue) == 0x000008, "Member 'FortUIScoreReport_GetPlayerName::ReturnValue' has a wrong offset!");

// Function FortniteUI.FortUIScoreReport.GetPlayerPlatform
// 0x0018 (0x0018 - 0x0000)
struct FortUIScoreReport_GetPlayerPlatform final
{
public:
	int32                                         ScoreReportIndex;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortUIScoreReport_GetPlayerPlatform) == 0x000008, "Wrong alignment on FortUIScoreReport_GetPlayerPlatform");
static_assert(sizeof(FortUIScoreReport_GetPlayerPlatform) == 0x000018, "Wrong size on FortUIScoreReport_GetPlayerPlatform");
static_assert(offsetof(FortUIScoreReport_GetPlayerPlatform, ScoreReportIndex) == 0x000000, "Member 'FortUIScoreReport_GetPlayerPlatform::ScoreReportIndex' has a wrong offset!");
static_assert(offsetof(FortUIScoreReport_GetPlayerPlatform, ReturnValue) == 0x000008, "Member 'FortUIScoreReport_GetPlayerPlatform::ReturnValue' has a wrong offset!");

// Function FortniteUI.FortUIScoreReport.GetPlayerScore
// 0x000C (0x000C - 0x0000)
struct FortUIScoreReport_GetPlayerScore final
{
public:
	int32                                         ScoreReportIndex;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
