#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FriendNotification

#include "Basic.hpp"


namespace SDK::Params
{

// Function FriendNotification.FriendNotification_C.ExecuteUbergraph_FriendNotification
// 0x0004 (0x0004 - 0x0000)
struct FriendNotification_C_ExecuteUbergraph_FriendNotification final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FriendNotification_C_ExecuteUbergraph_FriendNotification) == 0x000004, "Wrong alignment on FriendNotification_C_ExecuteUbergraph_FriendNotification");
static_assert(sizeof(FriendNotification_C_ExecuteUbergraph_FriendNotification) == 0x000004, "Wrong size on FriendNotification_C_ExecuteUbergraph_FriendNotification");
static_assert(offsetof(FriendNotification_C_ExecuteUbergraph_FriendNotification, EntryPoint) == 0x000000, "Member 'FriendNotification_C_ExecuteUbergraph_FriendNotification::EntryPoint' has a wrong offset!");

// Function FriendNotification.FriendNotification_C.ShowPartyInvites
// 0x0020 (0x0020 - 0x0000)
struct FriendNotification_C_ShowPartyInvites final
{
public:
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetCachedWidget_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatablePanel*                K2Node_DynamicCast_AsCommon_Activatable_Panel;     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FriendNotification_C_ShowPartyInvites) == 0x000008, "Wrong alignment on FriendNotification_C_ShowPartyInvites");
static_assert(sizeof(FriendNotification_C_ShowPartyInvites) == 0x000020, "Wrong size on FriendNotification_C_ShowPartyInvites");
static_assert(offsetof(FriendNotification_C_ShowPartyInvites, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000000, "Member 'FriendNotification_C_ShowPartyInvites::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(FriendNotification_C_ShowPartyInvites, CallFunc_GetCachedWidget_ReturnValue) == 0x000008, "Member 'FriendNotification_C_ShowPartyInvites::CallFunc_GetCachedWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(FriendNotification_C_ShowPartyInvites, K2Node_DynamicCast_AsCommon_Activatable_Panel) == 0x000010, "Member 'FriendNotification_C_ShowPartyInvites::K2Node_DynamicCast_AsCommon_Activatable_Panel' has a wrong offset!");
static_assert(offsetof(FriendNotification_C_ShowPartyInvites, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'FriendNotification_C_ShowPartyInvites::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

