#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FrontendItemViewSettingsManager

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function FrontendItemViewSettingsManager.FrontendItemViewSettingsManager_C.GetItemViewSettings
// 0x0238 (0x0238 - 0x0000)
struct FrontendItemViewSettingsManager_C_GetItemViewSettings final
{
public:
	EFrontEndCamera                               Camera;                                            // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESubGame                                      GameMode;                                          // 0x0001(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	const class UFortItemDefinition*              ItemDefinition;                                    // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortItemViewSettings                  ReturnValue;                                       // 0x0010(0x0034)(Parm, OutParm, ReturnParm, NoDestructor)
	struct FFortItemViewSettings                  Return_Value;                                      // 0x0044(0x0034)(Edit, BlueprintVisible, NoDestructor)
	class UAthenaToyItemDefinition*               K2Node_DynamicCast_AsAthena_Toy_Item_Definition;   // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortItemType                                 CallFunc_GetItemType_ReturnValue;                  // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemType                                 CallFunc_GetItemType_ReturnValue_1;                // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemType                                 CallFunc_GetTemplateType_ReturnValue;              // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemType                                 CallFunc_GetTemplateType_ReturnValue_1;            // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemType                                 CallFunc_GetItemType_ReturnValue_2;                // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_Hero_or_Previews_on_Hero_ReturnValue;  // 0x0086(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortItemType                                 CallFunc_GetTemplateType_ReturnValue_2;            // 0x0087(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaSprayItemDefinition*             K2Node_DynamicCast_AsAthena_Spray_Item_Definition; // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Is_Hero_or_Previews_on_Hero_ReturnValue_1; // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaSkyDiveContrailItemDefinition*   K2Node_DynamicCast_AsAthena_Sky_Dive_Contrail_Item_Definition; // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortItemType                                 CallFunc_GetItemType_ReturnValue_3;                // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortItemType                                 CallFunc_GetTemplateType_ReturnValue_3;            // 0x00A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A6[0x2];                                       // 0x00A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaGliderItemDefinition*            K2Node_DynamicCast_AsAthena_Glider_Item_Definition; // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaPickaxeItemDefinition*           K2Node_DynamicCast_AsAthena_Pickaxe_Item_Definition; // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Vector_IsZero_ReturnValue;                // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Vector_IsZero_ReturnValue_1;              // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsItemDefRandomCustomizationSelector_ReturnValue; // 0x00C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C6[0x2];                                       // 0x00C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EFrontEndCamera>                       K2Node_MakeArray_Array;                            // 0x00C8(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EFrontEndCamera>                       K2Node_MakeArray_Array_1;                          // 0x00E0(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EFrontEndCamera>                       K2Node_MakeArray_Array_2;                          // 0x00F8(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_Array_Contains_ReturnValue_2;             // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10A[0x6];                                      // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EFortItemType>                         K2Node_MakeArray_Array_3;                          // 0x0110(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_Array_Contains_ReturnValue_3;             // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUsingNewFrontEndCameraManagement_ReturnValue; // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_122[0x6];                                      // 0x0122(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EFortItemType>                         K2Node_MakeArray_Array_4;                          // 0x0128(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_Array_Contains_ReturnValue_4;             // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFloatRangeBound                       K2Node_MakeStruct_FloatRangeBound;                 // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFloatRangeBound                       K2Node_MakeStruct_FloatRangeBound_1;               // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue_1;           // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EFortItemType>                         K2Node_MakeArray_Array_5;                          // 0x0158(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	struct FFloatRangeBound                       K2Node_MakeStruct_FloatRangeBound_2;               // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_5;             // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFloatRange                            K2Node_MakeStruct_FloatRange;                      // 0x0174(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFloatRangeBound                       K2Node_MakeStruct_FloatRangeBound_3;               // 0x0184(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFloatRange                            K2Node_MakeStruct_FloatRange_1;                    // 0x018C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFloatRangeBound                       K2Node_MakeStruct_FloatRangeBound_4;               // 0x019C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue_2;           // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EFortItemType>                         K2Node_MakeArray_Array_6;                          // 0x01A8(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	struct FFloatRangeBound                       K2Node_MakeStruct_FloatRangeBound_5;               // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_6;             // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x3];                                      // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFloatRange                            K2Node_MakeStruct_FloatRange_2;                    // 0x01C4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EFortItemType>                         K2Node_MakeArray_Array_7;                          // 0x01D8(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_Array_Contains_ReturnValue_7;             // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EFortItemType>                         K2Node_MakeArray_Array_8;                          // 0x01F0(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	float                                         Temp_float_Variable;                               // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_8;             // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_205[0x3];                                      // 0x0205(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EFortItemType>                         K2Node_MakeArray_Array_9;                          // 0x0208(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_Array_Contains_ReturnValue_9;             // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x021A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21B[0x1];                                      // 0x021B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EFortItemType>                         K2Node_MakeArray_Array_10;                         // 0x0220(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_Array_Contains_ReturnValue_10;            // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FrontendItemViewSettingsManager_C_GetItemViewSettings) == 0x000008, "Wrong alignment on FrontendItemViewSettingsManager_C_GetItemViewSettings");
static_assert(sizeof(FrontendItemViewSettingsManager_C_GetItemViewSettings) == 0x000238, "Wrong size on FrontendItemViewSettingsManager_C_GetItemViewSettings");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, Camera) == 0x000000, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::Camera' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, GameMode) == 0x000001, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::GameMode' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, ItemDefinition) == 0x000008, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::ItemDefinition' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, ReturnValue) == 0x000010, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, Return_Value) == 0x000044, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::Return_Value' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_DynamicCast_AsAthena_Toy_Item_Definition) == 0x000078, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_DynamicCast_AsAthena_Toy_Item_Definition' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_GetItemType_ReturnValue) == 0x000081, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_GetItemType_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_GetItemType_ReturnValue_1) == 0x000082, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_GetItemType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_GetTemplateType_ReturnValue) == 0x000083, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_GetTemplateType_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_GetTemplateType_ReturnValue_1) == 0x000084, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_GetTemplateType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_GetItemType_ReturnValue_2) == 0x000085, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_GetItemType_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_Is_Hero_or_Previews_on_Hero_ReturnValue) == 0x000086, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_Is_Hero_or_Previews_on_Hero_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_GetTemplateType_ReturnValue_2) == 0x000087, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_GetTemplateType_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_DynamicCast_AsAthena_Spray_Item_Definition) == 0x000088, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_DynamicCast_AsAthena_Spray_Item_Definition' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_DynamicCast_bSuccess_1) == 0x000090, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_Is_Hero_or_Previews_on_Hero_ReturnValue_1) == 0x000091, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_Is_Hero_or_Previews_on_Hero_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_DynamicCast_AsAthena_Sky_Dive_Contrail_Item_Definition) == 0x000098, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_DynamicCast_AsAthena_Sky_Dive_Contrail_Item_Definition' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_DynamicCast_bSuccess_2) == 0x0000A0, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_GetItemType_ReturnValue_3) == 0x0000A1, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_GetItemType_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_Not_PreBool_ReturnValue) == 0x0000A2, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_GetTemplateType_ReturnValue_3) == 0x0000A3, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_GetTemplateType_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_BooleanAND_ReturnValue) == 0x0000A4, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000A5, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_DynamicCast_AsAthena_Glider_Item_Definition) == 0x0000A8, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_DynamicCast_AsAthena_Glider_Item_Definition' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_DynamicCast_bSuccess_3) == 0x0000B0, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_DynamicCast_AsAthena_Pickaxe_Item_Definition) == 0x0000B8, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_DynamicCast_AsAthena_Pickaxe_Item_Definition' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_DynamicCast_bSuccess_4) == 0x0000C0, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_Vector_IsZero_ReturnValue) == 0x0000C1, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_Vector_IsZero_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_Vector_IsZero_ReturnValue_1) == 0x0000C2, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_Vector_IsZero_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_IsItemDefRandomCustomizationSelector_ReturnValue) == 0x0000C3, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_IsItemDefRandomCustomizationSelector_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0000C4, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0000C5, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeArray_Array) == 0x0000C8, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_Array_Contains_ReturnValue) == 0x0000D8, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeArray_Array_1) == 0x0000E0, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_Array_Contains_ReturnValue_1) == 0x0000F0, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_Array_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeArray_Array_2) == 0x0000F8, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_Array_Contains_ReturnValue_2) == 0x000108, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_Array_Contains_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_BooleanAND_ReturnValue_1) == 0x000109, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeArray_Array_3) == 0x000110, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_Array_Contains_ReturnValue_3) == 0x000120, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_Array_Contains_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_IsUsingNewFrontEndCameraManagement_ReturnValue) == 0x000121, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_IsUsingNewFrontEndCameraManagement_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeArray_Array_4) == 0x000128, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_Array_Contains_ReturnValue_4) == 0x000138, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_Array_Contains_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_MakeLiteralFloat_ReturnValue) == 0x00013C, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_MakeLiteralFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeStruct_FloatRangeBound) == 0x000140, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeStruct_FloatRangeBound' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeStruct_FloatRangeBound_1) == 0x000148, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeStruct_FloatRangeBound_1' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_MakeLiteralFloat_ReturnValue_1) == 0x000150, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_MakeLiteralFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeArray_Array_5) == 0x000158, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeArray_Array_5' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeStruct_FloatRangeBound_2) == 0x000168, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeStruct_FloatRangeBound_2' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_Array_Contains_ReturnValue_5) == 0x000170, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_Array_Contains_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeStruct_FloatRange) == 0x000174, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeStruct_FloatRange' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeStruct_FloatRangeBound_3) == 0x000184, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeStruct_FloatRangeBound_3' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeStruct_FloatRange_1) == 0x00018C, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeStruct_FloatRange_1' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeStruct_FloatRangeBound_4) == 0x00019C, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeStruct_FloatRangeBound_4' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_MakeLiteralFloat_ReturnValue_2) == 0x0001A4, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_MakeLiteralFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeArray_Array_6) == 0x0001A8, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeArray_Array_6' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeStruct_FloatRangeBound_5) == 0x0001B8, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeStruct_FloatRangeBound_5' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_Array_Contains_ReturnValue_6) == 0x0001C0, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_Array_Contains_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeStruct_FloatRange_2) == 0x0001C4, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeStruct_FloatRange_2' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeArray_Array_7) == 0x0001D8, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeArray_Array_7' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_Array_Contains_ReturnValue_7) == 0x0001E8, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_Array_Contains_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeArray_Array_8) == 0x0001F0, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeArray_Array_8' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, Temp_float_Variable) == 0x000200, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_Array_Contains_ReturnValue_8) == 0x000204, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_Array_Contains_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeArray_Array_9) == 0x000208, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeArray_Array_9' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_Array_Contains_ReturnValue_9) == 0x000218, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_Array_Contains_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, Temp_bool_Variable) == 0x000219, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_BooleanOR_ReturnValue) == 0x00021A, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_Select_Default) == 0x00021C, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeArray_Array_10) == 0x000220, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeArray_Array_10' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_Array_Contains_ReturnValue_10) == 0x000230, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_Array_Contains_ReturnValue_10' has a wrong offset!");

// Function FrontendItemViewSettingsManager.FrontendItemViewSettingsManager_C.Is Hero or Previews on Hero
// 0x0028 (0x0028 - 0x0000)
struct FrontendItemViewSettingsManager_C_Is_Hero_or_Previews_on_Hero final
{
public:
	class UFortItemDefinition*                    Item_Definition;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EFortItemType>                         K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	EFortItemType                                 CallFunc_GetItemType_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldShowPreviewOnCurrentHero_ReturnValue; // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FrontendItemViewSettingsManager_C_Is_Hero_or_Previews_on_Hero) == 0x000008, "Wrong alignment on FrontendItemViewSettingsManager_C_Is_Hero_or_Previews_on_Hero");
static_assert(sizeof(FrontendItemViewSettingsManager_C_Is_Hero_or_Previews_on_Hero) == 0x000028, "Wrong size on FrontendItemViewSettingsManager_C_Is_Hero_or_Previews_on_Hero");
static_assert(offsetof(FrontendItemViewSettingsManager_C_Is_Hero_or_Previews_on_Hero, Item_Definition) == 0x000000, "Member 'FrontendItemViewSettingsManager_C_Is_Hero_or_Previews_on_Hero::Item_Definition' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_Is_Hero_or_Previews_on_Hero, ReturnValue) == 0x000008, "Member 'FrontendItemViewSettingsManager_C_Is_Hero_or_Previews_on_Hero::ReturnValue' has a wrong offset!");
