#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_AthenaExitVehicle

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_AthenaExitVehicle.GA_AthenaExitVehicle_C.ExecuteUbergraph_GA_AthenaExitVehicle
// 0x00A0 (0x00A0 - 0x0000)
struct GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0008(0x0040)(ContainsInstancedReference)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAthenaVehicle*                     CallFunc_ServerOnExitVehicle_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x0068(0x0028)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0090(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle) == 0x000008, "Wrong alignment on GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle");
static_assert(sizeof(GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle) == 0x0000A0, "Wrong size on GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle");
static_assert(offsetof(GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle, EntryPoint) == 0x000000, "Member 'GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle, CallFunc_K2_CommitAbility_ReturnValue) == 0x000004, "Member 'GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle, CallFunc_GetActorInfo_ReturnValue) == 0x000008, "Member 'GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000048, "Member 'GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle, CallFunc_ServerOnExitVehicle_ReturnValue) == 0x000058, "Member 'GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle::CallFunc_ServerOnExitVehicle_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle, CallFunc_HasAuthority_ReturnValue) == 0x000060, "Member 'GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x000068, "Member 'GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000090, "Member 'GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");

}

