#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_AthenaEnterVehicle

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_AthenaEnterVehicle.GA_AthenaEnterVehicle_C.ExecuteUbergraph_GA_AthenaEnterVehicle
// 0x0098 (0x0098 - 0x0000)
struct GA_AthenaEnterVehicle_C_ExecuteUbergraph_GA_AthenaEnterVehicle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0008(0x0040)(ContainsInstancedReference)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x0058(0x0028)()
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0080(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0088(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(GA_AthenaEnterVehicle_C_ExecuteUbergraph_GA_AthenaEnterVehicle) == 0x000008, "Wrong alignment on GA_AthenaEnterVehicle_C_ExecuteUbergraph_GA_AthenaEnterVehicle");
static_assert(sizeof(GA_AthenaEnterVehicle_C_ExecuteUbergraph_GA_AthenaEnterVehicle) == 0x000098, "Wrong size on GA_AthenaEnterVehicle_C_ExecuteUbergraph_GA_AthenaEnterVehicle");
static_assert(offsetof(GA_AthenaEnterVehicle_C_ExecuteUbergraph_GA_AthenaEnterVehicle, EntryPoint) == 0x000000, "Member 'GA_AthenaEnterVehicle_C_ExecuteUbergraph_GA_AthenaEnterVehicle::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_AthenaEnterVehicle_C_ExecuteUbergraph_GA_AthenaEnterVehicle, CallFunc_K2_CommitAbility_ReturnValue) == 0x000004, "Member 'GA_AthenaEnterVehicle_C_ExecuteUbergraph_GA_AthenaEnterVehicle::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_AthenaEnterVehicle_C_ExecuteUbergraph_GA_AthenaEnterVehicle, CallFunc_GetActorInfo_ReturnValue) == 0x000008, "Member 'GA_AthenaEnterVehicle_C_ExecuteUbergraph_GA_AthenaEnterVehicle::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_AthenaEnterVehicle_C_ExecuteUbergraph_GA_AthenaEnterVehicle, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000048, "Member 'GA_AthenaEnterVehicle_C_ExecuteUbergraph_GA_AthenaEnterVehicle::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_AthenaEnterVehicle_C_ExecuteUbergraph_GA_AthenaEnterVehicle, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'GA_AthenaEnterVehicle_C_ExecuteUbergraph_GA_AthenaEnterVehicle::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_AthenaEnterVehicle_C_ExecuteUbergraph_GA_AthenaEnterVehicle, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x000058, "Member 'GA_AthenaEnterVehicle_C_ExecuteUbergraph_GA_AthenaEnterVehicle::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_AthenaEnterVehicle_C_ExecuteUbergraph_GA_AthenaEnterVehicle, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000080, "Member 'GA_AthenaEnterVehicle_C_ExecuteUbergraph_GA_AthenaEnterVehicle::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_AthenaEnterVehicle_C_ExecuteUbergraph_GA_AthenaEnterVehicle, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000088, "Member 'GA_AthenaEnterVehicle_C_ExecuteUbergraph_GA_AthenaEnterVehicle::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");

}

