#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_DudeBro_Vent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_DudeBro_Vent.GA_DudeBro_Vent_C
// 0x0038 (0x0978 - 0x0940)
class UGA_DudeBro_Vent_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0940(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 VehicleSkelMesh;                                   // 0x0948(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0950(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GravFloorAltitude;                                 // 0x0958(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         UpwardLaunchVelocity;                              // 0x095C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         VentsHitBeforeLanding;                             // 0x0960(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	int32                                         NumVentsToHitForQuest;                             // 0x0970(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_DudeBro_Vent(int32 EntryPoint);
	void MovementModeChangedDelegate_Event_0(class ACharacter* Character, EMovementMode PrevMovementMode, uint8 PreviousCustomMode);
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void PlayerCapsuleHit(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_DudeBro_Vent_C">();
	}
	static class UGA_DudeBro_Vent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_DudeBro_Vent_C>();
	}
};
static_assert(alignof(UGA_DudeBro_Vent_C) == 0x000008, "Wrong alignment on UGA_DudeBro_Vent_C");
static_assert(sizeof(UGA_DudeBro_Vent_C) == 0x000978, "Wrong size on UGA_DudeBro_Vent_C");
static_assert(offsetof(UGA_DudeBro_Vent_C, UberGraphFrame) == 0x000940, "Member 'UGA_DudeBro_Vent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_DudeBro_Vent_C, VehicleSkelMesh) == 0x000948, "Member 'UGA_DudeBro_Vent_C::VehicleSkelMesh' has a wrong offset!");
static_assert(offsetof(UGA_DudeBro_Vent_C, PlayerPawn) == 0x000950, "Member 'UGA_DudeBro_Vent_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(UGA_DudeBro_Vent_C, GravFloorAltitude) == 0x000958, "Member 'UGA_DudeBro_Vent_C::GravFloorAltitude' has a wrong offset!");
static_assert(offsetof(UGA_DudeBro_Vent_C, UpwardLaunchVelocity) == 0x00095C, "Member 'UGA_DudeBro_Vent_C::UpwardLaunchVelocity' has a wrong offset!");
static_assert(offsetof(UGA_DudeBro_Vent_C, VentsHitBeforeLanding) == 0x000960, "Member 'UGA_DudeBro_Vent_C::VentsHitBeforeLanding' has a wrong offset!");
static_assert(offsetof(UGA_DudeBro_Vent_C, NumVentsToHitForQuest) == 0x000970, "Member 'UGA_DudeBro_Vent_C::NumVentsToHitForQuest' has a wrong offset!");

}

