#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_GM_OnDmgDealtBase

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_GM_OnDmgDealtBase.GA_GM_OnDmgDealtBase_C.ExecuteUbergraph_GA_GM_OnDmgDealtBase
// 0x00C0 (0x00C0 - 0x0000)
struct GA_GM_OnDmgDealtBase_C_ExecuteUbergraph_GA_GM_OnDmgDealtBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0008(0x00B0)(ConstParm)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_GM_OnDmgDealtBase_C_ExecuteUbergraph_GA_GM_OnDmgDealtBase) == 0x000008, "Wrong alignment on GA_GM_OnDmgDealtBase_C_ExecuteUbergraph_GA_GM_OnDmgDealtBase");
static_assert(sizeof(GA_GM_OnDmgDealtBase_C_ExecuteUbergraph_GA_GM_OnDmgDealtBase) == 0x0000C0, "Wrong size on GA_GM_OnDmgDealtBase_C_ExecuteUbergraph_GA_GM_OnDmgDealtBase");
static_assert(offsetof(GA_GM_OnDmgDealtBase_C_ExecuteUbergraph_GA_GM_OnDmgDealtBase, EntryPoint) == 0x000000, "Member 'GA_GM_OnDmgDealtBase_C_ExecuteUbergraph_GA_GM_OnDmgDealtBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_GM_OnDmgDealtBase_C_ExecuteUbergraph_GA_GM_OnDmgDealtBase, K2Node_Event_EventData) == 0x000008, "Member 'GA_GM_OnDmgDealtBase_C_ExecuteUbergraph_GA_GM_OnDmgDealtBase::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_GM_OnDmgDealtBase_C_ExecuteUbergraph_GA_GM_OnDmgDealtBase, CallFunc_K2_CommitAbility_ReturnValue) == 0x0000B8, "Member 'GA_GM_OnDmgDealtBase_C_ExecuteUbergraph_GA_GM_OnDmgDealtBase::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");

// Function GA_GM_OnDmgDealtBase.GA_GM_OnDmgDealtBase_C.DoOnDmgDealtBehavior
// 0x00B0 (0x00B0 - 0x0000)
struct GA_GM_OnDmgDealtBase_C_DoOnDmgDealtBehavior final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_GM_OnDmgDealtBase_C_DoOnDmgDealtBehavior) == 0x000008, "Wrong alignment on GA_GM_OnDmgDealtBase_C_DoOnDmgDealtBehavior");
static_assert(sizeof(GA_GM_OnDmgDealtBase_C_DoOnDmgDealtBehavior) == 0x0000B0, "Wrong size on GA_GM_OnDmgDealtBase_C_DoOnDmgDealtBehavior");
static_assert(offsetof(GA_GM_OnDmgDealtBase_C_DoOnDmgDealtBehavior, EventData) == 0x000000, "Member 'GA_GM_OnDmgDealtBase_C_DoOnDmgDealtBehavior::EventData' has a wrong offset!");

// Function GA_GM_OnDmgDealtBase.GA_GM_OnDmgDealtBase_C.K2_ActivateAbilityFromEvent
// 0x00B0 (0x00B0 - 0x0000)
struct GA_GM_OnDmgDealtBase_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_GM_OnDmgDealtBase_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on GA_GM_OnDmgDealtBase_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_GM_OnDmgDealtBase_C_K2_ActivateAbilityFromEvent) == 0x0000B0, "Wrong size on GA_GM_OnDmgDealtBase_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_GM_OnDmgDealtBase_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GA_GM_OnDmgDealtBase_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

}

