#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_GenericDeath

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function GAB_GenericDeath.GAB_GenericDeath_C.ExecuteUbergraph_GAB_GenericDeath
// 0x02D0 (0x02D0 - 0x0000)
struct GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue_1;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43[0xD];                                       // 0x0043(0x000D)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0050(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput; // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_VictoryDrone_C*                     CallFunc_FinishSpawningActor_ReturnValue;          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x00AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_2;        // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_3;        // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AE[0x2];                                       // 0x00AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00B0(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   CallFunc_GetRandomSectionName_SectionName;         // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetRandomSectionName_SectionName_1;       // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetRandomSectionName_SectionName_2;       // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetRandomSectionName_SectionName_3;       // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_4;        // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_5;        // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_6;        // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_7;        // 0x00E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetRandomSectionName_SectionName_4;       // 0x00F4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetRandomSectionName_SectionName_5;       // 0x00FC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetRandomSectionName_SectionName_6;       // 0x0104(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetRandomSectionName_SectionName_7;       // 0x010C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0114(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue_2;          // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortAIPawn*                            K2Node_DynamicCast_AsFort_AIPawn;                  // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortDamageZone                               CallFunc_GetDamageZone_ReturnValue;                // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13B[0x5];                                      // 0x013B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0140(0x00B0)(ConstParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x01F0(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   CallFunc_SetFNameBasedOnHitDirection_NameResult;   // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0208(0x00B8)(ContainsInstancedReference)
	class FName                                   CallFunc_SetFNameBasedOnHitDirection_NameResult_1; // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath) == 0x000010, "Wrong alignment on GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath");
static_assert(sizeof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath) == 0x0002D0, "Wrong size on GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath");
static_assert(offsetof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath, EntryPoint) == 0x000000, "Member 'GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath::EntryPoint' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath, CallFunc_GetActivatingPawn_ReturnValue) == 0x000018, "Member 'GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath::CallFunc_GetActivatingPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath, K2Node_Event_bWasCancelled) == 0x000020, "Member 'GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath, CallFunc_GetActivatingPawn_ReturnValue_1) == 0x000028, "Member 'GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath::CallFunc_GetActivatingPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath, CallFunc_HasAuthority_ReturnValue) == 0x000030, "Member 'GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000038, "Member 'GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath, CallFunc_Not_PreBool_ReturnValue) == 0x000041, "Member 'GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath, CallFunc_BooleanAND_ReturnValue) == 0x000042, "Member 'GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000050, "Member 'GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000080, "Member 'GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath, CallFunc_HasAnyMatchingGameplayTags_self_CastInput) == 0x000088, "Member 'GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath::CallFunc_HasAnyMatchingGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x000098, "Member 'GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000A0, "Member 'GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath, CallFunc_BooleanOR_ReturnValue) == 0x0000A8, "Member 'GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath, CallFunc_BooleanAND_ReturnValue_1) == 0x0000A9, "Member 'GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0000AA, "Member 'GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x0000AB, "Member 'GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath, CallFunc_EqualEqual_NameName_ReturnValue_2) == 0x0000AC, "Member 'GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath::CallFunc_EqualEqual_NameName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath, CallFunc_EqualEqual_NameName_ReturnValue_3) == 0x0000AD, "Member 'GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath::CallFunc_EqualEqual_NameName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000B0, "Member 'GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath, CallFunc_GetRandomSectionName_SectionName) == 0x0000C0, "Member 'GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath::CallFunc_GetRandomSectionName_SectionName' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath, CallFunc_GetRandomSectionName_SectionName_1) == 0x0000C8, "Member 'GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath::CallFunc_GetRandomSectionName_SectionName_1' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath, CallFunc_GetRandomSectionName_SectionName_2) == 0x0000D0, "Member 'GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath::CallFunc_GetRandomSectionName_SectionName_2' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath, CallFunc_GetRandomSectionName_SectionName_3) == 0x0000D8, "Member 'GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath::CallFunc_GetRandomSectionName_SectionName_3' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath, CallFunc_EqualEqual_NameName_ReturnValue_4) == 0x0000E0, "Member 'GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath::CallFunc_EqualEqual_NameName_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath, CallFunc_EqualEqual_NameName_ReturnValue_5) == 0x0000E1, "Member 'GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath::CallFunc_EqualEqual_NameName_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath, CallFunc_EqualEqual_NameName_ReturnValue_6) == 0x0000E2, "Member 'GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath::CallFunc_EqualEqual_NameName_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath, CallFunc_EqualEqual_NameName_ReturnValue_7) == 0x0000E3, "Member 'GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath::CallFunc_EqualEqual_NameName_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x0000E8, "Member 'GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath, CallFunc_IsValid_ReturnValue) == 0x0000F0, "Member 'GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath, CallFunc_GetRandomSectionName_SectionName_4) == 0x0000F4, "Member 'GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath::CallFunc_GetRandomSectionName_SectionName_4' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath, CallFunc_GetRandomSectionName_SectionName_5) == 0x0000FC, "Member 'GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath::CallFunc_GetRandomSectionName_SectionName_5' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath, CallFunc_GetRandomSectionName_SectionName_6) == 0x000104, "Member 'GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath::CallFunc_GetRandomSectionName_SectionName_6' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath, CallFunc_GetRandomSectionName_SectionName_7) == 0x00010C, "Member 'GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath::CallFunc_GetRandomSectionName_SectionName_7' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath, K2Node_CreateDelegate_OutputDelegate_2) == 0x000114, "Member 'GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath, CallFunc_GetActivatingPawn_ReturnValue_2) == 0x000128, "Member 'GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath::CallFunc_GetActivatingPawn_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath, K2Node_DynamicCast_AsFort_AIPawn) == 0x000130, "Member 'GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath::K2Node_DynamicCast_AsFort_AIPawn' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath, K2Node_DynamicCast_bSuccess_1) == 0x000138, "Member 'GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath, CallFunc_GetDamageZone_ReturnValue) == 0x000139, "Member 'GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath::CallFunc_GetDamageZone_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00013A, "Member 'GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath, K2Node_Event_EventData) == 0x000140, "Member 'GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath, K2Node_CreateDelegate_OutputDelegate_3) == 0x0001F0, "Member 'GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath, CallFunc_SetFNameBasedOnHitDirection_NameResult) == 0x000200, "Member 'GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath::CallFunc_SetFNameBasedOnHitDirection_NameResult' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000208, "Member 'GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath, CallFunc_SetFNameBasedOnHitDirection_NameResult_1) == 0x0002C0, "Member 'GAB_GenericDeath_C_ExecuteUbergraph_GAB_GenericDeath::CallFunc_SetFNameBasedOnHitDirection_NameResult_1' has a wrong offset!");

// Function GAB_GenericDeath.GAB_GenericDeath_C.K2_ActivateAbilityFromEvent
// 0x00B0 (0x00B0 - 0x0000)
struct GAB_GenericDeath_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GAB_GenericDeath_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on GAB_GenericDeath_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GAB_GenericDeath_C_K2_ActivateAbilityFromEvent) == 0x0000B0, "Wrong size on GAB_GenericDeath_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GAB_GenericDeath_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GAB_GenericDeath_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function GAB_GenericDeath.GAB_GenericDeath_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GAB_GenericDeath_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GAB_GenericDeath_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GAB_GenericDeath_C_K2_OnEndAbility");
static_assert(sizeof(GAB_GenericDeath_C_K2_OnEndAbility) == 0x000001, "Wrong size on GAB_GenericDeath_C_K2_OnEndAbility");
static_assert(offsetof(GAB_GenericDeath_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GAB_GenericDeath_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GAB_GenericDeath.GAB_GenericDeath_C.InitializeDeathHitDirection
// 0x0158 (0x0158 - 0x0000)
struct GAB_GenericDeath_C_InitializeDeathHitDirection final
{
public:
	struct FGameplayEventData                     EventHitData;                                      // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FVector                                CallFunc_GetImpulseData_ImpulseDirection;          // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetImpulseData_KnockbackMagnitude;        // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetImpulseData_KnockbackZAngle;           // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_EffectContextGetHitResult_ReturnValue;    // 0x00C4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x014C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_GenericDeath_C_InitializeDeathHitDirection) == 0x000008, "Wrong alignment on GAB_GenericDeath_C_InitializeDeathHitDirection");
static_assert(sizeof(GAB_GenericDeath_C_InitializeDeathHitDirection) == 0x000158, "Wrong size on GAB_GenericDeath_C_InitializeDeathHitDirection");
static_assert(offsetof(GAB_GenericDeath_C_InitializeDeathHitDirection, EventHitData) == 0x000000, "Member 'GAB_GenericDeath_C_InitializeDeathHitDirection::EventHitData' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_InitializeDeathHitDirection, CallFunc_GetImpulseData_ImpulseDirection) == 0x0000B0, "Member 'GAB_GenericDeath_C_InitializeDeathHitDirection::CallFunc_GetImpulseData_ImpulseDirection' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_InitializeDeathHitDirection, CallFunc_GetImpulseData_KnockbackMagnitude) == 0x0000BC, "Member 'GAB_GenericDeath_C_InitializeDeathHitDirection::CallFunc_GetImpulseData_KnockbackMagnitude' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_InitializeDeathHitDirection, CallFunc_GetImpulseData_KnockbackZAngle) == 0x0000C0, "Member 'GAB_GenericDeath_C_InitializeDeathHitDirection::CallFunc_GetImpulseData_KnockbackZAngle' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_InitializeDeathHitDirection, CallFunc_EffectContextGetHitResult_ReturnValue) == 0x0000C4, "Member 'GAB_GenericDeath_C_InitializeDeathHitDirection::CallFunc_EffectContextGetHitResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_InitializeDeathHitDirection, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00014C, "Member 'GAB_GenericDeath_C_InitializeDeathHitDirection::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");

// Function GAB_GenericDeath.GAB_GenericDeath_C.GetRandomSectionName
// 0x0070 (0x0070 - 0x0000)
struct GAB_GenericDeath_C_GetRandomSectionName final
{
public:
	int32                                         MaxNumberOfSections;                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   OriginalSectionName;                               // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SectionName;                                       // 0x000C(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomInteger_ReturnValue;                // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_GenericDeath_C_GetRandomSectionName) == 0x000008, "Wrong alignment on GAB_GenericDeath_C_GetRandomSectionName");
static_assert(sizeof(GAB_GenericDeath_C_GetRandomSectionName) == 0x000070, "Wrong size on GAB_GenericDeath_C_GetRandomSectionName");
static_assert(offsetof(GAB_GenericDeath_C_GetRandomSectionName, MaxNumberOfSections) == 0x000000, "Member 'GAB_GenericDeath_C_GetRandomSectionName::MaxNumberOfSections' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_GetRandomSectionName, OriginalSectionName) == 0x000004, "Member 'GAB_GenericDeath_C_GetRandomSectionName::OriginalSectionName' has a wrong offset!");
static_assert(offsetof(GAB_GenericDeath_C_GetRandomSectionName, SectionName) == 0x00000C, "Member 'GAB_GenericDeath_C_GetRandomSectionName::SectionName' has a wrong offset!");
