#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_Emote_Generic

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GAB_Emote_Generic.GAB_Emote_Generic_C.ExecuteUbergraph_GAB_Emote_Generic
// 0x01E0 (0x01E0 - 0x0000)
struct GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x0008(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable_1;                            // 0x0050(0x0028)()
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage;                 // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortGameplayAbilityMontageSectionToPlay      Temp_byte_Variable;                                // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortGameplayAbilityMontageSectionToPlay      Temp_byte_Variable_1;                              // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilityTask_PlayMontageWaitTarget* CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue; // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDefaultBlendOutTime_ReturnValue;       // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetCurrentSourceObject_ReturnValue;       // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMontageItemDefinitionBase*         K2Node_DynamicCast_AsFort_Montage_Item_Definition_Base; // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_1;                   // 0x00C8(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_1;               // 0x00F0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_PickRandomSectionByName_ReturnValue;      // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldPlayRandomSectionByName_ReturnValue; // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortGameplayAbilityMontageSectionToPlay      K2Node_Select_Default;                             // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortCustomBodyType                           CallFunc_GetBodyTypeAndGender_BodyType;            // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortCustomGender                             CallFunc_GetBodyTypeAndGender_Gender;              // 0x0103(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UAnimMontage>            CallFunc_GetMontageToPlay_ReturnValue;             // 0x0108(0x0028)(HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0130(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsAssetNull_ReturnValue;                  // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue;            // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue_1;          // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x016C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetCurrentSourceObject_ReturnValue_1;     // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMontageItemDefinitionBase*         K2Node_DynamicCast_AsFort_Montage_Item_Definition_Base_1; // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_2;                   // 0x0198(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_2;               // 0x01C0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldHolsterWeapon_ReturnValue;          // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x3];                                      // 0x01C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x01CC(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic) == 0x000008, "Wrong alignment on GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic");
static_assert(sizeof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic) == 0x0001E0, "Wrong size on GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, EntryPoint) == 0x000000, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::EntryPoint' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, K2Node_CustomEvent_TargetData) == 0x000008, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::K2Node_CustomEvent_TargetData' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, K2Node_CustomEvent_ApplicationTag) == 0x000030, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::K2Node_CustomEvent_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, Temp_struct_Variable) == 0x000048, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, Temp_struct_Variable_1) == 0x000050, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, K2Node_CustomEvent_Loaded) == 0x000078, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, Temp_object_Variable) == 0x000080, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, K2Node_DynamicCast_AsAnim_Montage) == 0x000088, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::K2Node_DynamicCast_AsAnim_Montage' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, Temp_bool_Variable) == 0x000091, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, Temp_byte_Variable) == 0x000092, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, Temp_byte_Variable_1) == 0x000093, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue) == 0x000098, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, CallFunc_IsValid_ReturnValue) == 0x0000A0, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, CallFunc_GetDefaultBlendOutTime_ReturnValue) == 0x0000A4, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::CallFunc_GetDefaultBlendOutTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, CallFunc_IsValid_ReturnValue_1) == 0x0000A8, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, CallFunc_GetCurrentSourceObject_ReturnValue) == 0x0000B0, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::CallFunc_GetCurrentSourceObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, K2Node_DynamicCast_AsFort_Montage_Item_Definition_Base) == 0x0000B8, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::K2Node_DynamicCast_AsFort_Montage_Item_Definition_Base' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, K2Node_DynamicCast_bSuccess_1) == 0x0000C0, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, K2Node_CustomEvent_TargetData_1) == 0x0000C8, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::K2Node_CustomEvent_TargetData_1' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, K2Node_CustomEvent_ApplicationTag_1) == 0x0000F0, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::K2Node_CustomEvent_ApplicationTag_1' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, CallFunc_PickRandomSectionByName_ReturnValue) == 0x0000F8, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::CallFunc_PickRandomSectionByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, CallFunc_ShouldPlayRandomSectionByName_ReturnValue) == 0x000100, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::CallFunc_ShouldPlayRandomSectionByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, K2Node_Select_Default) == 0x000101, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, CallFunc_GetBodyTypeAndGender_BodyType) == 0x000102, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::CallFunc_GetBodyTypeAndGender_BodyType' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, CallFunc_GetBodyTypeAndGender_Gender) == 0x000103, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::CallFunc_GetBodyTypeAndGender_Gender' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, CallFunc_GetMontageToPlay_ReturnValue) == 0x000108, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::CallFunc_GetMontageToPlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, K2Node_CreateDelegate_OutputDelegate_1) == 0x000130, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, CallFunc_IsAssetNull_ReturnValue) == 0x000140, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::CallFunc_IsAssetNull_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, CallFunc_GetActivatingPawn_ReturnValue) == 0x000148, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::CallFunc_GetActivatingPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, CallFunc_IsValid_ReturnValue_2) == 0x000150, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, CallFunc_GetActivatingPawn_ReturnValue_1) == 0x000158, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::CallFunc_GetActivatingPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000160, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, K2Node_DynamicCast_bSuccess_2) == 0x000168, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, K2Node_CreateDelegate_OutputDelegate_2) == 0x00016C, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, CallFunc_GetCurrentSourceObject_ReturnValue_1) == 0x000180, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::CallFunc_GetCurrentSourceObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, K2Node_DynamicCast_AsFort_Montage_Item_Definition_Base_1) == 0x000188, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::K2Node_DynamicCast_AsFort_Montage_Item_Definition_Base_1' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, K2Node_DynamicCast_bSuccess_3) == 0x000190, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, K2Node_CustomEvent_TargetData_2) == 0x000198, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::K2Node_CustomEvent_TargetData_2' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, K2Node_CustomEvent_ApplicationTag_2) == 0x0001C0, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::K2Node_CustomEvent_ApplicationTag_2' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, CallFunc_ShouldHolsterWeapon_ReturnValue) == 0x0001C8, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::CallFunc_ShouldHolsterWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, K2Node_CreateDelegate_OutputDelegate_3) == 0x0001CC, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");

// Function GAB_Emote_Generic.GAB_Emote_Generic_C.OnLoaded_D5C2B0D14DEB9277D15965B97800FD1D
// 0x0008 (0x0008 - 0x0000)
struct GAB_Emote_Generic_C_OnLoaded_D5C2B0D14DEB9277D15965B97800FD1D final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_Emote_Generic_C_OnLoaded_D5C2B0D14DEB9277D15965B97800FD1D) == 0x000008, "Wrong alignment on GAB_Emote_Generic_C_OnLoaded_D5C2B0D14DEB9277D15965B97800FD1D");
static_assert(sizeof(GAB_Emote_Generic_C_OnLoaded_D5C2B0D14DEB9277D15965B97800FD1D) == 0x000008, "Wrong size on GAB_Emote_Generic_C_OnLoaded_D5C2B0D14DEB9277D15965B97800FD1D");
static_assert(offsetof(GAB_Emote_Generic_C_OnLoaded_D5C2B0D14DEB9277D15965B97800FD1D, Loaded) == 0x000000, "Member 'GAB_Emote_Generic_C_OnLoaded_D5C2B0D14DEB9277D15965B97800FD1D::Loaded' has a wrong offset!");

// Function GAB_Emote_Generic.GAB_Emote_Generic_C.Triggered_DE7019AA4E006879EDD264899869FEE2
// 0x0030 (0x0030 - 0x0000)
struct GAB_Emote_Generic_C_Triggered_DE7019AA4E006879EDD264899869FEE2 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_Emote_Generic_C_Triggered_DE7019AA4E006879EDD264899869FEE2) == 0x000008, "Wrong alignment on GAB_Emote_Generic_C_Triggered_DE7019AA4E006879EDD264899869FEE2");
static_assert(sizeof(GAB_Emote_Generic_C_Triggered_DE7019AA4E006879EDD264899869FEE2) == 0x000030, "Wrong size on GAB_Emote_Generic_C_Triggered_DE7019AA4E006879EDD264899869FEE2");
static_assert(offsetof(GAB_Emote_Generic_C_Triggered_DE7019AA4E006879EDD264899869FEE2, TargetData) == 0x000000, "Member 'GAB_Emote_Generic_C_Triggered_DE7019AA4E006879EDD264899869FEE2::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_Triggered_DE7019AA4E006879EDD264899869FEE2, ApplicationTag) == 0x000028, "Member 'GAB_Emote_Generic_C_Triggered_DE7019AA4E006879EDD264899869FEE2::ApplicationTag' has a wrong offset!");

// Function GAB_Emote_Generic.GAB_Emote_Generic_C.Cancelled_DE7019AA4E006879EDD264899869FEE2
// 0x0030 (0x0030 - 0x0000)
struct GAB_Emote_Generic_C_Cancelled_DE7019AA4E006879EDD264899869FEE2 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_Emote_Generic_C_Cancelled_DE7019AA4E006879EDD264899869FEE2) == 0x000008, "Wrong alignment on GAB_Emote_Generic_C_Cancelled_DE7019AA4E006879EDD264899869FEE2");
static_assert(sizeof(GAB_Emote_Generic_C_Cancelled_DE7019AA4E006879EDD264899869FEE2) == 0x000030, "Wrong size on GAB_Emote_Generic_C_Cancelled_DE7019AA4E006879EDD264899869FEE2");
static_assert(offsetof(GAB_Emote_Generic_C_Cancelled_DE7019AA4E006879EDD264899869FEE2, TargetData) == 0x000000, "Member 'GAB_Emote_Generic_C_Cancelled_DE7019AA4E006879EDD264899869FEE2::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_Cancelled_DE7019AA4E006879EDD264899869FEE2, ApplicationTag) == 0x000028, "Member 'GAB_Emote_Generic_C_Cancelled_DE7019AA4E006879EDD264899869FEE2::ApplicationTag' has a wrong offset!");

// Function GAB_Emote_Generic.GAB_Emote_Generic_C.Completed_DE7019AA4E006879EDD264899869FEE2
// 0x0030 (0x0030 - 0x0000)
struct GAB_Emote_Generic_C_Completed_DE7019AA4E006879EDD264899869FEE2 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_Emote_Generic_C_Completed_DE7019AA4E006879EDD264899869FEE2) == 0x000008, "Wrong alignment on GAB_Emote_Generic_C_Completed_DE7019AA4E006879EDD264899869FEE2");
static_assert(sizeof(GAB_Emote_Generic_C_Completed_DE7019AA4E006879EDD264899869FEE2) == 0x000030, "Wrong size on GAB_Emote_Generic_C_Completed_DE7019AA4E006879EDD264899869FEE2");
static_assert(offsetof(GAB_Emote_Generic_C_Completed_DE7019AA4E006879EDD264899869FEE2, TargetData) == 0x000000, "Member 'GAB_Emote_Generic_C_Completed_DE7019AA4E006879EDD264899869FEE2::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_Completed_DE7019AA4E006879EDD264899869FEE2, ApplicationTag) == 0x000028, "Member 'GAB_Emote_Generic_C_Completed_DE7019AA4E006879EDD264899869FEE2::ApplicationTag' has a wrong offset!");

// Function GAB_Emote_Generic.GAB_Emote_Generic_C.K2_OnEndAbility
// 0x0028 (0x0028 - 0x0000)
struct GAB_Emote_Generic_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetCurrentSourceObject_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMontageItemDefinitionBase*         K2Node_DynamicCast_AsFort_Montage_Item_Definition_Base; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_Emote_Generic_C_K2_OnEndAbility) == 0x000008, "Wrong alignment on GAB_Emote_Generic_C_K2_OnEndAbility");
static_assert(sizeof(GAB_Emote_Generic_C_K2_OnEndAbility) == 0x000028, "Wrong size on GAB_Emote_Generic_C_K2_OnEndAbility");
static_assert(offsetof(GAB_Emote_Generic_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GAB_Emote_Generic_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_K2_OnEndAbility, CallFunc_GetCurrentSourceObject_ReturnValue) == 0x000008, "Member 'GAB_Emote_Generic_C_K2_OnEndAbility::CallFunc_GetCurrentSourceObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_K2_OnEndAbility, K2Node_DynamicCast_AsFort_Montage_Item_Definition_Base) == 0x000010, "Member 'GAB_Emote_Generic_C_K2_OnEndAbility::K2Node_DynamicCast_AsFort_Montage_Item_Definition_Base' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_K2_OnEndAbility, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'GAB_Emote_Generic_C_K2_OnEndAbility::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_K2_OnEndAbility, CallFunc_GetActivatingPawn_ReturnValue) == 0x000020, "Member 'GAB_Emote_Generic_C_K2_OnEndAbility::CallFunc_GetActivatingPawn_ReturnValue' has a wrong offset!");

// Function GAB_Emote_Generic.GAB_Emote_Generic_C.GetBodyTypeAndGender
// 0x0020 (0x0020 - 0x0000)
struct GAB_Emote_Generic_C_GetBodyTypeAndGender final
{
public:
	EFortCustomBodyType                           BodyType;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortCustomGender                             Gender;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortCustomBodyType                           CallFunc_GetCharacterBodyType_ReturnValue;         // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortCustomGender                             CallFunc_GetCharacterGender_ReturnValue;           // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_Emote_Generic_C_GetBodyTypeAndGender) == 0x000008, "Wrong alignment on GAB_Emote_Generic_C_GetBodyTypeAndGender");
static_assert(sizeof(GAB_Emote_Generic_C_GetBodyTypeAndGender) == 0x000020, "Wrong size on GAB_Emote_Generic_C_GetBodyTypeAndGender");
static_assert(offsetof(GAB_Emote_Generic_C_GetBodyTypeAndGender, BodyType) == 0x000000, "Member 'GAB_Emote_Generic_C_GetBodyTypeAndGender::BodyType' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_GetBodyTypeAndGender, Gender) == 0x000001, "Member 'GAB_Emote_Generic_C_GetBodyTypeAndGender::Gender' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_GetBodyTypeAndGender, CallFunc_GetActivatingPawn_ReturnValue) == 0x000008, "Member 'GAB_Emote_Generic_C_GetBodyTypeAndGender::CallFunc_GetActivatingPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_GetBodyTypeAndGender, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000010, "Member 'GAB_Emote_Generic_C_GetBodyTypeAndGender::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_GetBodyTypeAndGender, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'GAB_Emote_Generic_C_GetBodyTypeAndGender::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_GetBodyTypeAndGender, CallFunc_GetCharacterBodyType_ReturnValue) == 0x000019, "Member 'GAB_Emote_Generic_C_GetBodyTypeAndGender::CallFunc_GetCharacterBodyType_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_GetBodyTypeAndGender, CallFunc_GetCharacterGender_ReturnValue) == 0x00001A, "Member 'GAB_Emote_Generic_C_GetBodyTypeAndGender::CallFunc_GetCharacterGender_ReturnValue' has a wrong offset!");

// Function GAB_Emote_Generic.GAB_Emote_Generic_C.GetMontageToPlay
// 0x0060 (0x0060 - 0x0000)
struct GAB_Emote_Generic_C_GetMontageToPlay final
{
public:
	class UFortMontageItemDefinitionBase*         EmoteAsset;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortCustomBodyType                           BodyType;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortCustomGender                             Gender;                                            // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UAnimMontage>            ReturnValue;                                       // 0x0010(0x0028)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            CallFunc_GetAnimation_ReturnValue;                 // 0x0038(0x0028)(HasGetValueTypeHash)
};
static_assert(alignof(GAB_Emote_Generic_C_GetMontageToPlay) == 0x000008, "Wrong alignment on GAB_Emote_Generic_C_GetMontageToPlay");
static_assert(sizeof(GAB_Emote_Generic_C_GetMontageToPlay) == 0x000060, "Wrong size on GAB_Emote_Generic_C_GetMontageToPlay");
static_assert(offsetof(GAB_Emote_Generic_C_GetMontageToPlay, EmoteAsset) == 0x000000, "Member 'GAB_Emote_Generic_C_GetMontageToPlay::EmoteAsset' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_GetMontageToPlay, BodyType) == 0x000008, "Member 'GAB_Emote_Generic_C_GetMontageToPlay::BodyType' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_GetMontageToPlay, Gender) == 0x000009, "Member 'GAB_Emote_Generic_C_GetMontageToPlay::Gender' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_GetMontageToPlay, ReturnValue) == 0x000010, "Member 'GAB_Emote_Generic_C_GetMontageToPlay::ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_GetMontageToPlay, CallFunc_GetAnimation_ReturnValue) == 0x000038, "Member 'GAB_Emote_Generic_C_GetMontageToPlay::CallFunc_GetAnimation_ReturnValue' has a wrong offset!");

// Function GAB_Emote_Generic.GAB_Emote_Generic_C.SetReticleVisibility
// 0x0020 (0x0020 - 0x0000)
struct GAB_Emote_Generic_C_SetReticleVisibility final
{
public:
	bool                                          ShouldHide;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetInstigatorController_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerZone*              K2Node_DynamicCast_AsFort_Player_Controller_Zone;  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GAB_Emote_Generic_C_SetReticleVisibility) == 0x000008, "Wrong alignment on GAB_Emote_Generic_C_SetReticleVisibility");
static_assert(sizeof(GAB_Emote_Generic_C_SetReticleVisibility) == 0x000020, "Wrong size on GAB_Emote_Generic_C_SetReticleVisibility");
static_assert(offsetof(GAB_Emote_Generic_C_SetReticleVisibility, ShouldHide) == 0x000000, "Member 'GAB_Emote_Generic_C_SetReticleVisibility::ShouldHide' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_SetReticleVisibility, CallFunc_IsServer_ReturnValue) == 0x000001, "Member 'GAB_Emote_Generic_C_SetReticleVisibility::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_SetReticleVisibility, CallFunc_GetInstigatorController_ReturnValue) == 0x000008, "Member 'GAB_Emote_Generic_C_SetReticleVisibility::CallFunc_GetInstigatorController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_SetReticleVisibility, K2Node_DynamicCast_AsFort_Player_Controller_Zone) == 0x000010, "Member 'GAB_Emote_Generic_C_SetReticleVisibility::K2Node_DynamicCast_AsFort_Player_Controller_Zone' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_SetReticleVisibility, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'GAB_Emote_Generic_C_SetReticleVisibility::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function GAB_Emote_Generic.GAB_Emote_Generic_C.ForceStopMontage
// 0x0020 (0x0020 - 0x0000)
struct GAB_Emote_Generic_C_ForceStopMontage final
{
public:
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDefaultBlendOutTime_ReturnValue;       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GAB_Emote_Generic_C_ForceStopMontage) == 0x000008, "Wrong alignment on GAB_Emote_Generic_C_ForceStopMontage");
static_assert(sizeof(GAB_Emote_Generic_C_ForceStopMontage) == 0x000020, "Wrong size on GAB_Emote_Generic_C_ForceStopMontage");
static_assert(offsetof(GAB_Emote_Generic_C_ForceStopMontage, CallFunc_GetActivatingPawn_ReturnValue) == 0x000000, "Member 'GAB_Emote_Generic_C_ForceStopMontage::CallFunc_GetActivatingPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ForceStopMontage, CallFunc_GetDefaultBlendOutTime_ReturnValue) == 0x000008, "Member 'GAB_Emote_Generic_C_ForceStopMontage::CallFunc_GetDefaultBlendOutTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ForceStopMontage, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'GAB_Emote_Generic_C_ForceStopMontage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
