#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_AthenaDBNORevive

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function GAB_AthenaDBNORevive.GAB_AthenaDBNORevive_C.ExecuteUbergraph_GAB_AthenaDBNORevive
// 0x0460 (0x0460 - 0x0000)
struct GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_3;                   // 0x0008(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_3;               // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_2;                   // 0x0048(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_2;               // 0x0070(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0088(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable_1;                            // 0x0090(0x0028)()
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_1;                   // 0x00B8(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_1;               // 0x00E0(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00E8(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x00F8(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x0120(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0128(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable_2;                            // 0x0138(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable_3;                            // 0x0140(0x0028)()
	class UFortAbilityTask_WaitTargetSelection*   CallFunc_WaitTargetSelection_ReturnValue;          // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0178(0x00B0)(ConstParm)
	class UFortAbilityTask_PlayMontageWaitTarget* CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue; // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortGameplayEffectContainerSpec       CallFunc_MakeGameplayEffectContainerSpec_ReturnValue; // 0x0238(0x0088)()
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x02C0(0x0040)(ContainsInstancedReference)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_309[0x3];                                      // 0x0309(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x030C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetSocketRotation_ReturnValue;            // 0x0324(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector_NetQuantize10                  K2Node_MakeStruct_Vector_NetQuantize10;            // 0x0330(0x000C)(NoDestructor)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x033C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0354(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_355[0x3];                                      // 0x0355(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector_NetQuantizeNormal              K2Node_MakeStruct_Vector_NetQuantizeNormal;        // 0x0358(0x000C)(NoDestructor)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_4;                   // 0x0368(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_4;               // 0x0390(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0398(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x03A8(0x00B8)(ContainsInstancedReference)
};
static_assert(alignof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive) == 0x000008, "Wrong alignment on GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive");
static_assert(sizeof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive) == 0x000460, "Wrong size on GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, EntryPoint) == 0x000000, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::EntryPoint' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, K2Node_CustomEvent_TargetData_3) == 0x000008, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::K2Node_CustomEvent_TargetData_3' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, K2Node_CustomEvent_ApplicationTag_3) == 0x000030, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::K2Node_CustomEvent_ApplicationTag_3' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, K2Node_CustomEvent_TargetData_2) == 0x000048, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::K2Node_CustomEvent_TargetData_2' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, K2Node_CustomEvent_ApplicationTag_2) == 0x000070, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::K2Node_CustomEvent_ApplicationTag_2' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, K2Node_CreateDelegate_OutputDelegate_1) == 0x000078, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, Temp_struct_Variable) == 0x000088, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, Temp_struct_Variable_1) == 0x000090, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, K2Node_CustomEvent_TargetData_1) == 0x0000B8, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::K2Node_CustomEvent_TargetData_1' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, K2Node_CustomEvent_ApplicationTag_1) == 0x0000E0, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::K2Node_CustomEvent_ApplicationTag_1' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000E8, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, K2Node_CustomEvent_TargetData) == 0x0000F8, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::K2Node_CustomEvent_TargetData' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, K2Node_CustomEvent_ApplicationTag) == 0x000120, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::K2Node_CustomEvent_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, K2Node_CreateDelegate_OutputDelegate_3) == 0x000128, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, Temp_struct_Variable_2) == 0x000138, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, Temp_struct_Variable_3) == 0x000140, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, CallFunc_WaitTargetSelection_ReturnValue) == 0x000168, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::CallFunc_WaitTargetSelection_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, CallFunc_IsValid_ReturnValue) == 0x000170, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, K2Node_Event_EventData) == 0x000178, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue) == 0x000228, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, CallFunc_IsValid_ReturnValue_1) == 0x000230, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, CallFunc_MakeGameplayEffectContainerSpec_ReturnValue) == 0x000238, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::CallFunc_MakeGameplayEffectContainerSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, CallFunc_GetActorInfo_ReturnValue) == 0x0002C0, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000300, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, K2Node_DynamicCast_bSuccess) == 0x000308, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, CallFunc_GetSocketLocation_ReturnValue) == 0x00030C, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, CallFunc_BreakVector_X) == 0x000318, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, CallFunc_BreakVector_Y) == 0x00031C, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, CallFunc_BreakVector_Z) == 0x000320, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, CallFunc_GetSocketRotation_ReturnValue) == 0x000324, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::CallFunc_GetSocketRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, K2Node_MakeStruct_Vector_NetQuantize10) == 0x000330, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::K2Node_MakeStruct_Vector_NetQuantize10' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, CallFunc_Conv_RotatorToVector_ReturnValue) == 0x00033C, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::CallFunc_Conv_RotatorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, CallFunc_BreakVector_X_1) == 0x000348, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, CallFunc_BreakVector_Y_1) == 0x00034C, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, CallFunc_BreakVector_Z_1) == 0x000350, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, K2Node_Event_bWasCancelled) == 0x000354, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, K2Node_MakeStruct_Vector_NetQuantizeNormal) == 0x000358, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::K2Node_MakeStruct_Vector_NetQuantizeNormal' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, K2Node_CustomEvent_TargetData_4) == 0x000368, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::K2Node_CustomEvent_TargetData_4' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, K2Node_CustomEvent_ApplicationTag_4) == 0x000390, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::K2Node_CustomEvent_ApplicationTag_4' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, K2Node_CreateDelegate_OutputDelegate_4) == 0x000398, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x0003A8, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");

// Function GAB_AthenaDBNORevive.GAB_AthenaDBNORevive_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GAB_AthenaDBNORevive_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GAB_AthenaDBNORevive_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GAB_AthenaDBNORevive_C_K2_OnEndAbility");
static_assert(sizeof(GAB_AthenaDBNORevive_C_K2_OnEndAbility) == 0x000001, "Wrong size on GAB_AthenaDBNORevive_C_K2_OnEndAbility");
static_assert(offsetof(GAB_AthenaDBNORevive_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GAB_AthenaDBNORevive_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GAB_AthenaDBNORevive.GAB_AthenaDBNORevive_C.Cancelled_23712DBC45E68EA0C91A4895CBD8B3A6
// 0x0030 (0x0030 - 0x0000)
struct GAB_AthenaDBNORevive_C_Cancelled_23712DBC45E68EA0C91A4895CBD8B3A6 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_AthenaDBNORevive_C_Cancelled_23712DBC45E68EA0C91A4895CBD8B3A6) == 0x000008, "Wrong alignment on GAB_AthenaDBNORevive_C_Cancelled_23712DBC45E68EA0C91A4895CBD8B3A6");
static_assert(sizeof(GAB_AthenaDBNORevive_C_Cancelled_23712DBC45E68EA0C91A4895CBD8B3A6) == 0x000030, "Wrong size on GAB_AthenaDBNORevive_C_Cancelled_23712DBC45E68EA0C91A4895CBD8B3A6");
static_assert(offsetof(GAB_AthenaDBNORevive_C_Cancelled_23712DBC45E68EA0C91A4895CBD8B3A6, TargetData) == 0x000000, "Member 'GAB_AthenaDBNORevive_C_Cancelled_23712DBC45E68EA0C91A4895CBD8B3A6::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_Cancelled_23712DBC45E68EA0C91A4895CBD8B3A6, ApplicationTag) == 0x000028, "Member 'GAB_AthenaDBNORevive_C_Cancelled_23712DBC45E68EA0C91A4895CBD8B3A6::ApplicationTag' has a wrong offset!");

// Function GAB_AthenaDBNORevive.GAB_AthenaDBNORevive_C.Cancelled_779E7BAA49FEAD286C5164B83CDFD609
// 0x0030 (0x0030 - 0x0000)
struct GAB_AthenaDBNORevive_C_Cancelled_779E7BAA49FEAD286C5164B83CDFD609 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_AthenaDBNORevive_C_Cancelled_779E7BAA49FEAD286C5164B83CDFD609) == 0x000008, "Wrong alignment on GAB_AthenaDBNORevive_C_Cancelled_779E7BAA49FEAD286C5164B83CDFD609");
static_assert(sizeof(GAB_AthenaDBNORevive_C_Cancelled_779E7BAA49FEAD286C5164B83CDFD609) == 0x000030, "Wrong size on GAB_AthenaDBNORevive_C_Cancelled_779E7BAA49FEAD286C5164B83CDFD609");
static_assert(offsetof(GAB_AthenaDBNORevive_C_Cancelled_779E7BAA49FEAD286C5164B83CDFD609, TargetData) == 0x000000, "Member 'GAB_AthenaDBNORevive_C_Cancelled_779E7BAA49FEAD286C5164B83CDFD609::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_Cancelled_779E7BAA49FEAD286C5164B83CDFD609, ApplicationTag) == 0x000028, "Member 'GAB_AthenaDBNORevive_C_Cancelled_779E7BAA49FEAD286C5164B83CDFD609::ApplicationTag' has a wrong offset!");

// Function GAB_AthenaDBNORevive.GAB_AthenaDBNORevive_C.Completed_23712DBC45E68EA0C91A4895CBD8B3A6
// 0x0030 (0x0030 - 0x0000)
struct GAB_AthenaDBNORevive_C_Completed_23712DBC45E68EA0C91A4895CBD8B3A6 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_AthenaDBNORevive_C_Completed_23712DBC45E68EA0C91A4895CBD8B3A6) == 0x000008, "Wrong alignment on GAB_AthenaDBNORevive_C_Completed_23712DBC45E68EA0C91A4895CBD8B3A6");
static_assert(sizeof(GAB_AthenaDBNORevive_C_Completed_23712DBC45E68EA0C91A4895CBD8B3A6) == 0x000030, "Wrong size on GAB_AthenaDBNORevive_C_Completed_23712DBC45E68EA0C91A4895CBD8B3A6");
static_assert(offsetof(GAB_AthenaDBNORevive_C_Completed_23712DBC45E68EA0C91A4895CBD8B3A6, TargetData) == 0x000000, "Member 'GAB_AthenaDBNORevive_C_Completed_23712DBC45E68EA0C91A4895CBD8B3A6::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_Completed_23712DBC45E68EA0C91A4895CBD8B3A6, ApplicationTag) == 0x000028, "Member 'GAB_AthenaDBNORevive_C_Completed_23712DBC45E68EA0C91A4895CBD8B3A6::ApplicationTag' has a wrong offset!");

// Function GAB_AthenaDBNORevive.GAB_AthenaDBNORevive_C.K2_ActivateAbilityFromEvent
// 0x00B0 (0x00B0 - 0x0000)
struct GAB_AthenaDBNORevive_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GAB_AthenaDBNORevive_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on GAB_AthenaDBNORevive_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GAB_AthenaDBNORevive_C_K2_ActivateAbilityFromEvent) == 0x0000B0, "Wrong size on GAB_AthenaDBNORevive_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GAB_AthenaDBNORevive_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GAB_AthenaDBNORevive_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function GAB_AthenaDBNORevive.GAB_AthenaDBNORevive_C.Targeted_779E7BAA49FEAD286C5164B83CDFD609
// 0x0030 (0x0030 - 0x0000)
struct GAB_AthenaDBNORevive_C_Targeted_779E7BAA49FEAD286C5164B83CDFD609 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_AthenaDBNORevive_C_Targeted_779E7BAA49FEAD286C5164B83CDFD609) == 0x000008, "Wrong alignment on GAB_AthenaDBNORevive_C_Targeted_779E7BAA49FEAD286C5164B83CDFD609");
static_assert(sizeof(GAB_AthenaDBNORevive_C_Targeted_779E7BAA49FEAD286C5164B83CDFD609) == 0x000030, "Wrong size on GAB_AthenaDBNORevive_C_Targeted_779E7BAA49FEAD286C5164B83CDFD609");
static_assert(offsetof(GAB_AthenaDBNORevive_C_Targeted_779E7BAA49FEAD286C5164B83CDFD609, TargetData) == 0x000000, "Member 'GAB_AthenaDBNORevive_C_Targeted_779E7BAA49FEAD286C5164B83CDFD609::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_Targeted_779E7BAA49FEAD286C5164B83CDFD609, ApplicationTag) == 0x000028, "Member 'GAB_AthenaDBNORevive_C_Targeted_779E7BAA49FEAD286C5164B83CDFD609::ApplicationTag' has a wrong offset!");

// Function GAB_AthenaDBNORevive.GAB_AthenaDBNORevive_C.Triggered_23712DBC45E68EA0C91A4895CBD8B3A6
// 0x0030 (0x0030 - 0x0000)
struct GAB_AthenaDBNORevive_C_Triggered_23712DBC45E68EA0C91A4895CBD8B3A6 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_AthenaDBNORevive_C_Triggered_23712DBC45E68EA0C91A4895CBD8B3A6) == 0x000008, "Wrong alignment on GAB_AthenaDBNORevive_C_Triggered_23712DBC45E68EA0C91A4895CBD8B3A6");
static_assert(sizeof(GAB_AthenaDBNORevive_C_Triggered_23712DBC45E68EA0C91A4895CBD8B3A6) == 0x000030, "Wrong size on GAB_AthenaDBNORevive_C_Triggered_23712DBC45E68EA0C91A4895CBD8B3A6");
static_assert(offsetof(GAB_AthenaDBNORevive_C_Triggered_23712DBC45E68EA0C91A4895CBD8B3A6, TargetData) == 0x000000, "Member 'GAB_AthenaDBNORevive_C_Triggered_23712DBC45E68EA0C91A4895CBD8B3A6::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_Triggered_23712DBC45E68EA0C91A4895CBD8B3A6, ApplicationTag) == 0x000028, "Member 'GAB_AthenaDBNORevive_C_Triggered_23712DBC45E68EA0C91A4895CBD8B3A6::ApplicationTag' has a wrong offset!");

}

