#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAT_GenericTriggeredAbility

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "GAT_TriggeredAbility_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GAT_GenericTriggeredAbility.GAT_GenericTriggeredAbility_C
// 0x00C8 (0x0A20 - 0x0958)
class UGAT_GenericTriggeredAbility_C : public UGAT_TriggeredAbility_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GAT_GenericTriggeredAbility_C;      // 0x0958(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayEventData                     EventData;                                         // 0x0960(0x00B0)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AFortPlayerPawn*                        FortPlayerPawn;                                    // 0x0A10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAutoCommitted;                                   // 0x0A18(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsStaminaLockedOut;                                // 0x0A19(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_GAT_GenericTriggeredAbility(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& Param_EventData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GAT_GenericTriggeredAbility_C">();
	}
	static class UGAT_GenericTriggeredAbility_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGAT_GenericTriggeredAbility_C>();
	}
};
static_assert(alignof(UGAT_GenericTriggeredAbility_C) == 0x000008, "Wrong alignment on UGAT_GenericTriggeredAbility_C");
static_assert(sizeof(UGAT_GenericTriggeredAbility_C) == 0x000A20, "Wrong size on UGAT_GenericTriggeredAbility_C");
static_assert(offsetof(UGAT_GenericTriggeredAbility_C, UberGraphFrame_GAT_GenericTriggeredAbility_C) == 0x000958, "Member 'UGAT_GenericTriggeredAbility_C::UberGraphFrame_GAT_GenericTriggeredAbility_C' has a wrong offset!");
static_assert(offsetof(UGAT_GenericTriggeredAbility_C, EventData) == 0x000960, "Member 'UGAT_GenericTriggeredAbility_C::EventData' has a wrong offset!");
static_assert(offsetof(UGAT_GenericTriggeredAbility_C, FortPlayerPawn) == 0x000A10, "Member 'UGAT_GenericTriggeredAbility_C::FortPlayerPawn' has a wrong offset!");
static_assert(offsetof(UGAT_GenericTriggeredAbility_C, IsAutoCommitted) == 0x000A18, "Member 'UGAT_GenericTriggeredAbility_C::IsAutoCommitted' has a wrong offset!");
static_assert(offsetof(UGAT_GenericTriggeredAbility_C, IsStaminaLockedOut) == 0x000A19, "Member 'UGAT_GenericTriggeredAbility_C::IsStaminaLockedOut' has a wrong offset!");

}

