#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_Loop_Ice_Feet_Creative

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCN_Loop_Ice_Feet_Creative.GCN_Loop_Ice_Feet_Creative_C
// 0x0050 (0x07E0 - 0x0790)
class AGCN_Loop_Ice_Feet_Creative_C final : public AFortGameplayCueNotify_Loop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0790(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortPlayerPawn*                        TargetPlayer;                                      // 0x0798(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SC_Footstep_Local;                                 // 0x07A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SC_Footstep_Remote;                                // 0x07A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SC_Collision;                                      // 0x07B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortCollisionAudioComponent*           CollisionAudioComp;                                // 0x07B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UAudioComponent*>                SpawnedAudioComps;                                 // 0x07C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class USoundBase*                             SC_OnJumpOrBeginFalling;                           // 0x07D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SC_OnLand;                                         // 0x07D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GCN_Loop_Ice_Feet_Creative(int32 EntryPoint);
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation, const struct FVector& HitNormal, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void On_Target_Pawn_Movement_Mode_Changed(class ACharacter* Character, EMovementMode PrevMovementMode, uint8 PreviousCustomMode);
	void OnLoopingStart(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents);
	void On_Target_Pawn_Landed(const struct FHitResult& Hit);
	void ReceiveTick(float DeltaSeconds);
	void On_Target_Pawn_Hit_Event(class AActor* SelfActor, class AActor* OtherActor, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void OnRemoval(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents, class UCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance);
	void On_Player_Step();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCN_Loop_Ice_Feet_Creative_C">();
	}
	static class AGCN_Loop_Ice_Feet_Creative_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCN_Loop_Ice_Feet_Creative_C>();
	}
};
static_assert(alignof(AGCN_Loop_Ice_Feet_Creative_C) == 0x000008, "Wrong alignment on AGCN_Loop_Ice_Feet_Creative_C");
static_assert(sizeof(AGCN_Loop_Ice_Feet_Creative_C) == 0x0007E0, "Wrong size on AGCN_Loop_Ice_Feet_Creative_C");
static_assert(offsetof(AGCN_Loop_Ice_Feet_Creative_C, UberGraphFrame) == 0x000790, "Member 'AGCN_Loop_Ice_Feet_Creative_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCN_Loop_Ice_Feet_Creative_C, TargetPlayer) == 0x000798, "Member 'AGCN_Loop_Ice_Feet_Creative_C::TargetPlayer' has a wrong offset!");
static_assert(offsetof(AGCN_Loop_Ice_Feet_Creative_C, SC_Footstep_Local) == 0x0007A0, "Member 'AGCN_Loop_Ice_Feet_Creative_C::SC_Footstep_Local' has a wrong offset!");
static_assert(offsetof(AGCN_Loop_Ice_Feet_Creative_C, SC_Footstep_Remote) == 0x0007A8, "Member 'AGCN_Loop_Ice_Feet_Creative_C::SC_Footstep_Remote' has a wrong offset!");
static_assert(offsetof(AGCN_Loop_Ice_Feet_Creative_C, SC_Collision) == 0x0007B0, "Member 'AGCN_Loop_Ice_Feet_Creative_C::SC_Collision' has a wrong offset!");
static_assert(offsetof(AGCN_Loop_Ice_Feet_Creative_C, CollisionAudioComp) == 0x0007B8, "Member 'AGCN_Loop_Ice_Feet_Creative_C::CollisionAudioComp' has a wrong offset!");
static_assert(offsetof(AGCN_Loop_Ice_Feet_Creative_C, SpawnedAudioComps) == 0x0007C0, "Member 'AGCN_Loop_Ice_Feet_Creative_C::SpawnedAudioComps' has a wrong offset!");
static_assert(offsetof(AGCN_Loop_Ice_Feet_Creative_C, SC_OnJumpOrBeginFalling) == 0x0007D0, "Member 'AGCN_Loop_Ice_Feet_Creative_C::SC_OnJumpOrBeginFalling' has a wrong offset!");
static_assert(offsetof(AGCN_Loop_Ice_Feet_Creative_C, SC_OnLand) == 0x0007D8, "Member 'AGCN_Loop_Ice_Feet_Creative_C::SC_OnLand' has a wrong offset!");

}

