#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JackalVehicle_Athena

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK::Params
{

// Function JackalVehicle_Athena.JackalVehicle_Athena_C.ExecuteUbergraph_JackalVehicle_Athena
// 0x05D0 (0x05D0 - 0x0000)
struct JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_ApplyMaterialAndUseWrapIfPossible_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Charge_1;                             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Charge;                               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitLocation;                          // 0x0030(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormalImpulse;                     // 0x003C(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitFrictionImpulse;                   // 0x0048(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x0054(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_HitActor;                             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              K2Node_Event_HitSurfaceType;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_UpdateSurfaceType_Output;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnCollision_OutResult;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_OnCollision_OutMagnitude;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_83[0x1];                                       // 0x0083(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_3;          // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_WaterSurfacePoint_1;                  // 0x0094(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_WaterSurfacePoint;                    // 0x00AC(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_4;          // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetRenderingDetailMode_ReturnValue;       // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C6[0x2];                                       // 0x00C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_1;         // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_Event_PlayerPawn;                           // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_ExitSocketName;                       // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EB[0x5];                                       // 0x00EB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraShake*                           CallFunc_PlayCameraShake_ReturnValue;              // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00F8(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0108(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_5;          // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSprinting_ReturnValue;                  // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0113(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_Event_PlayerPawn_1;                         // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SeatIdx;                              // 0x0120(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_6;          // 0x0125(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0126(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_127[0x1];                                      // 0x0127(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_2;         // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_2;         // 0x0158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_3;         // 0x0160(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UAthenaItemWrapDefinition*        K2Node_Event_LoadedWrap;                           // 0x0168(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_HitComponent;           // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0180(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_NormalImpulse;          // 0x0188(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_ComponentBoundEvent_Hit;                    // 0x0194(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_7;          // 0x021C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x021D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x021E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21F[0x1];                                      // 0x021F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0228(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0234(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0240(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x024C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0268(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0280(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x028C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldDestroyProp__ReturnValue;           // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingProp*                          K2Node_DynamicCast_AsBuilding_Prop;                // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        Temp_object_Variable;                              // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ActorHasTag_ReturnValue;                  // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B9[0x3];                                      // 0x02B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_3;         // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_4;         // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C3[0x5];                                      // 0x02C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x02C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Damage;                               // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x02D8(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x02F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x0304(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_38C[0x4];                                      // 0x038C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_Event_InstigatedBy;                         // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x03A0(0x0018)()
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x03B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C4[0xC];                                      // 0x03C4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x03D0(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0400(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x040C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0418(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_424[0x4];                                      // 0x0424(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0428(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue_1;       // 0x0430(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_Event_ExitingPawn_1;                        // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_ExitDuration;                         // 0x0440(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_444[0x4];                                      // 0x0444(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_Event_ExitingPawn;                          // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x0450(0x00B0)()
	class UParticleSystem*                        Temp_object_Variable_1;                            // 0x0500(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0508(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_514[0x4];                                      // 0x0514(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0518(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0520(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ShouldBump_Bump;                          // 0x0521(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0522(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_523[0x1];                                      // 0x0523(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0524(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0530(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0534(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0538(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x053C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0540(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x054C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue_2;       // 0x0558(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue_3;       // 0x0560(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_8;          // 0x0568(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0569(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_56A[0x6];                                      // 0x056A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraShake*                           CallFunc_PlayCameraShake_ReturnValue_1;            // 0x0570(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromTag_ReturnValue; // 0x0578(0x0020)()
	bool                                          K2Node_CustomEvent_Hide;                           // 0x0598(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0599(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x059A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59B[0x5];                                      // 0x059B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        K2Node_Select_Default;                             // 0x05A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue_1;              // 0x05A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue_1;     // 0x05B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerGameplay*          K2Node_DynamicCast_AsFort_Player_Controller_Gameplay; // 0x05B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x05C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x05C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x05C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C3[0x1];                                      // 0x05C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVehicleVelocity_ReturnValue;           // 0x05C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena) == 0x000010, "Wrong alignment on JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena");
static_assert(sizeof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena) == 0x0005D0, "Wrong size on JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, EntryPoint) == 0x000000, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::EntryPoint' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_ApplyMaterialAndUseWrapIfPossible_ReturnValue) == 0x000008, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_ApplyMaterialAndUseWrapIfPossible_ReturnValue' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_GetController_ReturnValue) == 0x000010, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_DynamicCast_AsPlayer_Controller) == 0x000018, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_DynamicCast_AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_IsDedicatedServer_ReturnValue) == 0x000021, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000022, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_IsValid_ReturnValue) == 0x000023, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x000024, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_Event_Charge_1) == 0x000028, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_Event_Charge_1' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_Event_Charge) == 0x00002C, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_Event_Charge' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_Event_HitLocation) == 0x000030, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_Event_HitNormalImpulse) == 0x00003C, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_Event_HitNormalImpulse' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_Event_HitFrictionImpulse) == 0x000048, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_Event_HitFrictionImpulse' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_Event_HitNormal) == 0x000054, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_Event_HitActor) == 0x000060, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_Event_HitActor' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_Event_HitSurfaceType) == 0x000068, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_Event_HitSurfaceType' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_UpdateSurfaceType_Output) == 0x00006C, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_UpdateSurfaceType_Output' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_OnCollision_OutResult) == 0x000070, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_OnCollision_OutResult' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_OnCollision_OutMagnitude) == 0x000074, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_OnCollision_OutMagnitude' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_DynamicCast_AsFort_Pawn) == 0x000078, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_DynamicCast_bSuccess_1) == 0x000080, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000081, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000082, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000084, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_IsDedicatedServer_ReturnValue_3) == 0x000090, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_IsDedicatedServer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_Event_WaterSurfacePoint_1) == 0x000094, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_Event_WaterSurfacePoint_1' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_BreakVector_X) == 0x0000A0, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_BreakVector_Y) == 0x0000A4, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_BreakVector_Z) == 0x0000A8, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_Event_WaterSurfacePoint) == 0x0000AC, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_Event_WaterSurfacePoint' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000B8, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_IsDedicatedServer_ReturnValue_4) == 0x0000BC, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_IsDedicatedServer_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_GetRenderingDetailMode_ReturnValue) == 0x0000C0, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_GetRenderingDetailMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_Greater_IntInt_ReturnValue) == 0x0000C4, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_IsValid_ReturnValue_1) == 0x0000C5, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_SpawnSoundAttached_ReturnValue) == 0x0000C8, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_SpawnSoundAttached_ReturnValue_1) == 0x0000D0, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_SpawnSoundAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_Event_PlayerPawn) == 0x0000D8, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_Event_PlayerPawn' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_Event_ExitSocketName) == 0x0000E0, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_Event_ExitSocketName' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000E8, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_IsValid_ReturnValue_2) == 0x0000E9, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_IsValid_ReturnValue_3) == 0x0000EA, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_PlayCameraShake_ReturnValue) == 0x0000F0, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_PlayCameraShake_ReturnValue' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_CreateDelegate_OutputDelegate) == 0x0000F8, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000108, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_IsDedicatedServer_ReturnValue_5) == 0x000110, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_IsDedicatedServer_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_IsValid_ReturnValue_4) == 0x000111, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_IsSprinting_ReturnValue) == 0x000112, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_IsSprinting_ReturnValue' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_IsValid_ReturnValue_5) == 0x000113, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_Event_PlayerPawn_1) == 0x000118, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_Event_PlayerPawn_1' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_Event_SeatIdx) == 0x000120, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_Event_SeatIdx' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_IsLocallyControlled_ReturnValue) == 0x000124, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_IsDedicatedServer_ReturnValue_6) == 0x000125, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_IsDedicatedServer_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_IsValid_ReturnValue_6) == 0x000126, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_GetActorUpVector_ReturnValue) == 0x000128, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_Dot_VectorVector_ReturnValue) == 0x000134, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_Greater_FloatFloat_ReturnValue_2) == 0x000138, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_Greater_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_GetActorForwardVector_ReturnValue) == 0x00013C, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000148, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_SpawnSoundAttached_ReturnValue_2) == 0x000158, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_SpawnSoundAttached_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_SpawnSoundAttached_ReturnValue_3) == 0x000160, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_SpawnSoundAttached_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_Event_LoadedWrap) == 0x000168, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_Event_LoadedWrap' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_ComponentBoundEvent_HitComponent) == 0x000170, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_ComponentBoundEvent_HitComponent' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_ComponentBoundEvent_OtherActor) == 0x000178, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_ComponentBoundEvent_OtherComp) == 0x000180, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_ComponentBoundEvent_NormalImpulse) == 0x000188, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_ComponentBoundEvent_NormalImpulse' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_ComponentBoundEvent_Hit) == 0x000194, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_ComponentBoundEvent_Hit' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_IsDedicatedServer_ReturnValue_7) == 0x00021C, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_IsDedicatedServer_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_BreakHitResult_bBlockingHit) == 0x00021D, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_BreakHitResult_bInitialOverlap) == 0x00021E, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_BreakHitResult_Time) == 0x000220, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_BreakHitResult_Distance) == 0x000224, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_BreakHitResult_Location) == 0x000228, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_BreakHitResult_ImpactPoint) == 0x000234, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_BreakHitResult_Normal) == 0x000240, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_BreakHitResult_ImpactNormal) == 0x00024C, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_BreakHitResult_PhysMat) == 0x000258, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_BreakHitResult_HitActor) == 0x000260, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_BreakHitResult_HitComponent) == 0x000268, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_BreakHitResult_HitBoneName) == 0x000270, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_BreakHitResult_HitItem) == 0x000278, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_BreakHitResult_FaceIndex) == 0x00027C, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_BreakHitResult_TraceStart) == 0x000280, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_BreakHitResult_TraceEnd) == 0x00028C, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_ShouldDestroyProp__ReturnValue) == 0x000298, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_ShouldDestroyProp__ReturnValue' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_DynamicCast_AsBuilding_Prop) == 0x0002A0, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_DynamicCast_AsBuilding_Prop' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_DynamicCast_bSuccess_2) == 0x0002A8, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, Temp_object_Variable) == 0x0002B0, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_ActorHasTag_ReturnValue) == 0x0002B8, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_ActorHasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0002BC, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_Greater_FloatFloat_ReturnValue_3) == 0x0002C0, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_Greater_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_Greater_FloatFloat_ReturnValue_4) == 0x0002C1, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_Greater_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_BooleanAND_ReturnValue) == 0x0002C2, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x0002C8, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_Event_Damage) == 0x0002D0, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_Event_DamageTags) == 0x0002D8, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_Event_Momentum) == 0x0002F8, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_Event_HitInfo) == 0x000304, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_Event_InstigatedBy) == 0x000390, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_Event_DamageCauser) == 0x000398, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_Event_EffectContext) == 0x0003A0, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0003B8, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_GetSocketTransform_ReturnValue) == 0x0003D0, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_BreakTransform_Location) == 0x000400, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_BreakTransform_Rotation) == 0x00040C, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_BreakTransform_Scale) == 0x000418, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000428, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_SpawnEmitterAttached_ReturnValue_1) == 0x000430, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_SpawnEmitterAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_Event_ExitingPawn_1) == 0x000438, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_Event_ExitingPawn_1' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_Event_ExitDuration) == 0x000440, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_Event_ExitDuration' has a wrong offset!");
