#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JoinablePartyEntry

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass JoinablePartyEntry.JoinablePartyEntry_C
// 0x00A8 (0x0C20 - 0x0B78)
class UJoinablePartyEntry_C final : public UFortJoinablePartyListEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B78(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Selected;                                          // 0x0B80(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hovered;                                           // 0x0B88(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                AnimatedInputBorder;                               // 0x0B90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Arrow;                                             // 0x0B98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_OnlineStatusIndicator;                      // 0x0BA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      EmptyButtonToEatOneMouseUpEvent;                   // 0x0BA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                EntryBorder;                                       // 0x0BB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Exclamation;                                       // 0x0BB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstance*                      InviteMaterial;                                    // 0x0BC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      DefaultMaterial;                                   // 0x0BC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            InviteFontColor;                                   // 0x0BD0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            DefaultFontColor;                                  // 0x0BF8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_JoinablePartyEntry(int32 EntryPoint);
	void OnInviteStatusUpdated(bool bIsInvited);
	void BP_OnHovered();
	void BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen);
	void BP_OnUnhovered();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"JoinablePartyEntry_C">();
	}
	static class UJoinablePartyEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJoinablePartyEntry_C>();
	}
};
static_assert(alignof(UJoinablePartyEntry_C) == 0x000008, "Wrong alignment on UJoinablePartyEntry_C");
static_assert(sizeof(UJoinablePartyEntry_C) == 0x000C20, "Wrong size on UJoinablePartyEntry_C");
static_assert(offsetof(UJoinablePartyEntry_C, UberGraphFrame) == 0x000B78, "Member 'UJoinablePartyEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UJoinablePartyEntry_C, Selected) == 0x000B80, "Member 'UJoinablePartyEntry_C::Selected' has a wrong offset!");
static_assert(offsetof(UJoinablePartyEntry_C, Hovered) == 0x000B88, "Member 'UJoinablePartyEntry_C::Hovered' has a wrong offset!");
static_assert(offsetof(UJoinablePartyEntry_C, AnimatedInputBorder) == 0x000B90, "Member 'UJoinablePartyEntry_C::AnimatedInputBorder' has a wrong offset!");
static_assert(offsetof(UJoinablePartyEntry_C, Arrow) == 0x000B98, "Member 'UJoinablePartyEntry_C::Arrow' has a wrong offset!");
static_assert(offsetof(UJoinablePartyEntry_C, Border_OnlineStatusIndicator) == 0x000BA0, "Member 'UJoinablePartyEntry_C::Border_OnlineStatusIndicator' has a wrong offset!");
static_assert(offsetof(UJoinablePartyEntry_C, EmptyButtonToEatOneMouseUpEvent) == 0x000BA8, "Member 'UJoinablePartyEntry_C::EmptyButtonToEatOneMouseUpEvent' has a wrong offset!");
static_assert(offsetof(UJoinablePartyEntry_C, EntryBorder) == 0x000BB0, "Member 'UJoinablePartyEntry_C::EntryBorder' has a wrong offset!");
static_assert(offsetof(UJoinablePartyEntry_C, Exclamation) == 0x000BB8, "Member 'UJoinablePartyEntry_C::Exclamation' has a wrong offset!");
static_assert(offsetof(UJoinablePartyEntry_C, InviteMaterial) == 0x000BC0, "Member 'UJoinablePartyEntry_C::InviteMaterial' has a wrong offset!");
static_assert(offsetof(UJoinablePartyEntry_C, DefaultMaterial) == 0x000BC8, "Member 'UJoinablePartyEntry_C::DefaultMaterial' has a wrong offset!");
static_assert(offsetof(UJoinablePartyEntry_C, InviteFontColor) == 0x000BD0, "Member 'UJoinablePartyEntry_C::InviteFontColor' has a wrong offset!");
static_assert(offsetof(UJoinablePartyEntry_C, DefaultFontColor) == 0x000BF8, "Member 'UJoinablePartyEntry_C::DefaultFontColor' has a wrong offset!");

}

