#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LocalUserEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LocalUserEntry.LocalUserEntry_C
// 0x0060 (0x0BF0 - 0x0B90)
class ULocalUserEntry_C final : public UFortLocalUserEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B90(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hovered;                                           // 0x0B98(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_OnlineStatusIndicator;                      // 0x0BA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_MicIcon;                                     // 0x0BA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                LocalUserEntryBorder;                              // 0x0BB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SettingsIcon;                                      // 0x0BB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           Online;                                            // 0x0BC0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Offline;                                           // 0x0BD0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Away;                                              // 0x0BE0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_LocalUserEntry(int32 EntryPoint);
	void OnOnlineStatusChanged(ELocalUserOnlineStatus OnlineStatus);
	void BP_OnUnhovered();
	void BP_OnHovered();
	void HandleOnlineIndicatorView(ELocalUserOnlineStatus InLocalUserOnlineStatus);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LocalUserEntry_C">();
	}
	static class ULocalUserEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULocalUserEntry_C>();
	}
};
static_assert(alignof(ULocalUserEntry_C) == 0x000008, "Wrong alignment on ULocalUserEntry_C");
static_assert(sizeof(ULocalUserEntry_C) == 0x000BF0, "Wrong size on ULocalUserEntry_C");
static_assert(offsetof(ULocalUserEntry_C, UberGraphFrame) == 0x000B90, "Member 'ULocalUserEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULocalUserEntry_C, Hovered) == 0x000B98, "Member 'ULocalUserEntry_C::Hovered' has a wrong offset!");
static_assert(offsetof(ULocalUserEntry_C, Border_OnlineStatusIndicator) == 0x000BA0, "Member 'ULocalUserEntry_C::Border_OnlineStatusIndicator' has a wrong offset!");
static_assert(offsetof(ULocalUserEntry_C, Image_MicIcon) == 0x000BA8, "Member 'ULocalUserEntry_C::Image_MicIcon' has a wrong offset!");
static_assert(offsetof(ULocalUserEntry_C, LocalUserEntryBorder) == 0x000BB0, "Member 'ULocalUserEntry_C::LocalUserEntryBorder' has a wrong offset!");
static_assert(offsetof(ULocalUserEntry_C, SettingsIcon) == 0x000BB8, "Member 'ULocalUserEntry_C::SettingsIcon' has a wrong offset!");
static_assert(offsetof(ULocalUserEntry_C, Online) == 0x000BC0, "Member 'ULocalUserEntry_C::Online' has a wrong offset!");
static_assert(offsetof(ULocalUserEntry_C, Offline) == 0x000BD0, "Member 'ULocalUserEntry_C::Offline' has a wrong offset!");
static_assert(offsetof(ULocalUserEntry_C, Away) == 0x000BE0, "Member 'ULocalUserEntry_C::Away' has a wrong offset!");

}

