#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MeshNetwork

#include "Basic.hpp"


namespace SDK
{

// Enum MeshNetwork.EMeshNetworkNodeType
// NumValues: 0x0006
enum class EMeshNetworkNodeType : uint8
{
	Root                                     = 0,
	Inner                                    = 1,
	Edge                                     = 2,
	Client                                   = 3,
	Unknown                                  = 4,
	EMeshNetworkNodeType_MAX                 = 5,
};

// Enum MeshNetwork.EMeshNetworkRelevancy
// NumValues: 0x0004
enum class EMeshNetworkRelevancy : uint8
{
	NotRelevant                              = 0,
	RelevantToEdgeNodes                      = 1,
	RelevantToClients                        = 2,
	EMeshNetworkRelevancy_MAX                = 3,
};

// ScriptStruct MeshNetwork.AggregatedFunction
// 0x0028 (0x0028 - 0x0000)
struct FAggregatedFunction final
{
public:
	class UFunction*                              Function;                                          // 0x0000(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x20];                                       // 0x0008(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAggregatedFunction) == 0x000008, "Wrong alignment on FAggregatedFunction");
static_assert(sizeof(FAggregatedFunction) == 0x000028, "Wrong size on FAggregatedFunction");
static_assert(offsetof(FAggregatedFunction, Function) == 0x000000, "Member 'FAggregatedFunction::Function' has a wrong offset!");

// ScriptStruct MeshNetwork.MeshMetaDataStruct
// 0x0001 (0x0001 - 0x0000)
struct FMeshMetaDataStruct final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMeshMetaDataStruct) == 0x000001, "Wrong alignment on FMeshMetaDataStruct");
static_assert(sizeof(FMeshMetaDataStruct) == 0x000001, "Wrong size on FMeshMetaDataStruct");

}

