#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MissedInvitesActionMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MissedInvitesActionMenu.MissedInvitesActionMenu_C
// 0x0068 (0x0318 - 0x02B0)
class UMissedInvitesActionMenu_C final : public UFortMissedInvitesActionMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ConfirmationOpened;                                // 0x02B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Opened;                                            // 0x02C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Arrow;                                             // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_OnlineStatusIndicator;                      // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   CommonRichTextBlock;                               // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   CommonRichTextBlock_143;                           // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                EntryBorder;                                       // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               HoverBubble;                                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_119;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Platform;                                    // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Text_DisplayName;                                  // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUserActionMenuInputButton_C*           UserActionMenuInputButton;                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MissedInvitesActionMenu(int32 EntryPoint);
	void OnEnableBackButtonDisplay_1(bool bEnableBackButtonDisplay);
	void OnToggleConfirmation(bool bIsVisible);
	void OnSocialContextSet();
	struct FEventReply OnKeyUp(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MissedInvitesActionMenu_C">();
	}
	static class UMissedInvitesActionMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMissedInvitesActionMenu_C>();
	}
};
static_assert(alignof(UMissedInvitesActionMenu_C) == 0x000008, "Wrong alignment on UMissedInvitesActionMenu_C");
static_assert(sizeof(UMissedInvitesActionMenu_C) == 0x000318, "Wrong size on UMissedInvitesActionMenu_C");
static_assert(offsetof(UMissedInvitesActionMenu_C, UberGraphFrame) == 0x0002B0, "Member 'UMissedInvitesActionMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMissedInvitesActionMenu_C, ConfirmationOpened) == 0x0002B8, "Member 'UMissedInvitesActionMenu_C::ConfirmationOpened' has a wrong offset!");
static_assert(offsetof(UMissedInvitesActionMenu_C, Opened) == 0x0002C0, "Member 'UMissedInvitesActionMenu_C::Opened' has a wrong offset!");
static_assert(offsetof(UMissedInvitesActionMenu_C, Arrow) == 0x0002C8, "Member 'UMissedInvitesActionMenu_C::Arrow' has a wrong offset!");
static_assert(offsetof(UMissedInvitesActionMenu_C, Border_OnlineStatusIndicator) == 0x0002D0, "Member 'UMissedInvitesActionMenu_C::Border_OnlineStatusIndicator' has a wrong offset!");
static_assert(offsetof(UMissedInvitesActionMenu_C, CommonRichTextBlock) == 0x0002D8, "Member 'UMissedInvitesActionMenu_C::CommonRichTextBlock' has a wrong offset!");
static_assert(offsetof(UMissedInvitesActionMenu_C, CommonRichTextBlock_143) == 0x0002E0, "Member 'UMissedInvitesActionMenu_C::CommonRichTextBlock_143' has a wrong offset!");
static_assert(offsetof(UMissedInvitesActionMenu_C, EntryBorder) == 0x0002E8, "Member 'UMissedInvitesActionMenu_C::EntryBorder' has a wrong offset!");
static_assert(offsetof(UMissedInvitesActionMenu_C, HoverBubble) == 0x0002F0, "Member 'UMissedInvitesActionMenu_C::HoverBubble' has a wrong offset!");
static_assert(offsetof(UMissedInvitesActionMenu_C, Image_119) == 0x0002F8, "Member 'UMissedInvitesActionMenu_C::Image_119' has a wrong offset!");
static_assert(offsetof(UMissedInvitesActionMenu_C, Image_Platform) == 0x000300, "Member 'UMissedInvitesActionMenu_C::Image_Platform' has a wrong offset!");
static_assert(offsetof(UMissedInvitesActionMenu_C, Text_DisplayName) == 0x000308, "Member 'UMissedInvitesActionMenu_C::Text_DisplayName' has a wrong offset!");
static_assert(offsetof(UMissedInvitesActionMenu_C, UserActionMenuInputButton) == 0x000310, "Member 'UMissedInvitesActionMenu_C::UserActionMenuInputButton' has a wrong offset!");

}

