#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MissionVoter

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MissionVoter.MissionVoter_C
// 0x0018 (0x0240 - 0x0228)
class UMissionVoter_C final : public UUserWidget
{
public:
	class UPlayerBanner_C*                        PlayerBanner;                                      // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       PlayerName;                                        // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 VoteMinusDecision;                                 // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetVoterData(const struct FVoter& Voter);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MissionVoter_C">();
	}
	static class UMissionVoter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMissionVoter_C>();
	}
};
static_assert(alignof(UMissionVoter_C) == 0x000008, "Wrong alignment on UMissionVoter_C");
static_assert(sizeof(UMissionVoter_C) == 0x000240, "Wrong size on UMissionVoter_C");
static_assert(offsetof(UMissionVoter_C, PlayerBanner) == 0x000228, "Member 'UMissionVoter_C::PlayerBanner' has a wrong offset!");
static_assert(offsetof(UMissionVoter_C, PlayerName) == 0x000230, "Member 'UMissionVoter_C::PlayerName' has a wrong offset!");
static_assert(offsetof(UMissionVoter_C, VoteMinusDecision) == 0x000238, "Member 'UMissionVoter_C::VoteMinusDecision' has a wrong offset!");

}

