#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MissionDetailsModifierList

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function MissionDetailsModifierList.MissionDetailsModifierList_C.PopulateModifiers
// 0x01F8 (0x01F8 - 0x0000)
struct MissionDetailsModifierList_C_PopulateModifiers final
{
public:
	bool                                          UseTrunctatedList;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 NameTextStyle;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 DescriptionTextStyle;                              // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowMinusDescriptions;                             // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFortGameplayModifierItemDefinition*> ModifierItems;                                     // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	bool                                          UseSmallIcons;                                     // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrIndex;                                         // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionDetailsModifierRow_C*           CurrRow;                                           // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DisplayMoreThreshold;                              // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGameplayModifierItemDefinition*    CallFunc_Array_Get_Item;                           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetSmallPreviewImage_ReturnValue;         // 0x0078(0x0028)(HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetLargePreviewImage_ReturnValue;         // 0x00A0(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue;        // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGameplayModifierItemDefinition*    CallFunc_Array_Get_Item_1;                         // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetSmallPreviewImage_ReturnValue_1;       // 0x00F0(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetLargePreviewImage_ReturnValue_1;       // 0x0120(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetShortDescription_ReturnValue;          // 0x0150(0x0018)()
	class FText                                   CallFunc_GetDisplayName_ReturnValue;               // 0x0168(0x0018)()
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_182[0x2];                                      // 0x0182(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0188(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionDetailsModifierRow_C*           K2Node_DynamicCast_AsMission_Details_Modifier_Row; // 0x0190(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19A[0x2];                                      // 0x019A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A2[0x6];                                      // 0x01A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_1;                 // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionDetailsModifierRow_C*           K2Node_DynamicCast_AsMission_Details_Modifier_Row_1; // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x3];                                      // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue_1;           // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x3];                                      // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_4;                               // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x01E4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MissionDetailsModifierList_C_PopulateModifiers) == 0x000008, "Wrong alignment on MissionDetailsModifierList_C_PopulateModifiers");
static_assert(sizeof(MissionDetailsModifierList_C_PopulateModifiers) == 0x0001F8, "Wrong size on MissionDetailsModifierList_C_PopulateModifiers");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, UseTrunctatedList) == 0x000000, "Member 'MissionDetailsModifierList_C_PopulateModifiers::UseTrunctatedList' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, NameTextStyle) == 0x000008, "Member 'MissionDetailsModifierList_C_PopulateModifiers::NameTextStyle' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, DescriptionTextStyle) == 0x000010, "Member 'MissionDetailsModifierList_C_PopulateModifiers::DescriptionTextStyle' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, ShowMinusDescriptions) == 0x000018, "Member 'MissionDetailsModifierList_C_PopulateModifiers::ShowMinusDescriptions' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, ModifierItems) == 0x000020, "Member 'MissionDetailsModifierList_C_PopulateModifiers::ModifierItems' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, UseSmallIcons) == 0x000030, "Member 'MissionDetailsModifierList_C_PopulateModifiers::UseSmallIcons' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, CurrIndex) == 0x000034, "Member 'MissionDetailsModifierList_C_PopulateModifiers::CurrIndex' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, CurrRow) == 0x000038, "Member 'MissionDetailsModifierList_C_PopulateModifiers::CurrRow' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, DisplayMoreThreshold) == 0x000040, "Member 'MissionDetailsModifierList_C_PopulateModifiers::DisplayMoreThreshold' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'MissionDetailsModifierList_C_PopulateModifiers::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, CallFunc_Add_IntInt_ReturnValue_1) == 0x000048, "Member 'MissionDetailsModifierList_C_PopulateModifiers::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, CallFunc_Array_Length_ReturnValue) == 0x00004C, "Member 'MissionDetailsModifierList_C_PopulateModifiers::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, CallFunc_Array_Length_ReturnValue_1) == 0x000050, "Member 'MissionDetailsModifierList_C_PopulateModifiers::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, CallFunc_Greater_IntInt_ReturnValue) == 0x000054, "Member 'MissionDetailsModifierList_C_PopulateModifiers::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000055, "Member 'MissionDetailsModifierList_C_PopulateModifiers::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, CallFunc_Array_Length_ReturnValue_2) == 0x000058, "Member 'MissionDetailsModifierList_C_PopulateModifiers::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, CallFunc_Add_IntInt_ReturnValue_2) == 0x00005C, "Member 'MissionDetailsModifierList_C_PopulateModifiers::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'MissionDetailsModifierList_C_PopulateModifiers::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, Temp_int_Variable) == 0x000064, "Member 'MissionDetailsModifierList_C_PopulateModifiers::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, CallFunc_Array_Get_Item) == 0x000068, "Member 'MissionDetailsModifierList_C_PopulateModifiers::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, CallFunc_Add_IntInt_ReturnValue_3) == 0x000070, "Member 'MissionDetailsModifierList_C_PopulateModifiers::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, CallFunc_GetSmallPreviewImage_ReturnValue) == 0x000078, "Member 'MissionDetailsModifierList_C_PopulateModifiers::CallFunc_GetSmallPreviewImage_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, CallFunc_GetLargePreviewImage_ReturnValue) == 0x0000A0, "Member 'MissionDetailsModifierList_C_PopulateModifiers::CallFunc_GetLargePreviewImage_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, CallFunc_Not_PreBool_ReturnValue) == 0x0000C8, "Member 'MissionDetailsModifierList_C_PopulateModifiers::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, Temp_bool_Variable) == 0x0000C9, "Member 'MissionDetailsModifierList_C_PopulateModifiers::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, CallFunc_SlotAsVerticalBoxSlot_ReturnValue) == 0x0000D0, "Member 'MissionDetailsModifierList_C_PopulateModifiers::CallFunc_SlotAsVerticalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, CallFunc_Array_Length_ReturnValue_3) == 0x0000D8, "Member 'MissionDetailsModifierList_C_PopulateModifiers::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, CallFunc_Add_IntInt_ReturnValue_4) == 0x0000DC, "Member 'MissionDetailsModifierList_C_PopulateModifiers::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000E0, "Member 'MissionDetailsModifierList_C_PopulateModifiers::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, CallFunc_Array_Get_Item_1) == 0x0000E8, "Member 'MissionDetailsModifierList_C_PopulateModifiers::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, CallFunc_GetSmallPreviewImage_ReturnValue_1) == 0x0000F0, "Member 'MissionDetailsModifierList_C_PopulateModifiers::CallFunc_GetSmallPreviewImage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, CallFunc_GetChildrenCount_ReturnValue) == 0x000118, "Member 'MissionDetailsModifierList_C_PopulateModifiers::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, CallFunc_GetLargePreviewImage_ReturnValue_1) == 0x000120, "Member 'MissionDetailsModifierList_C_PopulateModifiers::CallFunc_GetLargePreviewImage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, CallFunc_Subtract_IntInt_ReturnValue) == 0x000148, "Member 'MissionDetailsModifierList_C_PopulateModifiers::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, CallFunc_GetShortDescription_ReturnValue) == 0x000150, "Member 'MissionDetailsModifierList_C_PopulateModifiers::CallFunc_GetShortDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, CallFunc_GetDisplayName_ReturnValue) == 0x000168, "Member 'MissionDetailsModifierList_C_PopulateModifiers::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, CallFunc_Not_PreBool_ReturnValue_1) == 0x000180, "Member 'MissionDetailsModifierList_C_PopulateModifiers::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, CallFunc_BooleanAND_ReturnValue) == 0x000181, "Member 'MissionDetailsModifierList_C_PopulateModifiers::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, Temp_int_Variable_1) == 0x000184, "Member 'MissionDetailsModifierList_C_PopulateModifiers::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, CallFunc_GetChildAt_ReturnValue) == 0x000188, "Member 'MissionDetailsModifierList_C_PopulateModifiers::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, K2Node_DynamicCast_AsMission_Details_Modifier_Row) == 0x000190, "Member 'MissionDetailsModifierList_C_PopulateModifiers::K2Node_DynamicCast_AsMission_Details_Modifier_Row' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, K2Node_DynamicCast_bSuccess) == 0x000198, "Member 'MissionDetailsModifierList_C_PopulateModifiers::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000199, "Member 'MissionDetailsModifierList_C_PopulateModifiers::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, CallFunc_Add_IntInt_ReturnValue_5) == 0x00019C, "Member 'MissionDetailsModifierList_C_PopulateModifiers::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, CallFunc_Not_PreBool_ReturnValue_2) == 0x0001A0, "Member 'MissionDetailsModifierList_C_PopulateModifiers::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, CallFunc_BooleanOR_ReturnValue) == 0x0001A1, "Member 'MissionDetailsModifierList_C_PopulateModifiers::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, CallFunc_GetChildAt_ReturnValue_1) == 0x0001A8, "Member 'MissionDetailsModifierList_C_PopulateModifiers::CallFunc_GetChildAt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, K2Node_DynamicCast_AsMission_Details_Modifier_Row_1) == 0x0001B0, "Member 'MissionDetailsModifierList_C_PopulateModifiers::K2Node_DynamicCast_AsMission_Details_Modifier_Row_1' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, K2Node_DynamicCast_bSuccess_1) == 0x0001B8, "Member 'MissionDetailsModifierList_C_PopulateModifiers::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, Temp_int_Variable_2) == 0x0001BC, "Member 'MissionDetailsModifierList_C_PopulateModifiers::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, Temp_float_Variable) == 0x0001C0, "Member 'MissionDetailsModifierList_C_PopulateModifiers::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, CallFunc_GetChildrenCount_ReturnValue_1) == 0x0001C4, "Member 'MissionDetailsModifierList_C_PopulateModifiers::CallFunc_GetChildrenCount_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x0001C8, "Member 'MissionDetailsModifierList_C_PopulateModifiers::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, Temp_int_Variable_3) == 0x0001CC, "Member 'MissionDetailsModifierList_C_PopulateModifiers::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, CallFunc_LessEqual_IntInt_ReturnValue_2) == 0x0001D0, "Member 'MissionDetailsModifierList_C_PopulateModifiers::CallFunc_LessEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, Temp_int_Variable_4) == 0x0001D4, "Member 'MissionDetailsModifierList_C_PopulateModifiers::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, Temp_float_Variable_1) == 0x0001D8, "Member 'MissionDetailsModifierList_C_PopulateModifiers::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, K2Node_Select_Default) == 0x0001DC, "Member 'MissionDetailsModifierList_C_PopulateModifiers::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, Temp_int_Variable_5) == 0x0001E0, "Member 'MissionDetailsModifierList_C_PopulateModifiers::Temp_int_Variable_5' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_PopulateModifiers, K2Node_MakeStruct_Margin) == 0x0001E4, "Member 'MissionDetailsModifierList_C_PopulateModifiers::K2Node_MakeStruct_Margin' has a wrong offset!");

// Function MissionDetailsModifierList.MissionDetailsModifierList_C.CreateDebugModifiers
// 0x0078 (0x0078 - 0x0000)
struct MissionDetailsModifierList_C_CreateDebugModifiers final
{
public:
	TArray<class UFortGameplayModifierItemDefinition*> Modifiers;                                         // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor)
	class UFortGameplayModifierItemDefinition*    DebugMod8;                                         // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGameplayModifierItemDefinition*    DebugMod7;                                         // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGameplayModifierItemDefinition*    DebugMod6;                                         // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGameplayModifierItemDefinition*    DebugMod5;                                         // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGameplayModifierItemDefinition*    DebugMod4;                                         // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGameplayModifierItemDefinition*    DebugMod3;                                         // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGameplayModifierItemDefinition*    DebugMod2;                                         // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGameplayModifierItemDefinition*    DebugMod1;                                         // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortGameplayModifierItemDefinition* K2Node_Select_Default;                             // 0x0060(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue_1;       // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MissionDetailsModifierList_C_CreateDebugModifiers) == 0x000008, "Wrong alignment on MissionDetailsModifierList_C_CreateDebugModifiers");
static_assert(sizeof(MissionDetailsModifierList_C_CreateDebugModifiers) == 0x000078, "Wrong size on MissionDetailsModifierList_C_CreateDebugModifiers");
static_assert(offsetof(MissionDetailsModifierList_C_CreateDebugModifiers, Modifiers) == 0x000000, "Member 'MissionDetailsModifierList_C_CreateDebugModifiers::Modifiers' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_CreateDebugModifiers, DebugMod8) == 0x000010, "Member 'MissionDetailsModifierList_C_CreateDebugModifiers::DebugMod8' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierList_C_CreateDebugModifiers, DebugMod7) == 0x000018, "Member 'MissionDetailsModifierList_C_CreateDebugModifiers::DebugMod7' has a wrong offset!");
