#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MissionStartObjectivePanel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function MissionStartObjectivePanel.MissionStartObjectivePanel_C.ExecuteUbergraph_MissionStartObjectivePanel
// 0x0048 (0x0048 - 0x0000)
struct MissionStartObjectivePanel_C_ExecuteUbergraph_MissionStartObjectivePanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortVoteType                                 K2Node_Event_VoteType;                             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsVoteActive;                        // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_VoteResult;                           // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_ForceFinalState;                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortVoteType                                 CallFunc_GetMissionVoteType_ReturnValue;           // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MissionStartObjectivePanel_C_ExecuteUbergraph_MissionStartObjectivePanel) == 0x000008, "Wrong alignment on MissionStartObjectivePanel_C_ExecuteUbergraph_MissionStartObjectivePanel");
static_assert(sizeof(MissionStartObjectivePanel_C_ExecuteUbergraph_MissionStartObjectivePanel) == 0x000048, "Wrong size on MissionStartObjectivePanel_C_ExecuteUbergraph_MissionStartObjectivePanel");
static_assert(offsetof(MissionStartObjectivePanel_C_ExecuteUbergraph_MissionStartObjectivePanel, EntryPoint) == 0x000000, "Member 'MissionStartObjectivePanel_C_ExecuteUbergraph_MissionStartObjectivePanel::EntryPoint' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_ExecuteUbergraph_MissionStartObjectivePanel, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'MissionStartObjectivePanel_C_ExecuteUbergraph_MissionStartObjectivePanel::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_ExecuteUbergraph_MissionStartObjectivePanel, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'MissionStartObjectivePanel_C_ExecuteUbergraph_MissionStartObjectivePanel::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_ExecuteUbergraph_MissionStartObjectivePanel, K2Node_Event_VoteType) == 0x000018, "Member 'MissionStartObjectivePanel_C_ExecuteUbergraph_MissionStartObjectivePanel::K2Node_Event_VoteType' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_ExecuteUbergraph_MissionStartObjectivePanel, K2Node_Event_bIsVoteActive) == 0x000019, "Member 'MissionStartObjectivePanel_C_ExecuteUbergraph_MissionStartObjectivePanel::K2Node_Event_bIsVoteActive' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_ExecuteUbergraph_MissionStartObjectivePanel, K2Node_Event_VoteResult) == 0x00001C, "Member 'MissionStartObjectivePanel_C_ExecuteUbergraph_MissionStartObjectivePanel::K2Node_Event_VoteResult' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_ExecuteUbergraph_MissionStartObjectivePanel, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000020, "Member 'MissionStartObjectivePanel_C_ExecuteUbergraph_MissionStartObjectivePanel::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_ExecuteUbergraph_MissionStartObjectivePanel, CallFunc_Not_PreBool_ReturnValue) == 0x000021, "Member 'MissionStartObjectivePanel_C_ExecuteUbergraph_MissionStartObjectivePanel::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_ExecuteUbergraph_MissionStartObjectivePanel, CallFunc_BooleanAND_ReturnValue) == 0x000022, "Member 'MissionStartObjectivePanel_C_ExecuteUbergraph_MissionStartObjectivePanel::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_ExecuteUbergraph_MissionStartObjectivePanel, CallFunc_PlayAnimation_ReturnValue_2) == 0x000028, "Member 'MissionStartObjectivePanel_C_ExecuteUbergraph_MissionStartObjectivePanel::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_ExecuteUbergraph_MissionStartObjectivePanel, K2Node_CustomEvent_ForceFinalState) == 0x000030, "Member 'MissionStartObjectivePanel_C_ExecuteUbergraph_MissionStartObjectivePanel::K2Node_CustomEvent_ForceFinalState' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_ExecuteUbergraph_MissionStartObjectivePanel, CallFunc_GetUINavigationManager_ReturnValue) == 0x000038, "Member 'MissionStartObjectivePanel_C_ExecuteUbergraph_MissionStartObjectivePanel::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_ExecuteUbergraph_MissionStartObjectivePanel, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'MissionStartObjectivePanel_C_ExecuteUbergraph_MissionStartObjectivePanel::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_ExecuteUbergraph_MissionStartObjectivePanel, CallFunc_GetMissionVoteType_ReturnValue) == 0x000041, "Member 'MissionStartObjectivePanel_C_ExecuteUbergraph_MissionStartObjectivePanel::CallFunc_GetMissionVoteType_ReturnValue' has a wrong offset!");

// Function MissionStartObjectivePanel.MissionStartObjectivePanel_C.OnActiveVoteChangedBP
// 0x0008 (0x0008 - 0x0000)
struct MissionStartObjectivePanel_C_OnActiveVoteChangedBP final
{
public:
	EFortVoteType                                 VoteType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsVoteActive;                                     // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         VoteResult;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MissionStartObjectivePanel_C_OnActiveVoteChangedBP) == 0x000004, "Wrong alignment on MissionStartObjectivePanel_C_OnActiveVoteChangedBP");
static_assert(sizeof(MissionStartObjectivePanel_C_OnActiveVoteChangedBP) == 0x000008, "Wrong size on MissionStartObjectivePanel_C_OnActiveVoteChangedBP");
static_assert(offsetof(MissionStartObjectivePanel_C_OnActiveVoteChangedBP, VoteType) == 0x000000, "Member 'MissionStartObjectivePanel_C_OnActiveVoteChangedBP::VoteType' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_OnActiveVoteChangedBP, bIsVoteActive) == 0x000001, "Member 'MissionStartObjectivePanel_C_OnActiveVoteChangedBP::bIsVoteActive' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_OnActiveVoteChangedBP, VoteResult) == 0x000004, "Member 'MissionStartObjectivePanel_C_OnActiveVoteChangedBP::VoteResult' has a wrong offset!");

// Function MissionStartObjectivePanel.MissionStartObjectivePanel_C.ShowPanel
// 0x0001 (0x0001 - 0x0000)
struct MissionStartObjectivePanel_C_ShowPanel final
{
public:
	bool                                          ForceFinalState;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MissionStartObjectivePanel_C_ShowPanel) == 0x000001, "Wrong alignment on MissionStartObjectivePanel_C_ShowPanel");
static_assert(sizeof(MissionStartObjectivePanel_C_ShowPanel) == 0x000001, "Wrong size on MissionStartObjectivePanel_C_ShowPanel");
static_assert(offsetof(MissionStartObjectivePanel_C_ShowPanel, ForceFinalState) == 0x000000, "Member 'MissionStartObjectivePanel_C_ShowPanel::ForceFinalState' has a wrong offset!");

// Function MissionStartObjectivePanel.MissionStartObjectivePanel_C.UpdateRewards
// 0x0068 (0x0068 - 0x0000)
struct MissionStartObjectivePanel_C_UpdateRewards final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionRewardDeltaWidget_C*            CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDifficultyIncreaseRewardsTier_ReturnValue; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFortItemDelta>                 CallFunc_GetDeltaRewards_DeltaRewards;             // 0x0038(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortItemDelta                         CallFunc_Array_Get_Item;                           // 0x0050(0x0010)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MissionStartObjectivePanel_C_UpdateRewards) == 0x000008, "Wrong alignment on MissionStartObjectivePanel_C_UpdateRewards");
static_assert(sizeof(MissionStartObjectivePanel_C_UpdateRewards) == 0x000068, "Wrong size on MissionStartObjectivePanel_C_UpdateRewards");
static_assert(offsetof(MissionStartObjectivePanel_C_UpdateRewards, Temp_int_Array_Index_Variable) == 0x000000, "Member 'MissionStartObjectivePanel_C_UpdateRewards::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_UpdateRewards, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'MissionStartObjectivePanel_C_UpdateRewards::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_UpdateRewards, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'MissionStartObjectivePanel_C_UpdateRewards::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_UpdateRewards, CallFunc_GetOwningPlayer_ReturnValue) == 0x000010, "Member 'MissionStartObjectivePanel_C_UpdateRewards::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_UpdateRewards, CallFunc_GetContext_ReturnValue) == 0x000018, "Member 'MissionStartObjectivePanel_C_UpdateRewards::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_UpdateRewards, CallFunc_Create_ReturnValue) == 0x000020, "Member 'MissionStartObjectivePanel_C_UpdateRewards::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_UpdateRewards, CallFunc_GetDifficultyIncreaseRewardsTier_ReturnValue) == 0x000028, "Member 'MissionStartObjectivePanel_C_UpdateRewards::CallFunc_GetDifficultyIncreaseRewardsTier_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_UpdateRewards, CallFunc_AddChild_ReturnValue) == 0x000030, "Member 'MissionStartObjectivePanel_C_UpdateRewards::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_UpdateRewards, CallFunc_GetDeltaRewards_DeltaRewards) == 0x000038, "Member 'MissionStartObjectivePanel_C_UpdateRewards::CallFunc_GetDeltaRewards_DeltaRewards' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_UpdateRewards, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'MissionStartObjectivePanel_C_UpdateRewards::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_UpdateRewards, CallFunc_Array_Get_Item) == 0x000050, "Member 'MissionStartObjectivePanel_C_UpdateRewards::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_UpdateRewards, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'MissionStartObjectivePanel_C_UpdateRewards::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_UpdateRewards, CallFunc_Less_IntInt_ReturnValue) == 0x000064, "Member 'MissionStartObjectivePanel_C_UpdateRewards::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function MissionStartObjectivePanel.MissionStartObjectivePanel_C.UpdateDifficultyRating
// 0x0028 (0x0028 - 0x0000)
struct MissionStartObjectivePanel_C_UpdateDifficultyRating final
{
public:
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDifficultyIncreaseRewardsTier_ReturnValue; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0018)()
};
static_assert(alignof(MissionStartObjectivePanel_C_UpdateDifficultyRating) == 0x000008, "Wrong alignment on MissionStartObjectivePanel_C_UpdateDifficultyRating");
static_assert(sizeof(MissionStartObjectivePanel_C_UpdateDifficultyRating) == 0x000028, "Wrong size on MissionStartObjectivePanel_C_UpdateDifficultyRating");
static_assert(offsetof(MissionStartObjectivePanel_C_UpdateDifficultyRating, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'MissionStartObjectivePanel_C_UpdateDifficultyRating::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_UpdateDifficultyRating, CallFunc_GetDifficultyIncreaseRewardsTier_ReturnValue) == 0x000008, "Member 'MissionStartObjectivePanel_C_UpdateDifficultyRating::CallFunc_GetDifficultyIncreaseRewardsTier_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_UpdateDifficultyRating, CallFunc_Conv_IntToText_ReturnValue) == 0x000010, "Member 'MissionStartObjectivePanel_C_UpdateDifficultyRating::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function MissionStartObjectivePanel.MissionStartObjectivePanel_C.Hover-Anim
// 0x0008 (0x0008 - 0x0000)
struct MissionStartObjectivePanel_C_HoverMinusAnim final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MissionStartObjectivePanel_C_HoverMinusAnim) == 0x000008, "Wrong alignment on MissionStartObjectivePanel_C_HoverMinusAnim");
static_assert(sizeof(MissionStartObjectivePanel_C_HoverMinusAnim) == 0x000008, "Wrong size on MissionStartObjectivePanel_C_HoverMinusAnim");
static_assert(offsetof(MissionStartObjectivePanel_C_HoverMinusAnim, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'MissionStartObjectivePanel_C_HoverMinusAnim::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function MissionStartObjectivePanel.MissionStartObjectivePanel_C.Leave-Anim
// 0x0008 (0x0008 - 0x0000)
struct MissionStartObjectivePanel_C_LeaveMinusAnim final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MissionStartObjectivePanel_C_LeaveMinusAnim) == 0x000008, "Wrong alignment on MissionStartObjectivePanel_C_LeaveMinusAnim");
static_assert(sizeof(MissionStartObjectivePanel_C_LeaveMinusAnim) == 0x000008, "Wrong size on MissionStartObjectivePanel_C_LeaveMinusAnim");
static_assert(offsetof(MissionStartObjectivePanel_C_LeaveMinusAnim, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'MissionStartObjectivePanel_C_LeaveMinusAnim::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function MissionStartObjectivePanel.MissionStartObjectivePanel_C.Reward-ListAnim
// 0x0040 (0x0040 - 0x0000)
struct MissionStartObjectivePanel_C_RewardMinusListAnim final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMissionRewardDeltaWidget_C*            K2Node_DynamicCast_AsMission_Reward_Delta_Widget;  // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MissionStartObjectivePanel_C_RewardMinusListAnim) == 0x000008, "Wrong alignment on MissionStartObjectivePanel_C_RewardMinusListAnim");
static_assert(sizeof(MissionStartObjectivePanel_C_RewardMinusListAnim) == 0x000040, "Wrong size on MissionStartObjectivePanel_C_RewardMinusListAnim");
static_assert(offsetof(MissionStartObjectivePanel_C_RewardMinusListAnim, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'MissionStartObjectivePanel_C_RewardMinusListAnim::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_RewardMinusListAnim, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000010, "Member 'MissionStartObjectivePanel_C_RewardMinusListAnim::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_RewardMinusListAnim, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'MissionStartObjectivePanel_C_RewardMinusListAnim::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_RewardMinusListAnim, CallFunc_GetChildrenCount_ReturnValue) == 0x00001C, "Member 'MissionStartObjectivePanel_C_RewardMinusListAnim::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_RewardMinusListAnim, CallFunc_GetChildAt_ReturnValue) == 0x000020, "Member 'MissionStartObjectivePanel_C_RewardMinusListAnim::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_RewardMinusListAnim, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000028, "Member 'MissionStartObjectivePanel_C_RewardMinusListAnim::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_RewardMinusListAnim, K2Node_DynamicCast_AsMission_Reward_Delta_Widget) == 0x000030, "Member 'MissionStartObjectivePanel_C_RewardMinusListAnim::K2Node_DynamicCast_AsMission_Reward_Delta_Widget' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_RewardMinusListAnim, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'MissionStartObjectivePanel_C_RewardMinusListAnim::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function MissionStartObjectivePanel.MissionStartObjectivePanel_C.Reward-IntroRewind
// 0x0038 (0x0038 - 0x0000)
struct MissionStartObjectivePanel_C_RewardMinusIntroRewind final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMissionRewardDeltaWidget_C*            K2Node_DynamicCast_AsMission_Reward_Delta_Widget;  // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MissionStartObjectivePanel_C_RewardMinusIntroRewind) == 0x000008, "Wrong alignment on MissionStartObjectivePanel_C_RewardMinusIntroRewind");
static_assert(sizeof(MissionStartObjectivePanel_C_RewardMinusIntroRewind) == 0x000038, "Wrong size on MissionStartObjectivePanel_C_RewardMinusIntroRewind");
static_assert(offsetof(MissionStartObjectivePanel_C_RewardMinusIntroRewind, Temp_bool_Variable) == 0x000000, "Member 'MissionStartObjectivePanel_C_RewardMinusIntroRewind::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_RewardMinusIntroRewind, Temp_int_Variable) == 0x000004, "Member 'MissionStartObjectivePanel_C_RewardMinusIntroRewind::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_RewardMinusIntroRewind, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'MissionStartObjectivePanel_C_RewardMinusIntroRewind::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_RewardMinusIntroRewind, CallFunc_Not_PreBool_ReturnValue) == 0x00000C, "Member 'MissionStartObjectivePanel_C_RewardMinusIntroRewind::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_RewardMinusIntroRewind, CallFunc_GetChildrenCount_ReturnValue) == 0x000010, "Member 'MissionStartObjectivePanel_C_RewardMinusIntroRewind::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_RewardMinusIntroRewind, CallFunc_GetChildAt_ReturnValue) == 0x000018, "Member 'MissionStartObjectivePanel_C_RewardMinusIntroRewind::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_RewardMinusIntroRewind, CallFunc_Subtract_IntInt_ReturnValue) == 0x000020, "Member 'MissionStartObjectivePanel_C_RewardMinusIntroRewind::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_RewardMinusIntroRewind, K2Node_DynamicCast_AsMission_Reward_Delta_Widget) == 0x000028, "Member 'MissionStartObjectivePanel_C_RewardMinusIntroRewind::K2Node_DynamicCast_AsMission_Reward_Delta_Widget' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_RewardMinusIntroRewind, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'MissionStartObjectivePanel_C_RewardMinusIntroRewind::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_RewardMinusIntroRewind, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000031, "Member 'MissionStartObjectivePanel_C_RewardMinusIntroRewind::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_RewardMinusIntroRewind, CallFunc_BooleanAND_ReturnValue) == 0x000032, "Member 'MissionStartObjectivePanel_C_RewardMinusIntroRewind::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function MissionStartObjectivePanel.MissionStartObjectivePanel_C.Reward-IntroReset
// 0x0038 (0x0038 - 0x0000)
struct MissionStartObjectivePanel_C_RewardMinusIntroReset final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMissionRewardDeltaWidget_C*            K2Node_DynamicCast_AsMission_Reward_Delta_Widget;  // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MissionStartObjectivePanel_C_RewardMinusIntroReset) == 0x000008, "Wrong alignment on MissionStartObjectivePanel_C_RewardMinusIntroReset");
static_assert(sizeof(MissionStartObjectivePanel_C_RewardMinusIntroReset) == 0x000038, "Wrong size on MissionStartObjectivePanel_C_RewardMinusIntroReset");
static_assert(offsetof(MissionStartObjectivePanel_C_RewardMinusIntroReset, Temp_bool_Variable) == 0x000000, "Member 'MissionStartObjectivePanel_C_RewardMinusIntroReset::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_RewardMinusIntroReset, Temp_int_Variable) == 0x000004, "Member 'MissionStartObjectivePanel_C_RewardMinusIntroReset::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_RewardMinusIntroReset, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'MissionStartObjectivePanel_C_RewardMinusIntroReset::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_RewardMinusIntroReset, CallFunc_Not_PreBool_ReturnValue) == 0x00000C, "Member 'MissionStartObjectivePanel_C_RewardMinusIntroReset::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_RewardMinusIntroReset, CallFunc_GetChildrenCount_ReturnValue) == 0x000010, "Member 'MissionStartObjectivePanel_C_RewardMinusIntroReset::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_RewardMinusIntroReset, CallFunc_GetChildAt_ReturnValue) == 0x000018, "Member 'MissionStartObjectivePanel_C_RewardMinusIntroReset::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_RewardMinusIntroReset, CallFunc_Subtract_IntInt_ReturnValue) == 0x000020, "Member 'MissionStartObjectivePanel_C_RewardMinusIntroReset::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_RewardMinusIntroReset, K2Node_DynamicCast_AsMission_Reward_Delta_Widget) == 0x000028, "Member 'MissionStartObjectivePanel_C_RewardMinusIntroReset::K2Node_DynamicCast_AsMission_Reward_Delta_Widget' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_RewardMinusIntroReset, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'MissionStartObjectivePanel_C_RewardMinusIntroReset::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_RewardMinusIntroReset, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000031, "Member 'MissionStartObjectivePanel_C_RewardMinusIntroReset::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_RewardMinusIntroReset, CallFunc_BooleanAND_ReturnValue) == 0x000032, "Member 'MissionStartObjectivePanel_C_RewardMinusIntroReset::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function MissionStartObjectivePanel.MissionStartObjectivePanel_C.ShowLockoutState
// 0x0020 (0x0020 - 0x0000)
struct MissionStartObjectivePanel_C_ShowLockoutState final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MissionStartObjectivePanel_C_ShowLockoutState) == 0x000008, "Wrong alignment on MissionStartObjectivePanel_C_ShowLockoutState");
static_assert(sizeof(MissionStartObjectivePanel_C_ShowLockoutState) == 0x000020, "Wrong size on MissionStartObjectivePanel_C_ShowLockoutState");
static_assert(offsetof(MissionStartObjectivePanel_C_ShowLockoutState, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'MissionStartObjectivePanel_C_ShowLockoutState::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_ShowLockoutState, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000010, "Member 'MissionStartObjectivePanel_C_ShowLockoutState::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_ShowLockoutState, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'MissionStartObjectivePanel_C_ShowLockoutState::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function MissionStartObjectivePanel.MissionStartObjectivePanel_C.UpdateLockoutTimer
// 0x0020 (0x0020 - 0x0000)
struct MissionStartObjectivePanel_C_UpdateLockoutTimer final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVoteLocked_ReturnValue;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetLockoutTimeRemaining_ReturnValue;      // 0x0008(0x0018)()
};
static_assert(alignof(MissionStartObjectivePanel_C_UpdateLockoutTimer) == 0x000008, "Wrong alignment on MissionStartObjectivePanel_C_UpdateLockoutTimer");
static_assert(sizeof(MissionStartObjectivePanel_C_UpdateLockoutTimer) == 0x000020, "Wrong size on MissionStartObjectivePanel_C_UpdateLockoutTimer");
static_assert(offsetof(MissionStartObjectivePanel_C_UpdateLockoutTimer, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'MissionStartObjectivePanel_C_UpdateLockoutTimer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_UpdateLockoutTimer, CallFunc_IsVoteLocked_ReturnValue) == 0x000001, "Member 'MissionStartObjectivePanel_C_UpdateLockoutTimer::CallFunc_IsVoteLocked_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_UpdateLockoutTimer, CallFunc_GetLockoutTimeRemaining_ReturnValue) == 0x000008, "Member 'MissionStartObjectivePanel_C_UpdateLockoutTimer::CallFunc_GetLockoutTimeRemaining_ReturnValue' has a wrong offset!");

// Function MissionStartObjectivePanel.MissionStartObjectivePanel_C.HideLockoutState
// 0x0010 (0x0010 - 0x0000)
struct MissionStartObjectivePanel_C_HideLockoutState final
{
public:
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MissionStartObjectivePanel_C_HideLockoutState) == 0x000008, "Wrong alignment on MissionStartObjectivePanel_C_HideLockoutState");
static_assert(sizeof(MissionStartObjectivePanel_C_HideLockoutState) == 0x000010, "Wrong size on MissionStartObjectivePanel_C_HideLockoutState");
static_assert(offsetof(MissionStartObjectivePanel_C_HideLockoutState, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000000, "Member 'MissionStartObjectivePanel_C_HideLockoutState::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionStartObjectivePanel_C_HideLockoutState, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'MissionStartObjectivePanel_C_HideLockoutState::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function MissionStartObjectivePanel.MissionStartObjectivePanel_C.BindDelegates
// 0x0010 (0x0010 - 0x0000)
struct MissionStartObjectivePanel_C_BindDelegates final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(MissionStartObjectivePanel_C_BindDelegates) == 0x000004, "Wrong alignment on MissionStartObjectivePanel_C_BindDelegates");
static_assert(sizeof(MissionStartObjectivePanel_C_BindDelegates) == 0x000010, "Wrong size on MissionStartObjectivePanel_C_BindDelegates");
static_assert(offsetof(MissionStartObjectivePanel_C_BindDelegates, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'MissionStartObjectivePanel_C_BindDelegates::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function MissionStartObjectivePanel.MissionStartObjectivePanel_C.UnbindDelegates
// 0x0010 (0x0010 - 0x0000)
struct MissionStartObjectivePanel_C_UnbindDelegates final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(MissionStartObjectivePanel_C_UnbindDelegates) == 0x000004, "Wrong alignment on MissionStartObjectivePanel_C_UnbindDelegates");
static_assert(sizeof(MissionStartObjectivePanel_C_UnbindDelegates) == 0x000010, "Wrong size on MissionStartObjectivePanel_C_UnbindDelegates");
static_assert(offsetof(MissionStartObjectivePanel_C_UnbindDelegates, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'MissionStartObjectivePanel_C_UnbindDelegates::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

}

