#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MissionVoteNotification

#include "Basic.hpp"


namespace SDK::Params
{

// Function MissionVoteNotification.MissionVoteNotification_C.ExecuteUbergraph_MissionVoteNotification
// 0x0018 (0x0018 - 0x0000)
struct MissionVoteNotification_C_ExecuteUbergraph_MissionVoteNotification final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMissionActivationWidget_C*             CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MissionVoteNotification_C_ExecuteUbergraph_MissionVoteNotification) == 0x000008, "Wrong alignment on MissionVoteNotification_C_ExecuteUbergraph_MissionVoteNotification");
static_assert(sizeof(MissionVoteNotification_C_ExecuteUbergraph_MissionVoteNotification) == 0x000018, "Wrong size on MissionVoteNotification_C_ExecuteUbergraph_MissionVoteNotification");
static_assert(offsetof(MissionVoteNotification_C_ExecuteUbergraph_MissionVoteNotification, EntryPoint) == 0x000000, "Member 'MissionVoteNotification_C_ExecuteUbergraph_MissionVoteNotification::EntryPoint' has a wrong offset!");
static_assert(offsetof(MissionVoteNotification_C_ExecuteUbergraph_MissionVoteNotification, CallFunc_Create_ReturnValue) == 0x000008, "Member 'MissionVoteNotification_C_ExecuteUbergraph_MissionVoteNotification::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionVoteNotification_C_ExecuteUbergraph_MissionVoteNotification, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000010, "Member 'MissionVoteNotification_C_ExecuteUbergraph_MissionVoteNotification::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");

}

