#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MissionActivationWidget

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function MissionActivationWidget.MissionActivationWidget_C.ExecuteUbergraph_MissionActivationWidget
// 0x01F8 (0x01F8 - 0x0000)
struct MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortMissionActivationWidgetState             K2Node_Event_ActiveState;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortMissionActivationWidgetState             K2Node_Event_PreviousState;                        // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_1;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortVoteType                                 CallFunc_GetMissionVoteType_ReturnValue;           // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortVoteType                                 K2Node_Event_VoteType_1;                           // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsLocked;                            // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortMissionActivationWidgetState             CallFunc_GetCurrentState_ReturnValue;              // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_5;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortVoteType                                 CallFunc_GetMissionVoteType_ReturnValue_1;         // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayerVoteInstigator_ReturnValue;       // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVoteActive_ReturnValue;                 // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F[0x1];                                       // 0x006F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue_1;                 // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerVoteInstigator_ReturnValue_1;     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVoteActive_ReturnValue_1;               // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button_6;               // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button_5;               // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button_4;               // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button_3;               // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button_2;               // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button_1;               // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortMissionActivationWidgetState             CallFunc_GetCurrentState_ReturnValue_1;            // 0x00CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_4;                    // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetStartObjectiveBluGloRequirement_ReturnValue; // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetIncreaseDifficultyBluGloRequirement_ReturnValue; // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue_1;         // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00E0(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00F0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AFortMission*                           CallFunc_GetPrimaryMission_ReturnValue;            // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetMissionName_ReturnValue;               // 0x0100(0x0018)()
	class AFortMission*                           CallFunc_GetPrimaryMission_ReturnValue_1;          // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0120(0x0018)()
	class UFortMissionInfo*                       CallFunc_GetPrimaryMissionInfo_ReturnValue;        // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInteractionEnabled_ReturnValue;         // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInteractionEnabled_ReturnValue_1;       // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0143(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0145(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnyVoteActive_ReturnValue;              // 0x0146(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortVoteType                                 K2Node_CustomEvent_VoteType;                       // 0x0147(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Success;                        // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_5;                    // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayerVoteInstigator_ReturnValue_2;     // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14B[0x5];                                      // 0x014B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue_2;         // 0x0150(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_2;                           // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_6;              // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_7;              // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_8;              // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_9;              // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_2;                             // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortObjectiveBase*                     CallFunc_GetObjectiveByHandle_ReturnValue;         // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_3;                             // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGenericObjective_ReadyUp_C*            K2Node_DynamicCast_AsGeneric_Objective_Ready_Up;   // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x3];                                      // 0x01A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_3;                           // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_10;             // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_11;             // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_12;             // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_13;             // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortVoteType                                 K2Node_Event_VoteType;                             // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsVoteActive;                        // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DA[0x2];                                      // 0x01DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_VoteResult;                           // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInteractionEnabled_ReturnValue_2;       // 0x01E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInteractionEnabled_ReturnValue_3;       // 0x01E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_InitObject;                           // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue_3;         // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget) == 0x000008, "Wrong alignment on MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget");
static_assert(sizeof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget) == 0x0001F8, "Wrong size on MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, EntryPoint) == 0x000000, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, Temp_bool_Variable) == 0x000004, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, K2Node_Event_ActiveState) == 0x000010, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::K2Node_Event_ActiveState' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, K2Node_Event_PreviousState) == 0x000011, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::K2Node_Event_PreviousState' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, K2Node_SwitchEnum_CmpSuccess) == 0x000012, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, K2Node_SwitchEnum_CmpSuccess_1) == 0x000013, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, CallFunc_PlayAnimation_ReturnValue_1) == 0x000018, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, CallFunc_PlayAnimation_ReturnValue_2) == 0x000020, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, CallFunc_PlayAnimation_ReturnValue_3) == 0x000028, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000030, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, CallFunc_SlotAsOverlaySlot_ReturnValue_1) == 0x000038, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::CallFunc_SlotAsOverlaySlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, CallFunc_PlayAnimation_ReturnValue_4) == 0x000040, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, CallFunc_GetMissionVoteType_ReturnValue) == 0x000049, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::CallFunc_GetMissionVoteType_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, CallFunc_IsValid_ReturnValue_1) == 0x00004A, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, K2Node_Event_VoteType_1) == 0x00004B, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::K2Node_Event_VoteType_1' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, K2Node_Event_bIsLocked) == 0x00004C, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::K2Node_Event_bIsLocked' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, CallFunc_GetCurrentState_ReturnValue) == 0x00004D, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::CallFunc_GetCurrentState_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, CallFunc_GetContext_ReturnValue) == 0x000050, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000058, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, CallFunc_PlayAnimation_ReturnValue_5) == 0x000060, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::CallFunc_PlayAnimation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, CallFunc_GetMissionVoteType_ReturnValue_1) == 0x000068, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::CallFunc_GetMissionVoteType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, CallFunc_Not_PreBool_ReturnValue) == 0x000069, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, CallFunc_BooleanOR_ReturnValue) == 0x00006A, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, CallFunc_Not_PreBool_ReturnValue_1) == 0x00006B, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, CallFunc_BooleanOR_ReturnValue_1) == 0x00006C, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, CallFunc_IsPlayerVoteInstigator_ReturnValue) == 0x00006D, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::CallFunc_IsPlayerVoteInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, CallFunc_IsVoteActive_ReturnValue) == 0x00006E, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::CallFunc_IsVoteActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, CallFunc_GetContext_ReturnValue_1) == 0x000070, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, CallFunc_IsPlayerVoteInstigator_ReturnValue_1) == 0x000078, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::CallFunc_IsPlayerVoteInstigator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, CallFunc_IsVoteActive_ReturnValue_1) == 0x000079, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::CallFunc_IsVoteActive_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, Temp_byte_Variable) == 0x00007A, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, K2Node_SwitchEnum_CmpSuccess_2) == 0x00007B, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, K2Node_SwitchEnum_CmpSuccess_3) == 0x00007C, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::K2Node_SwitchEnum_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, K2Node_ComponentBoundEvent_Button_6) == 0x000080, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::K2Node_ComponentBoundEvent_Button_6' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000088, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, K2Node_ComponentBoundEvent_Button_5) == 0x000090, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::K2Node_ComponentBoundEvent_Button_5' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, K2Node_ComponentBoundEvent_Button_4) == 0x000098, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::K2Node_ComponentBoundEvent_Button_4' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, K2Node_ComponentBoundEvent_Button_3) == 0x0000A0, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::K2Node_ComponentBoundEvent_Button_3' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, K2Node_ComponentBoundEvent_Button_2) == 0x0000A8, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, Temp_byte_Variable_1) == 0x0000B0, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, K2Node_ComponentBoundEvent_Button_1) == 0x0000B8, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, K2Node_ComponentBoundEvent_Button) == 0x0000C0, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, Temp_bool_Variable_1) == 0x0000C8, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, K2Node_Select_Default) == 0x0000C9, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, K2Node_Event_IsDesignTime) == 0x0000CA, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, CallFunc_GetCurrentState_ReturnValue_1) == 0x0000CB, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::CallFunc_GetCurrentState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, K2Node_SwitchEnum_CmpSuccess_4) == 0x0000CC, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::K2Node_SwitchEnum_CmpSuccess_4' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, CallFunc_GetStartObjectiveBluGloRequirement_ReturnValue) == 0x0000D0, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::CallFunc_GetStartObjectiveBluGloRequirement_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, CallFunc_GetIncreaseDifficultyBluGloRequirement_ReturnValue) == 0x0000D4, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::CallFunc_GetIncreaseDifficultyBluGloRequirement_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, CallFunc_GetUIManagerWidget_ReturnValue_1) == 0x0000D8, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::CallFunc_GetUIManagerWidget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, K2Node_CreateDelegate_OutputDelegate) == 0x0000E0, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000F0, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, CallFunc_GetPrimaryMission_ReturnValue) == 0x0000F8, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::CallFunc_GetPrimaryMission_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, CallFunc_GetMissionName_ReturnValue) == 0x000100, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::CallFunc_GetMissionName_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, CallFunc_GetPrimaryMission_ReturnValue_1) == 0x000118, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::CallFunc_GetPrimaryMission_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, CallFunc_TextToUpper_ReturnValue) == 0x000120, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, CallFunc_GetPrimaryMissionInfo_ReturnValue) == 0x000138, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::CallFunc_GetPrimaryMissionInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, Temp_byte_Variable_2) == 0x000140, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, CallFunc_IsInteractionEnabled_ReturnValue) == 0x000141, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::CallFunc_IsInteractionEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, CallFunc_IsInteractionEnabled_ReturnValue_1) == 0x000142, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::CallFunc_IsInteractionEnabled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, Temp_byte_Variable_3) == 0x000143, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, Temp_bool_Variable_2) == 0x000144, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, K2Node_Select_Default_1) == 0x000145, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, CallFunc_IsAnyVoteActive_ReturnValue) == 0x000146, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::CallFunc_IsAnyVoteActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, K2Node_CustomEvent_VoteType) == 0x000147, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::K2Node_CustomEvent_VoteType' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, K2Node_CustomEvent_Success) == 0x000148, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::K2Node_CustomEvent_Success' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, K2Node_SwitchEnum_CmpSuccess_5) == 0x000149, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::K2Node_SwitchEnum_CmpSuccess_5' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, CallFunc_IsPlayerVoteInstigator_ReturnValue_2) == 0x00014A, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::CallFunc_IsPlayerVoteInstigator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, CallFunc_GetUIManagerWidget_ReturnValue_2) == 0x000150, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::CallFunc_GetUIManagerWidget_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, Temp_float_Variable) == 0x000158, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, Temp_float_Variable_1) == 0x00015C, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, Temp_bool_Variable_3) == 0x000160, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, K2Node_Select_Default_2) == 0x000164, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, CallFunc_PlayAnimation_ReturnValue_6) == 0x000168, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::CallFunc_PlayAnimation_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, CallFunc_PlayAnimation_ReturnValue_7) == 0x000170, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::CallFunc_PlayAnimation_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, CallFunc_PlayAnimation_ReturnValue_8) == 0x000178, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::CallFunc_PlayAnimation_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, CallFunc_PlayAnimation_ReturnValue_9) == 0x000180, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::CallFunc_PlayAnimation_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, Temp_float_Variable_2) == 0x000188, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::Temp_float_Variable_2' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, CallFunc_GetObjectiveByHandle_ReturnValue) == 0x000190, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::CallFunc_GetObjectiveByHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, Temp_float_Variable_3) == 0x000198, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::Temp_float_Variable_3' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, K2Node_DynamicCast_AsGeneric_Objective_Ready_Up) == 0x0001A0, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::K2Node_DynamicCast_AsGeneric_Objective_Ready_Up' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, K2Node_DynamicCast_bSuccess) == 0x0001A8, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, K2Node_Select_Default_3) == 0x0001AC, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, CallFunc_IsValid_ReturnValue_2) == 0x0001B0, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, CallFunc_PlayAnimation_ReturnValue_10) == 0x0001B8, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::CallFunc_PlayAnimation_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, CallFunc_PlayAnimation_ReturnValue_11) == 0x0001C0, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::CallFunc_PlayAnimation_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, CallFunc_PlayAnimation_ReturnValue_12) == 0x0001C8, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::CallFunc_PlayAnimation_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, CallFunc_PlayAnimation_ReturnValue_13) == 0x0001D0, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::CallFunc_PlayAnimation_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, K2Node_Event_VoteType) == 0x0001D8, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::K2Node_Event_VoteType' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, K2Node_Event_bIsVoteActive) == 0x0001D9, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::K2Node_Event_bIsVoteActive' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, K2Node_Event_VoteResult) == 0x0001DC, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::K2Node_Event_VoteResult' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, CallFunc_Not_PreBool_ReturnValue_2) == 0x0001E0, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, CallFunc_BooleanAND_ReturnValue) == 0x0001E1, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, CallFunc_IsInteractionEnabled_ReturnValue_2) == 0x0001E2, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::CallFunc_IsInteractionEnabled_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, CallFunc_IsInteractionEnabled_ReturnValue_3) == 0x0001E3, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::CallFunc_IsInteractionEnabled_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, K2Node_Event_InitObject) == 0x0001E8, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::K2Node_Event_InitObject' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget, CallFunc_GetUIManagerWidget_ReturnValue_3) == 0x0001F0, "Member 'MissionActivationWidget_C_ExecuteUbergraph_MissionActivationWidget::CallFunc_GetUIManagerWidget_ReturnValue_3' has a wrong offset!");

// Function MissionActivationWidget.MissionActivationWidget_C.InitFromObject
// 0x0008 (0x0008 - 0x0000)
struct MissionActivationWidget_C_InitFromObject final
{
public:
	class UObject*                                InitObject;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MissionActivationWidget_C_InitFromObject) == 0x000008, "Wrong alignment on MissionActivationWidget_C_InitFromObject");
static_assert(sizeof(MissionActivationWidget_C_InitFromObject) == 0x000008, "Wrong size on MissionActivationWidget_C_InitFromObject");
static_assert(offsetof(MissionActivationWidget_C_InitFromObject, InitObject) == 0x000000, "Member 'MissionActivationWidget_C_InitFromObject::InitObject' has a wrong offset!");

// Function MissionActivationWidget.MissionActivationWidget_C.OnActiveVoteChangedBP
// 0x0008 (0x0008 - 0x0000)
struct MissionActivationWidget_C_OnActiveVoteChangedBP final
{
public:
	EFortVoteType                                 VoteType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsVoteActive;                                     // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         VoteResult;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MissionActivationWidget_C_OnActiveVoteChangedBP) == 0x000004, "Wrong alignment on MissionActivationWidget_C_OnActiveVoteChangedBP");
static_assert(sizeof(MissionActivationWidget_C_OnActiveVoteChangedBP) == 0x000008, "Wrong size on MissionActivationWidget_C_OnActiveVoteChangedBP");
static_assert(offsetof(MissionActivationWidget_C_OnActiveVoteChangedBP, VoteType) == 0x000000, "Member 'MissionActivationWidget_C_OnActiveVoteChangedBP::VoteType' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_OnActiveVoteChangedBP, bIsVoteActive) == 0x000001, "Member 'MissionActivationWidget_C_OnActiveVoteChangedBP::bIsVoteActive' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_OnActiveVoteChangedBP, VoteResult) == 0x000004, "Member 'MissionActivationWidget_C_OnActiveVoteChangedBP::VoteResult' has a wrong offset!");

// Function MissionActivationWidget.MissionActivationWidget_C.HandleVoteResultFinished
// 0x0002 (0x0002 - 0x0000)
struct MissionActivationWidget_C_HandleVoteResultFinished final
{
public:
	EFortVoteType                                 VoteType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MissionActivationWidget_C_HandleVoteResultFinished) == 0x000001, "Wrong alignment on MissionActivationWidget_C_HandleVoteResultFinished");
static_assert(sizeof(MissionActivationWidget_C_HandleVoteResultFinished) == 0x000002, "Wrong size on MissionActivationWidget_C_HandleVoteResultFinished");
static_assert(offsetof(MissionActivationWidget_C_HandleVoteResultFinished, VoteType) == 0x000000, "Member 'MissionActivationWidget_C_HandleVoteResultFinished::VoteType' has a wrong offset!");
static_assert(offsetof(MissionActivationWidget_C_HandleVoteResultFinished, Success) == 0x000001, "Member 'MissionActivationWidget_C_HandleVoteResultFinished::Success' has a wrong offset!");

// Function MissionActivationWidget.MissionActivationWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct MissionActivationWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MissionActivationWidget_C_PreConstruct) == 0x000001, "Wrong alignment on MissionActivationWidget_C_PreConstruct");
static_assert(sizeof(MissionActivationWidget_C_PreConstruct) == 0x000001, "Wrong size on MissionActivationWidget_C_PreConstruct");
static_assert(offsetof(MissionActivationWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'MissionActivationWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function MissionActivationWidget.MissionActivationWidget_C.BndEvt__IncreaseDifficultyButton_K2Node_ComponentBoundEvent_59_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct MissionActivationWidget_C_BndEvt__IncreaseDifficultyButton_K2Node_ComponentBoundEvent_59_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MissionActivationWidget_C_BndEvt__IncreaseDifficultyButton_K2Node_ComponentBoundEvent_59_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on MissionActivationWidget_C_BndEvt__IncreaseDifficultyButton_K2Node_ComponentBoundEvent_59_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(MissionActivationWidget_C_BndEvt__IncreaseDifficultyButton_K2Node_ComponentBoundEvent_59_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on MissionActivationWidget_C_BndEvt__IncreaseDifficultyButton_K2Node_ComponentBoundEvent_59_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(MissionActivationWidget_C_BndEvt__IncreaseDifficultyButton_K2Node_ComponentBoundEvent_59_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'MissionActivationWidget_C_BndEvt__IncreaseDifficultyButton_K2Node_ComponentBoundEvent_59_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function MissionActivationWidget.MissionActivationWidget_C.BndEvt__StartObjectiveButton_K2Node_ComponentBoundEvent_52_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct MissionActivationWidget_C_BndEvt__StartObjectiveButton_K2Node_ComponentBoundEvent_52_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MissionActivationWidget_C_BndEvt__StartObjectiveButton_K2Node_ComponentBoundEvent_52_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on MissionActivationWidget_C_BndEvt__StartObjectiveButton_K2Node_ComponentBoundEvent_52_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(MissionActivationWidget_C_BndEvt__StartObjectiveButton_K2Node_ComponentBoundEvent_52_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on MissionActivationWidget_C_BndEvt__StartObjectiveButton_K2Node_ComponentBoundEvent_52_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(MissionActivationWidget_C_BndEvt__StartObjectiveButton_K2Node_ComponentBoundEvent_52_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'MissionActivationWidget_C_BndEvt__StartObjectiveButton_K2Node_ComponentBoundEvent_52_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function MissionActivationWidget.MissionActivationWidget_C.BndEvt__IncreaseDifficultyButton_K2Node_ComponentBoundEvent_246_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct MissionActivationWidget_C_BndEvt__IncreaseDifficultyButton_K2Node_ComponentBoundEvent_246_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MissionActivationWidget_C_BndEvt__IncreaseDifficultyButton_K2Node_ComponentBoundEvent_246_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on MissionActivationWidget_C_BndEvt__IncreaseDifficultyButton_K2Node_ComponentBoundEvent_246_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(MissionActivationWidget_C_BndEvt__IncreaseDifficultyButton_K2Node_ComponentBoundEvent_246_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on MissionActivationWidget_C_BndEvt__IncreaseDifficultyButton_K2Node_ComponentBoundEvent_246_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(MissionActivationWidget_C_BndEvt__IncreaseDifficultyButton_K2Node_ComponentBoundEvent_246_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'MissionActivationWidget_C_BndEvt__IncreaseDifficultyButton_K2Node_ComponentBoundEvent_246_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function MissionActivationWidget.MissionActivationWidget_C.BndEvt__StartObjectiveButton_K2Node_ComponentBoundEvent_233_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct MissionActivationWidget_C_BndEvt__StartObjectiveButton_K2Node_ComponentBoundEvent_233_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MissionActivationWidget_C_BndEvt__StartObjectiveButton_K2Node_ComponentBoundEvent_233_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on MissionActivationWidget_C_BndEvt__StartObjectiveButton_K2Node_ComponentBoundEvent_233_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(MissionActivationWidget_C_BndEvt__StartObjectiveButton_K2Node_ComponentBoundEvent_233_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on MissionActivationWidget_C_BndEvt__StartObjectiveButton_K2Node_ComponentBoundEvent_233_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(MissionActivationWidget_C_BndEvt__StartObjectiveButton_K2Node_ComponentBoundEvent_233_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'MissionActivationWidget_C_BndEvt__StartObjectiveButton_K2Node_ComponentBoundEvent_233_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function MissionActivationWidget.MissionActivationWidget_C.BndEvt__IncreaseDifficultyButton_K2Node_ComponentBoundEvent_94_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct MissionActivationWidget_C_BndEvt__IncreaseDifficultyButton_K2Node_ComponentBoundEvent_94_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
