#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MissionStartObjectivePanel

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MissionStartObjectivePanel.MissionStartObjectivePanel_C
// 0x00D0 (0x0328 - 0x0258)
class UMissionStartObjectivePanel_C final : public UFortMissionActivationWidgetPanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HideLockout;                                       // 0x0260(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowLockout;                                       // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ClosePanel;                                        // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoverStateMinusOff;                                // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoverStateMinusOn;                                 // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OpenPanel;                                         // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       DifficultyRating;                                  // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageHighlighted;                                  // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageLockout;                                      // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       LockoutText;                                       // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       LockoutTimeRemaining;                              // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             RewardsList;                                       // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           RewardsWrapper;                                    // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Shadow;                                            // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 StartObjectiveIcon;                                // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Title;                                             // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         List_Item_Index;                                   // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           RewardListAnimTimer;                               // 0x02E8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         PlaySpeed;                                         // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           LockoutTimer;                                      // 0x02F8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	UMulticastInlineDelegateProperty_             LockoutEndedAnimFinished;                          // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastInlineDelegateProperty_             HidePanelAnimEnded;                                // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	EFortVoteType                                 CurrentVoteType;                                   // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void LockoutEndedAnimFinished__DelegateSignature();
	void HidePanelAnimEnded__DelegateSignature();
	void ExecuteUbergraph_MissionStartObjectivePanel(int32 EntryPoint);
	void OnActiveVoteChangedBP(EFortVoteType VoteType, bool bIsVoteActive, int32 VoteResult);
	void HandleHidePanelFinished();
	void RewardAnimTrigger();
	void InfoObjectUpdated();
	void Destruct();
	void HidePanel();
	void ShowPanel(bool ForceFinalState);
	void Construct();
	void UpdateRewards();
	void UpdateDifficultyRating();
	void HoverMinusAnim();
	void LeaveMinusAnim();
	void RewardMinusListAnim();
	void RewardMinusIntroRewind();
	void RewardMinusIntroReset();
	void ShowLockoutState();
	void UpdateLockoutTimer();
	void HideLockoutState();
	void BindDelegates();
	void UnbindDelegates();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MissionStartObjectivePanel_C">();
	}
	static class UMissionStartObjectivePanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMissionStartObjectivePanel_C>();
	}
};
static_assert(alignof(UMissionStartObjectivePanel_C) == 0x000008, "Wrong alignment on UMissionStartObjectivePanel_C");
static_assert(sizeof(UMissionStartObjectivePanel_C) == 0x000328, "Wrong size on UMissionStartObjectivePanel_C");
static_assert(offsetof(UMissionStartObjectivePanel_C, UberGraphFrame) == 0x000258, "Member 'UMissionStartObjectivePanel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMissionStartObjectivePanel_C, HideLockout) == 0x000260, "Member 'UMissionStartObjectivePanel_C::HideLockout' has a wrong offset!");
static_assert(offsetof(UMissionStartObjectivePanel_C, ShowLockout) == 0x000268, "Member 'UMissionStartObjectivePanel_C::ShowLockout' has a wrong offset!");
static_assert(offsetof(UMissionStartObjectivePanel_C, ClosePanel) == 0x000270, "Member 'UMissionStartObjectivePanel_C::ClosePanel' has a wrong offset!");
static_assert(offsetof(UMissionStartObjectivePanel_C, HoverStateMinusOff) == 0x000278, "Member 'UMissionStartObjectivePanel_C::HoverStateMinusOff' has a wrong offset!");
static_assert(offsetof(UMissionStartObjectivePanel_C, HoverStateMinusOn) == 0x000280, "Member 'UMissionStartObjectivePanel_C::HoverStateMinusOn' has a wrong offset!");
static_assert(offsetof(UMissionStartObjectivePanel_C, OpenPanel) == 0x000288, "Member 'UMissionStartObjectivePanel_C::OpenPanel' has a wrong offset!");
static_assert(offsetof(UMissionStartObjectivePanel_C, DifficultyRating) == 0x000290, "Member 'UMissionStartObjectivePanel_C::DifficultyRating' has a wrong offset!");
static_assert(offsetof(UMissionStartObjectivePanel_C, ImageHighlighted) == 0x000298, "Member 'UMissionStartObjectivePanel_C::ImageHighlighted' has a wrong offset!");
static_assert(offsetof(UMissionStartObjectivePanel_C, ImageLockout) == 0x0002A0, "Member 'UMissionStartObjectivePanel_C::ImageLockout' has a wrong offset!");
static_assert(offsetof(UMissionStartObjectivePanel_C, LockoutText) == 0x0002A8, "Member 'UMissionStartObjectivePanel_C::LockoutText' has a wrong offset!");
static_assert(offsetof(UMissionStartObjectivePanel_C, LockoutTimeRemaining) == 0x0002B0, "Member 'UMissionStartObjectivePanel_C::LockoutTimeRemaining' has a wrong offset!");
static_assert(offsetof(UMissionStartObjectivePanel_C, RewardsList) == 0x0002B8, "Member 'UMissionStartObjectivePanel_C::RewardsList' has a wrong offset!");
static_assert(offsetof(UMissionStartObjectivePanel_C, RewardsWrapper) == 0x0002C0, "Member 'UMissionStartObjectivePanel_C::RewardsWrapper' has a wrong offset!");
static_assert(offsetof(UMissionStartObjectivePanel_C, Shadow) == 0x0002C8, "Member 'UMissionStartObjectivePanel_C::Shadow' has a wrong offset!");
static_assert(offsetof(UMissionStartObjectivePanel_C, StartObjectiveIcon) == 0x0002D0, "Member 'UMissionStartObjectivePanel_C::StartObjectiveIcon' has a wrong offset!");
static_assert(offsetof(UMissionStartObjectivePanel_C, Title) == 0x0002D8, "Member 'UMissionStartObjectivePanel_C::Title' has a wrong offset!");
static_assert(offsetof(UMissionStartObjectivePanel_C, List_Item_Index) == 0x0002E0, "Member 'UMissionStartObjectivePanel_C::List_Item_Index' has a wrong offset!");
static_assert(offsetof(UMissionStartObjectivePanel_C, RewardListAnimTimer) == 0x0002E8, "Member 'UMissionStartObjectivePanel_C::RewardListAnimTimer' has a wrong offset!");
static_assert(offsetof(UMissionStartObjectivePanel_C, PlaySpeed) == 0x0002F0, "Member 'UMissionStartObjectivePanel_C::PlaySpeed' has a wrong offset!");
static_assert(offsetof(UMissionStartObjectivePanel_C, LockoutTimer) == 0x0002F8, "Member 'UMissionStartObjectivePanel_C::LockoutTimer' has a wrong offset!");
static_assert(offsetof(UMissionStartObjectivePanel_C, LockoutEndedAnimFinished) == 0x000300, "Member 'UMissionStartObjectivePanel_C::LockoutEndedAnimFinished' has a wrong offset!");
static_assert(offsetof(UMissionStartObjectivePanel_C, HidePanelAnimEnded) == 0x000310, "Member 'UMissionStartObjectivePanel_C::HidePanelAnimEnded' has a wrong offset!");
static_assert(offsetof(UMissionStartObjectivePanel_C, CurrentVoteType) == 0x000320, "Member 'UMissionStartObjectivePanel_C::CurrentVoteType' has a wrong offset!");

}

