#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MissionRewardDeltaWidget

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MissionRewardDeltaWidget.MissionRewardDeltaWidget_C
// 0x0048 (0x0270 - 0x0228)
class UMissionRewardDeltaWidget_C final : public UUserWidget
{
public:
	class UWidgetAnimation*                       Intro;                                             // 0x0228(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonBorder*                          BorderMinusDeltaBacking;                           // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       MissionRewardText;                                 // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       RewardDelta;                                       // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RewardImage;                                       // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       RewardName;                                        // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       RewardQuantity;                                    // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FFortItemDelta                         ItemDelta;                                         // 0x0260(0x0010)(Edit, BlueprintVisible, NoDestructor)

public:
	void SetDeltaReward(const struct FFortItemDelta& DeltaReward);
	void IntroAnim();
	void Reset_IntroAnim();
	void Rewind_IntroAnim();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MissionRewardDeltaWidget_C">();
	}
	static class UMissionRewardDeltaWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMissionRewardDeltaWidget_C>();
	}
};
static_assert(alignof(UMissionRewardDeltaWidget_C) == 0x000008, "Wrong alignment on UMissionRewardDeltaWidget_C");
static_assert(sizeof(UMissionRewardDeltaWidget_C) == 0x000270, "Wrong size on UMissionRewardDeltaWidget_C");
static_assert(offsetof(UMissionRewardDeltaWidget_C, Intro) == 0x000228, "Member 'UMissionRewardDeltaWidget_C::Intro' has a wrong offset!");
static_assert(offsetof(UMissionRewardDeltaWidget_C, BorderMinusDeltaBacking) == 0x000230, "Member 'UMissionRewardDeltaWidget_C::BorderMinusDeltaBacking' has a wrong offset!");
static_assert(offsetof(UMissionRewardDeltaWidget_C, MissionRewardText) == 0x000238, "Member 'UMissionRewardDeltaWidget_C::MissionRewardText' has a wrong offset!");
static_assert(offsetof(UMissionRewardDeltaWidget_C, RewardDelta) == 0x000240, "Member 'UMissionRewardDeltaWidget_C::RewardDelta' has a wrong offset!");
static_assert(offsetof(UMissionRewardDeltaWidget_C, RewardImage) == 0x000248, "Member 'UMissionRewardDeltaWidget_C::RewardImage' has a wrong offset!");
static_assert(offsetof(UMissionRewardDeltaWidget_C, RewardName) == 0x000250, "Member 'UMissionRewardDeltaWidget_C::RewardName' has a wrong offset!");
static_assert(offsetof(UMissionRewardDeltaWidget_C, RewardQuantity) == 0x000258, "Member 'UMissionRewardDeltaWidget_C::RewardQuantity' has a wrong offset!");
static_assert(offsetof(UMissionRewardDeltaWidget_C, ItemDelta) == 0x000260, "Member 'UMissionRewardDeltaWidget_C::ItemDelta' has a wrong offset!");

}

