#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MissionVoter

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function MissionVoter.MissionVoter_C.SetVoterData
// 0x00E8 (0x00E8 - 0x0000)
struct MissionVoter_C_SetVoterData final
{
public:
	struct FVoter                                 Voter;                                             // 0x0000(0x0038)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UFortRegisteredPlayerInfo*              CallFunc_GetPlayerInfoFromUniqueID_ReturnValue;    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0050(0x0018)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0068(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0090(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x00B8(0x0028)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MissionVoter_C_SetVoterData) == 0x000008, "Wrong alignment on MissionVoter_C_SetVoterData");
static_assert(sizeof(MissionVoter_C_SetVoterData) == 0x0000E8, "Wrong size on MissionVoter_C_SetVoterData");
static_assert(offsetof(MissionVoter_C_SetVoterData, Voter) == 0x000000, "Member 'MissionVoter_C_SetVoterData::Voter' has a wrong offset!");
static_assert(offsetof(MissionVoter_C_SetVoterData, CallFunc_GetPlayerInfoFromUniqueID_ReturnValue) == 0x000038, "Member 'MissionVoter_C_SetVoterData::CallFunc_GetPlayerInfoFromUniqueID_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionVoter_C_SetVoterData, CallFunc_GetPlayerName_ReturnValue) == 0x000040, "Member 'MissionVoter_C_SetVoterData::CallFunc_GetPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionVoter_C_SetVoterData, CallFunc_Conv_StringToText_ReturnValue) == 0x000050, "Member 'MissionVoter_C_SetVoterData::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionVoter_C_SetVoterData, K2Node_MakeStruct_SlateColor) == 0x000068, "Member 'MissionVoter_C_SetVoterData::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(MissionVoter_C_SetVoterData, K2Node_MakeStruct_SlateColor_1) == 0x000090, "Member 'MissionVoter_C_SetVoterData::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(MissionVoter_C_SetVoterData, K2Node_MakeStruct_SlateColor_2) == 0x0000B8, "Member 'MissionVoter_C_SetVoterData::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(MissionVoter_C_SetVoterData, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000E0, "Member 'MissionVoter_C_SetVoterData::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionVoter_C_SetVoterData, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0000E1, "Member 'MissionVoter_C_SetVoterData::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MissionVoter_C_SetVoterData, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x0000E2, "Member 'MissionVoter_C_SetVoterData::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");

}

