#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OptionsMenuSetting

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function OptionsMenuSetting.OptionsMenuSetting_C.ExecuteUbergraph_OptionsMenuSetting
// 0x01F8 (0x01F8 - 0x0000)
struct OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEnabled;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_DisabledReason;                       // 0x0008(0x0018)(ConstParm)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0028(0x0070)(ConstParm)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00A0(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00D8(0x0070)(ConstParm)
	float                                         K2Node_ComponentBoundEvent_Value_1;                // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x014C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_1;                   // 0x015C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortSettingInfo*                       K2Node_DynamicCast_AsFort_Setting_Info;            // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bIsOpen;                // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_182[0x6];                                      // 0x0182(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0188(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0192(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_193[0x5];                                      // 0x0193(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0198(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue_1;                // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMobileGame_ReturnValue_1;               // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A2[0x6];                                      // 0x01A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       K2Node_Event_TooltipTextBlock;                     // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BA[0x6];                                      // 0x01BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortSettingsContext*                   CallFunc_GetContext_ReturnValue;                   // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortSettingsContext*                   CallFunc_GetContext_ReturnValue_1;                 // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ConvertSettingsValueToSliderValue_SliderValue; // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x01D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D6[0x2];                                      // 0x01D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetSliderSettingValue_ReturnValue;        // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value;                  // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue;                     // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ConvertSliderValueToSettingsValue_SettingsValue; // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x01EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x01EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x01EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x01EF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsEnabled_ReturnValue_1;               // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x01F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting) == 0x000008, "Wrong alignment on OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting");
static_assert(sizeof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting) == 0x0001F8, "Wrong size on OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, EntryPoint) == 0x000000, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::EntryPoint' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, K2Node_Event_bEnabled) == 0x000004, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::K2Node_Event_bEnabled' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, K2Node_Event_DisabledReason) == 0x000008, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::K2Node_Event_DisabledReason' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, Temp_byte_Variable) == 0x000020, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, Temp_bool_Variable) == 0x000021, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, Temp_byte_Variable_1) == 0x000022, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, Temp_byte_Variable_2) == 0x000023, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, K2Node_Event_bIsExpanded) == 0x000024, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, K2Node_Event_bIsSelected) == 0x000025, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, K2Node_Event_MouseEvent_1) == 0x000028, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000098, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, K2Node_Event_MyGeometry) == 0x0000A0, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, K2Node_Event_MouseEvent) == 0x0000D8, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, K2Node_ComponentBoundEvent_Value_1) == 0x000148, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::K2Node_ComponentBoundEvent_Value_1' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, K2Node_MakeStruct_LinearColor) == 0x00014C, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, K2Node_MakeStruct_LinearColor_1) == 0x00015C, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::K2Node_MakeStruct_LinearColor_1' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, K2Node_Event_ListItemObject) == 0x000170, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, K2Node_DynamicCast_AsFort_Setting_Info) == 0x000178, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::K2Node_DynamicCast_AsFort_Setting_Info' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, K2Node_DynamicCast_bSuccess) == 0x000180, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, K2Node_ComponentBoundEvent_bIsOpen) == 0x000181, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::K2Node_ComponentBoundEvent_bIsOpen' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, CallFunc_K2_SetTimer_ReturnValue) == 0x000188, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, CallFunc_IsMobileGame_ReturnValue) == 0x000190, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, CallFunc_TextIsEmpty_ReturnValue) == 0x000191, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, CallFunc_Not_PreBool_ReturnValue) == 0x000192, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, K2Node_ComponentBoundEvent_Button) == 0x000198, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, CallFunc_TextIsEmpty_ReturnValue_1) == 0x0001A0, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::CallFunc_TextIsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, CallFunc_IsMobileGame_ReturnValue_1) == 0x0001A1, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::CallFunc_IsMobileGame_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, K2Node_Event_TooltipTextBlock) == 0x0001A8, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::K2Node_Event_TooltipTextBlock' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, CallFunc_GetUINavigationManager_ReturnValue) == 0x0001B0, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, Temp_byte_Variable_3) == 0x0001B8, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, Temp_bool_Variable_1) == 0x0001B9, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, CallFunc_GetContext_ReturnValue) == 0x0001C0, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, CallFunc_GetContext_ReturnValue_1) == 0x0001C8, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, CallFunc_ConvertSettingsValueToSliderValue_SliderValue) == 0x0001D0, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::CallFunc_ConvertSettingsValueToSliderValue_SliderValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, Temp_byte_Variable_4) == 0x0001D4, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, Temp_byte_Variable_5) == 0x0001D5, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, CallFunc_GetSliderSettingValue_ReturnValue) == 0x0001D8, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::CallFunc_GetSliderSettingValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, K2Node_ComponentBoundEvent_Value) == 0x0001DC, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, CallFunc_GetValue_ReturnValue) == 0x0001E0, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::CallFunc_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, CallFunc_ConvertSliderValueToSettingsValue_SettingsValue) == 0x0001E4, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::CallFunc_ConvertSliderValueToSettingsValue_SettingsValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, Temp_bool_Variable_2) == 0x0001E8, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, K2Node_Select_Default) == 0x0001E9, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, K2Node_Select_Default_1) == 0x0001EA, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, Temp_byte_Variable_6) == 0x0001EB, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, Temp_byte_Variable_7) == 0x0001EC, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, CallFunc_BooleanOR_ReturnValue) == 0x0001ED, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, CallFunc_GetIsEnabled_ReturnValue) == 0x0001EE, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::CallFunc_GetIsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, K2Node_Select_Default_2) == 0x0001EF, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, CallFunc_GetIsEnabled_ReturnValue_1) == 0x0001F0, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::CallFunc_GetIsEnabled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, Temp_bool_Variable_3) == 0x0001F1, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, K2Node_Select_Default_3) == 0x0001F2, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::K2Node_Select_Default_3' has a wrong offset!");

// Function OptionsMenuSetting.OptionsMenuSetting_C.SetControlsEnabled
// 0x0020 (0x0020 - 0x0000)
struct OptionsMenuSetting_C_SetControlsEnabled final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DisabledReason;                                    // 0x0008(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(OptionsMenuSetting_C_SetControlsEnabled) == 0x000008, "Wrong alignment on OptionsMenuSetting_C_SetControlsEnabled");
static_assert(sizeof(OptionsMenuSetting_C_SetControlsEnabled) == 0x000020, "Wrong size on OptionsMenuSetting_C_SetControlsEnabled");
static_assert(offsetof(OptionsMenuSetting_C_SetControlsEnabled, bEnabled) == 0x000000, "Member 'OptionsMenuSetting_C_SetControlsEnabled::bEnabled' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_SetControlsEnabled, DisabledReason) == 0x000008, "Member 'OptionsMenuSetting_C_SetControlsEnabled::DisabledReason' has a wrong offset!");

// Function OptionsMenuSetting.OptionsMenuSetting_C.BndEvt__MenuSlider_K2Node_ComponentBoundEvent_9_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct OptionsMenuSetting_C_BndEvt__MenuSlider_K2Node_ComponentBoundEvent_9_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenuSetting_C_BndEvt__MenuSlider_K2Node_ComponentBoundEvent_9_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on OptionsMenuSetting_C_BndEvt__MenuSlider_K2Node_ComponentBoundEvent_9_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(OptionsMenuSetting_C_BndEvt__MenuSlider_K2Node_ComponentBoundEvent_9_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on OptionsMenuSetting_C_BndEvt__MenuSlider_K2Node_ComponentBoundEvent_9_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(OptionsMenuSetting_C_BndEvt__MenuSlider_K2Node_ComponentBoundEvent_9_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'OptionsMenuSetting_C_BndEvt__MenuSlider_K2Node_ComponentBoundEvent_9_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function OptionsMenuSetting.OptionsMenuSetting_C.UpdateSetting
// 0x0008 (0x0008 - 0x0000)
struct OptionsMenuSetting_C_UpdateSetting final
{
public:
	class UCommonTextBlock*                       TooltipTextBlock;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenuSetting_C_UpdateSetting) == 0x000008, "Wrong alignment on OptionsMenuSetting_C_UpdateSetting");
static_assert(sizeof(OptionsMenuSetting_C_UpdateSetting) == 0x000008, "Wrong size on OptionsMenuSetting_C_UpdateSetting");
static_assert(offsetof(OptionsMenuSetting_C_UpdateSetting, TooltipTextBlock) == 0x000000, "Member 'OptionsMenuSetting_C_UpdateSetting::TooltipTextBlock' has a wrong offset!");

// Function OptionsMenuSetting.OptionsMenuSetting_C.BndEvt__ButtonTouchTooltip_K2Node_ComponentBoundEvent_69_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct OptionsMenuSetting_C_BndEvt__ButtonTouchTooltip_K2Node_ComponentBoundEvent_69_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenuSetting_C_BndEvt__ButtonTouchTooltip_K2Node_ComponentBoundEvent_69_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on OptionsMenuSetting_C_BndEvt__ButtonTouchTooltip_K2Node_ComponentBoundEvent_69_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(OptionsMenuSetting_C_BndEvt__ButtonTouchTooltip_K2Node_ComponentBoundEvent_69_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on OptionsMenuSetting_C_BndEvt__ButtonTouchTooltip_K2Node_ComponentBoundEvent_69_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(OptionsMenuSetting_C_BndEvt__ButtonTouchTooltip_K2Node_ComponentBoundEvent_69_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'OptionsMenuSetting_C_BndEvt__ButtonTouchTooltip_K2Node_ComponentBoundEvent_69_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function OptionsMenuSetting.OptionsMenuSetting_C.BndEvt__MenuAnchorSettingDescription_K2Node_ComponentBoundEvent_22_OnMenuOpenChangedEvent__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct OptionsMenuSetting_C_BndEvt__MenuAnchorSettingDescription_K2Node_ComponentBoundEvent_22_OnMenuOpenChangedEvent__DelegateSignature final
{
public:
	bool                                          bIsOpen;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OptionsMenuSetting_C_BndEvt__MenuAnchorSettingDescription_K2Node_ComponentBoundEvent_22_OnMenuOpenChangedEvent__DelegateSignature) == 0x000001, "Wrong alignment on OptionsMenuSetting_C_BndEvt__MenuAnchorSettingDescription_K2Node_ComponentBoundEvent_22_OnMenuOpenChangedEvent__DelegateSignature");
static_assert(sizeof(OptionsMenuSetting_C_BndEvt__MenuAnchorSettingDescription_K2Node_ComponentBoundEvent_22_OnMenuOpenChangedEvent__DelegateSignature) == 0x000001, "Wrong size on OptionsMenuSetting_C_BndEvt__MenuAnchorSettingDescription_K2Node_ComponentBoundEvent_22_OnMenuOpenChangedEvent__DelegateSignature");
static_assert(offsetof(OptionsMenuSetting_C_BndEvt__MenuAnchorSettingDescription_K2Node_ComponentBoundEvent_22_OnMenuOpenChangedEvent__DelegateSignature, bIsOpen) == 0x000000, "Member 'OptionsMenuSetting_C_BndEvt__MenuAnchorSettingDescription_K2Node_ComponentBoundEvent_22_OnMenuOpenChangedEvent__DelegateSignature::bIsOpen' has a wrong offset!");

// Function OptionsMenuSetting.OptionsMenuSetting_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct OptionsMenuSetting_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenuSetting_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on OptionsMenuSetting_C_OnListItemObjectSet");
static_assert(sizeof(OptionsMenuSetting_C_OnListItemObjectSet) == 0x000008, "Wrong size on OptionsMenuSetting_C_OnListItemObjectSet");
static_assert(offsetof(OptionsMenuSetting_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'OptionsMenuSetting_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function OptionsMenuSetting.OptionsMenuSetting_C.BndEvt__MenuSlider_K2Node_ComponentBoundEvent_124_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct OptionsMenuSetting_C_BndEvt__MenuSlider_K2Node_ComponentBoundEvent_124_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenuSetting_C_BndEvt__MenuSlider_K2Node_ComponentBoundEvent_124_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on OptionsMenuSetting_C_BndEvt__MenuSlider_K2Node_ComponentBoundEvent_124_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(OptionsMenuSetting_C_BndEvt__MenuSlider_K2Node_ComponentBoundEvent_124_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on OptionsMenuSetting_C_BndEvt__MenuSlider_K2Node_ComponentBoundEvent_124_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(OptionsMenuSetting_C_BndEvt__MenuSlider_K2Node_ComponentBoundEvent_124_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'OptionsMenuSetting_C_BndEvt__MenuSlider_K2Node_ComponentBoundEvent_124_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function OptionsMenuSetting.OptionsMenuSetting_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct OptionsMenuSetting_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(OptionsMenuSetting_C_OnMouseEnter) == 0x000008, "Wrong alignment on OptionsMenuSetting_C_OnMouseEnter");
static_assert(sizeof(OptionsMenuSetting_C_OnMouseEnter) == 0x0000A8, "Wrong size on OptionsMenuSetting_C_OnMouseEnter");
static_assert(offsetof(OptionsMenuSetting_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'OptionsMenuSetting_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'OptionsMenuSetting_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function OptionsMenuSetting.OptionsMenuSetting_C.OnMouseLeave
// 0x0070 (0x0070 - 0x0000)
struct OptionsMenuSetting_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(OptionsMenuSetting_C_OnMouseLeave) == 0x000008, "Wrong alignment on OptionsMenuSetting_C_OnMouseLeave");
static_assert(sizeof(OptionsMenuSetting_C_OnMouseLeave) == 0x000070, "Wrong size on OptionsMenuSetting_C_OnMouseLeave");
static_assert(offsetof(OptionsMenuSetting_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'OptionsMenuSetting_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function OptionsMenuSetting.OptionsMenuSetting_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct OptionsMenuSetting_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OptionsMenuSetting_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on OptionsMenuSetting_C_BP_OnItemSelectionChanged");
static_assert(sizeof(OptionsMenuSetting_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on OptionsMenuSetting_C_BP_OnItemSelectionChanged");
static_assert(offsetof(OptionsMenuSetting_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'OptionsMenuSetting_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function OptionsMenuSetting.OptionsMenuSetting_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct OptionsMenuSetting_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OptionsMenuSetting_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on OptionsMenuSetting_C_BP_OnItemExpansionChanged");
static_assert(sizeof(OptionsMenuSetting_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on OptionsMenuSetting_C_BP_OnItemExpansionChanged");
static_assert(offsetof(OptionsMenuSetting_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'OptionsMenuSetting_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function OptionsMenuSetting.OptionsMenuSetting_C.UpdateSize
// 0x0040 (0x0040 - 0x0000)
struct OptionsMenuSetting_C_UpdateSize final
{
public:
	int32                                         FontSizeMobile;                                    // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable;                              // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Select_Default;                             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue_1;               // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_1;                           // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default_2;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenuSetting_C_UpdateSize) == 0x000004, "Wrong alignment on OptionsMenuSetting_C_UpdateSize");
static_assert(sizeof(OptionsMenuSetting_C_UpdateSize) == 0x000040, "Wrong size on OptionsMenuSetting_C_UpdateSize");
static_assert(offsetof(OptionsMenuSetting_C_UpdateSize, FontSizeMobile) == 0x000000, "Member 'OptionsMenuSetting_C_UpdateSize::FontSizeMobile' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_UpdateSize, Temp_bool_Variable) == 0x000004, "Member 'OptionsMenuSetting_C_UpdateSize::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_UpdateSize, Temp_float_Variable) == 0x000008, "Member 'OptionsMenuSetting_C_UpdateSize::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_UpdateSize, Temp_float_Variable_1) == 0x00000C, "Member 'OptionsMenuSetting_C_UpdateSize::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_UpdateSize, Temp_bool_Variable_1) == 0x000010, "Member 'OptionsMenuSetting_C_UpdateSize::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_UpdateSize, Temp_struct_Variable) == 0x000014, "Member 'OptionsMenuSetting_C_UpdateSize::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_UpdateSize, Temp_struct_Variable_1) == 0x00001C, "Member 'OptionsMenuSetting_C_UpdateSize::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_UpdateSize, CallFunc_IsMobileGame_ReturnValue) == 0x000024, "Member 'OptionsMenuSetting_C_UpdateSize::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_UpdateSize, Temp_bool_Variable_2) == 0x000025, "Member 'OptionsMenuSetting_C_UpdateSize::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_UpdateSize, K2Node_Select_Default) == 0x000028, "Member 'OptionsMenuSetting_C_UpdateSize::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_UpdateSize, CallFunc_IsMobileGame_ReturnValue_1) == 0x000030, "Member 'OptionsMenuSetting_C_UpdateSize::CallFunc_IsMobileGame_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_UpdateSize, K2Node_Select_Default_1) == 0x000034, "Member 'OptionsMenuSetting_C_UpdateSize::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_UpdateSize, K2Node_Select_Default_2) == 0x000038, "Member 'OptionsMenuSetting_C_UpdateSize::K2Node_Select_Default_2' has a wrong offset!");

// Function OptionsMenuSetting.OptionsMenuSetting_C.HandlePawnSet
// 0x0028 (0x0028 - 0x0000)
struct OptionsMenuSetting_C_HandlePawnSet final
{
public:
	bool                                          bRCPawn;                                           // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortRemoteControlledPawnAthena*        K2Node_DynamicCast_AsFort_Remote_Controlled_Pawn_Athena; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OptionsMenuSetting_C_HandlePawnSet) == 0x000008, "Wrong alignment on OptionsMenuSetting_C_HandlePawnSet");
static_assert(sizeof(OptionsMenuSetting_C_HandlePawnSet) == 0x000028, "Wrong size on OptionsMenuSetting_C_HandlePawnSet");
static_assert(offsetof(OptionsMenuSetting_C_HandlePawnSet, bRCPawn) == 0x000000, "Member 'OptionsMenuSetting_C_HandlePawnSet::bRCPawn' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_HandlePawnSet, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'OptionsMenuSetting_C_HandlePawnSet::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_HandlePawnSet, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'OptionsMenuSetting_C_HandlePawnSet::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_HandlePawnSet, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'OptionsMenuSetting_C_HandlePawnSet::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_HandlePawnSet, CallFunc_K2_GetPawn_ReturnValue) == 0x000010, "Member 'OptionsMenuSetting_C_HandlePawnSet::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_HandlePawnSet, K2Node_DynamicCast_AsFort_Remote_Controlled_Pawn_Athena) == 0x000018, "Member 'OptionsMenuSetting_C_HandlePawnSet::K2Node_DynamicCast_AsFort_Remote_Controlled_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_HandlePawnSet, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'OptionsMenuSetting_C_HandlePawnSet::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function OptionsMenuSetting.OptionsMenuSetting_C.OnGetMenuContent
// 0x0018 (0x0018 - 0x0000)
struct OptionsMenuSetting_C_OnGetMenuContent final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTooltipMinusBasicMinusS_C*             CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenuSetting_C_OnGetMenuContent) == 0x000008, "Wrong alignment on OptionsMenuSetting_C_OnGetMenuContent");
static_assert(sizeof(OptionsMenuSetting_C_OnGetMenuContent) == 0x000018, "Wrong size on OptionsMenuSetting_C_OnGetMenuContent");
static_assert(offsetof(OptionsMenuSetting_C_OnGetMenuContent, ReturnValue) == 0x000000, "Member 'OptionsMenuSetting_C_OnGetMenuContent::ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_OnGetMenuContent, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'OptionsMenuSetting_C_OnGetMenuContent::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_OnGetMenuContent, CallFunc_Create_ReturnValue) == 0x000010, "Member 'OptionsMenuSetting_C_OnGetMenuContent::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function OptionsMenuSetting.OptionsMenuSetting_C.SetSliderTextRenderScale
// 0x0210 (0x0210 - 0x0000)
struct OptionsMenuSetting_C_SetSliderTextRenderScale final
{
public:
	float                                         Scale_Normalized;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMinYResolutionFor3DView_ReturnValue;   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetResolutionScaleInformationEx_CurrentScaleNormalized; // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetResolutionScaleInformationEx_CurrentScaleValue; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetResolutionScaleInformationEx_MinScaleValue; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetResolutionScaleInformationEx_MaxScaleValue; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWindowMode                                   CallFunc_GetFullscreenMode_ReturnValue;            // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0030(0x0018)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0050(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0090(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D0(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E8(0x0018)()
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              CallFunc_GetScreenResolution_ReturnValue;          // 0x0104(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              CallFunc_GetDesktopResolution_ReturnValue;         // 0x010C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_1;           // 0x0138(0x0018)()
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_2;           // 0x0150(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0168(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x01A8(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x01E8(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x01F8(0x0018)()
};
static_assert(alignof(OptionsMenuSetting_C_SetSliderTextRenderScale) == 0x000008, "Wrong alignment on OptionsMenuSetting_C_SetSliderTextRenderScale");
static_assert(sizeof(OptionsMenuSetting_C_SetSliderTextRenderScale) == 0x000210, "Wrong size on OptionsMenuSetting_C_SetSliderTextRenderScale");
static_assert(offsetof(OptionsMenuSetting_C_SetSliderTextRenderScale, Scale_Normalized) == 0x000000, "Member 'OptionsMenuSetting_C_SetSliderTextRenderScale::Scale_Normalized' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_SetSliderTextRenderScale, CallFunc_IsMobileGame_ReturnValue) == 0x000004, "Member 'OptionsMenuSetting_C_SetSliderTextRenderScale::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_SetSliderTextRenderScale, CallFunc_GetGameUserSettings_ReturnValue) == 0x000008, "Member 'OptionsMenuSetting_C_SetSliderTextRenderScale::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_SetSliderTextRenderScale, CallFunc_GetMinYResolutionFor3DView_ReturnValue) == 0x000010, "Member 'OptionsMenuSetting_C_SetSliderTextRenderScale::CallFunc_GetMinYResolutionFor3DView_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_SetSliderTextRenderScale, CallFunc_GetResolutionScaleInformationEx_CurrentScaleNormalized) == 0x000014, "Member 'OptionsMenuSetting_C_SetSliderTextRenderScale::CallFunc_GetResolutionScaleInformationEx_CurrentScaleNormalized' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_SetSliderTextRenderScale, CallFunc_GetResolutionScaleInformationEx_CurrentScaleValue) == 0x000018, "Member 'OptionsMenuSetting_C_SetSliderTextRenderScale::CallFunc_GetResolutionScaleInformationEx_CurrentScaleValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_SetSliderTextRenderScale, CallFunc_GetResolutionScaleInformationEx_MinScaleValue) == 0x00001C, "Member 'OptionsMenuSetting_C_SetSliderTextRenderScale::CallFunc_GetResolutionScaleInformationEx_MinScaleValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_SetSliderTextRenderScale, CallFunc_GetResolutionScaleInformationEx_MaxScaleValue) == 0x000020, "Member 'OptionsMenuSetting_C_SetSliderTextRenderScale::CallFunc_GetResolutionScaleInformationEx_MaxScaleValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_SetSliderTextRenderScale, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000024, "Member 'OptionsMenuSetting_C_SetSliderTextRenderScale::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_SetSliderTextRenderScale, CallFunc_Lerp_ReturnValue) == 0x000028, "Member 'OptionsMenuSetting_C_SetSliderTextRenderScale::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_SetSliderTextRenderScale, CallFunc_GetFullscreenMode_ReturnValue) == 0x00002C, "Member 'OptionsMenuSetting_C_SetSliderTextRenderScale::CallFunc_GetFullscreenMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_SetSliderTextRenderScale, CallFunc_Conv_FloatToText_ReturnValue) == 0x000030, "Member 'OptionsMenuSetting_C_SetSliderTextRenderScale::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_SetSliderTextRenderScale, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000048, "Member 'OptionsMenuSetting_C_SetSliderTextRenderScale::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_SetSliderTextRenderScale, K2Node_MakeStruct_FormatArgumentData) == 0x000050, "Member 'OptionsMenuSetting_C_SetSliderTextRenderScale::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_SetSliderTextRenderScale, K2Node_MakeStruct_FormatArgumentData_1) == 0x000090, "Member 'OptionsMenuSetting_C_SetSliderTextRenderScale::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_SetSliderTextRenderScale, K2Node_MakeArray_Array) == 0x0000D0, "Member 'OptionsMenuSetting_C_SetSliderTextRenderScale::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_SetSliderTextRenderScale, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0000E0, "Member 'OptionsMenuSetting_C_SetSliderTextRenderScale::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_SetSliderTextRenderScale, CallFunc_Format_ReturnValue) == 0x0000E8, "Member 'OptionsMenuSetting_C_SetSliderTextRenderScale::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_SetSliderTextRenderScale, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000100, "Member 'OptionsMenuSetting_C_SetSliderTextRenderScale::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_SetSliderTextRenderScale, CallFunc_GetScreenResolution_ReturnValue) == 0x000104, "Member 'OptionsMenuSetting_C_SetSliderTextRenderScale::CallFunc_GetScreenResolution_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_SetSliderTextRenderScale, CallFunc_GetDesktopResolution_ReturnValue) == 0x00010C, "Member 'OptionsMenuSetting_C_SetSliderTextRenderScale::CallFunc_GetDesktopResolution_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_SetSliderTextRenderScale, CallFunc_SelectInt_ReturnValue) == 0x000114, "Member 'OptionsMenuSetting_C_SetSliderTextRenderScale::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_SetSliderTextRenderScale, CallFunc_SelectInt_ReturnValue_1) == 0x000118, "Member 'OptionsMenuSetting_C_SetSliderTextRenderScale::CallFunc_SelectInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_SetSliderTextRenderScale, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x00011C, "Member 'OptionsMenuSetting_C_SetSliderTextRenderScale::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_SetSliderTextRenderScale, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000120, "Member 'OptionsMenuSetting_C_SetSliderTextRenderScale::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
