#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OptionsMenuIntegerSlider

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass OptionsMenuIntegerSlider.OptionsMenuIntegerSlider_C
// 0x00D8 (0x0338 - 0x0260)
class UOptionsMenuIntegerSlider_C final : public UFortOptionsMenuSetting
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_0;                                          // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      ButtonTouchTooltip;                                // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Right;                               // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenuAnchor*                            MenuAnchorSettingDescription;                      // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAnalogSlider*                          MenuSlider;                                        // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBoxContainer;                                  // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBoxLabel;                                      // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SliderBackground;                                  // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SliderText;                                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SliderValue;                                       // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_Right;                                      // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                SpacerBottom;                                      // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         Total_Width;                                       // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               Slider_Texture;                                    // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       Tab_Tooltip_Text;                                  // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Hover_Text;                                        // 0x02E0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         MinIntegralDigits;                                 // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxIntegralDigits;                                 // 0x02FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MinFractionalDigits;                               // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxFractionalDigits;                               // 0x0304(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxSensitivityValue;                               // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinSensitivityValue;                               // 0x030C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERoundingMode                                 RoundingMode;                                      // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           Tooltip_Timer;                                     // 0x0318(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          DisplayRenderScale;                                // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_321[0x3];                                      // 0x0321(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PreviousValue;                                     // 0x0324(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HideLabelText;                                     // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_329[0x3];                                      // 0x0329(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              ToolTipSizeMobile;                                 // 0x032C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HideSpaceRight;                                    // 0x0334(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_OptionsMenuIntegerSlider(int32 EntryPoint);
	void Refresh();
	void BndEvt__MenuSlider_K2Node_ComponentBoundEvent_9_OnFloatValueChangedEvent__DelegateSignature(float Value);
	void BndEvt__MenuSlider_K2Node_ComponentBoundEvent_107_OnControllerCaptureEndEvent__DelegateSignature();
	void BndEvt__MenuSlider_K2Node_ComponentBoundEvent_86_OnMouseCaptureEndEvent__DelegateSignature();
	void CenterOnWidget();
	void UpdateSetting(class UCommonTextBlock* TooltipTextBlock);
	void BndEvt__ButtonTouchTooltip_K2Node_ComponentBoundEvent_69_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BP_OnEntryReleased();
	void BndEvt__MenuAnchorSettingDescription_K2Node_ComponentBoundEvent_22_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void BndEvt__MenuSlider_K2Node_ComponentBoundEvent_124_OnFloatValueChangedEvent__DelegateSignature(float Value);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void Construct();
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void UpdateSize();
	void HandlePawnSet();
	class UWidget* OnGetMenuContent();
	void Show_Tooltip();
	void Hide_Tooltip();
	void SetSliderTextRenderScale(float Scale_Normalized);
	void SetDarkTabStyle();
	void ConvertSliderValueToSettingsValue(float Param_SliderValue, float* SettingsValue);
	void UpdateSliderTexture();
	void ConvertSettingsValueToSliderValue(float SettingsValue, float* Param_SliderValue);
	void UpdateVisuals();
	void SetFontSize(class UCommonTextBlock* Text, int32 DefaulFontSize, int32 MobileFont);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"OptionsMenuIntegerSlider_C">();
	}
	static class UOptionsMenuIntegerSlider_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptionsMenuIntegerSlider_C>();
	}
};
static_assert(alignof(UOptionsMenuIntegerSlider_C) == 0x000008, "Wrong alignment on UOptionsMenuIntegerSlider_C");
static_assert(sizeof(UOptionsMenuIntegerSlider_C) == 0x000338, "Wrong size on UOptionsMenuIntegerSlider_C");
static_assert(offsetof(UOptionsMenuIntegerSlider_C, UberGraphFrame) == 0x000260, "Member 'UOptionsMenuIntegerSlider_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UOptionsMenuIntegerSlider_C, Button_0) == 0x000268, "Member 'UOptionsMenuIntegerSlider_C::Button_0' has a wrong offset!");
static_assert(offsetof(UOptionsMenuIntegerSlider_C, ButtonTouchTooltip) == 0x000270, "Member 'UOptionsMenuIntegerSlider_C::ButtonTouchTooltip' has a wrong offset!");
static_assert(offsetof(UOptionsMenuIntegerSlider_C, HorizontalBox_Right) == 0x000278, "Member 'UOptionsMenuIntegerSlider_C::HorizontalBox_Right' has a wrong offset!");
static_assert(offsetof(UOptionsMenuIntegerSlider_C, MenuAnchorSettingDescription) == 0x000280, "Member 'UOptionsMenuIntegerSlider_C::MenuAnchorSettingDescription' has a wrong offset!");
static_assert(offsetof(UOptionsMenuIntegerSlider_C, MenuSlider) == 0x000288, "Member 'UOptionsMenuIntegerSlider_C::MenuSlider' has a wrong offset!");
static_assert(offsetof(UOptionsMenuIntegerSlider_C, SizeBoxContainer) == 0x000290, "Member 'UOptionsMenuIntegerSlider_C::SizeBoxContainer' has a wrong offset!");
static_assert(offsetof(UOptionsMenuIntegerSlider_C, SizeBoxLabel) == 0x000298, "Member 'UOptionsMenuIntegerSlider_C::SizeBoxLabel' has a wrong offset!");
static_assert(offsetof(UOptionsMenuIntegerSlider_C, SliderBackground) == 0x0002A0, "Member 'UOptionsMenuIntegerSlider_C::SliderBackground' has a wrong offset!");
static_assert(offsetof(UOptionsMenuIntegerSlider_C, SliderText) == 0x0002A8, "Member 'UOptionsMenuIntegerSlider_C::SliderText' has a wrong offset!");
static_assert(offsetof(UOptionsMenuIntegerSlider_C, SliderValue) == 0x0002B0, "Member 'UOptionsMenuIntegerSlider_C::SliderValue' has a wrong offset!");
static_assert(offsetof(UOptionsMenuIntegerSlider_C, Spacer_Right) == 0x0002B8, "Member 'UOptionsMenuIntegerSlider_C::Spacer_Right' has a wrong offset!");
static_assert(offsetof(UOptionsMenuIntegerSlider_C, SpacerBottom) == 0x0002C0, "Member 'UOptionsMenuIntegerSlider_C::SpacerBottom' has a wrong offset!");
static_assert(offsetof(UOptionsMenuIntegerSlider_C, Total_Width) == 0x0002C8, "Member 'UOptionsMenuIntegerSlider_C::Total_Width' has a wrong offset!");
static_assert(offsetof(UOptionsMenuIntegerSlider_C, Slider_Texture) == 0x0002D0, "Member 'UOptionsMenuIntegerSlider_C::Slider_Texture' has a wrong offset!");
static_assert(offsetof(UOptionsMenuIntegerSlider_C, Tab_Tooltip_Text) == 0x0002D8, "Member 'UOptionsMenuIntegerSlider_C::Tab_Tooltip_Text' has a wrong offset!");
static_assert(offsetof(UOptionsMenuIntegerSlider_C, Hover_Text) == 0x0002E0, "Member 'UOptionsMenuIntegerSlider_C::Hover_Text' has a wrong offset!");
static_assert(offsetof(UOptionsMenuIntegerSlider_C, MinIntegralDigits) == 0x0002F8, "Member 'UOptionsMenuIntegerSlider_C::MinIntegralDigits' has a wrong offset!");
static_assert(offsetof(UOptionsMenuIntegerSlider_C, MaxIntegralDigits) == 0x0002FC, "Member 'UOptionsMenuIntegerSlider_C::MaxIntegralDigits' has a wrong offset!");
static_assert(offsetof(UOptionsMenuIntegerSlider_C, MinFractionalDigits) == 0x000300, "Member 'UOptionsMenuIntegerSlider_C::MinFractionalDigits' has a wrong offset!");
static_assert(offsetof(UOptionsMenuIntegerSlider_C, MaxFractionalDigits) == 0x000304, "Member 'UOptionsMenuIntegerSlider_C::MaxFractionalDigits' has a wrong offset!");
static_assert(offsetof(UOptionsMenuIntegerSlider_C, MaxSensitivityValue) == 0x000308, "Member 'UOptionsMenuIntegerSlider_C::MaxSensitivityValue' has a wrong offset!");
static_assert(offsetof(UOptionsMenuIntegerSlider_C, MinSensitivityValue) == 0x00030C, "Member 'UOptionsMenuIntegerSlider_C::MinSensitivityValue' has a wrong offset!");
static_assert(offsetof(UOptionsMenuIntegerSlider_C, RoundingMode) == 0x000310, "Member 'UOptionsMenuIntegerSlider_C::RoundingMode' has a wrong offset!");
static_assert(offsetof(UOptionsMenuIntegerSlider_C, Tooltip_Timer) == 0x000318, "Member 'UOptionsMenuIntegerSlider_C::Tooltip_Timer' has a wrong offset!");
static_assert(offsetof(UOptionsMenuIntegerSlider_C, DisplayRenderScale) == 0x000320, "Member 'UOptionsMenuIntegerSlider_C::DisplayRenderScale' has a wrong offset!");
static_assert(offsetof(UOptionsMenuIntegerSlider_C, PreviousValue) == 0x000324, "Member 'UOptionsMenuIntegerSlider_C::PreviousValue' has a wrong offset!");
static_assert(offsetof(UOptionsMenuIntegerSlider_C, HideLabelText) == 0x000328, "Member 'UOptionsMenuIntegerSlider_C::HideLabelText' has a wrong offset!");
static_assert(offsetof(UOptionsMenuIntegerSlider_C, ToolTipSizeMobile) == 0x00032C, "Member 'UOptionsMenuIntegerSlider_C::ToolTipSizeMobile' has a wrong offset!");
static_assert(offsetof(UOptionsMenuIntegerSlider_C, HideSpaceRight) == 0x000334, "Member 'UOptionsMenuIntegerSlider_C::HideSpaceRight' has a wrong offset!");

}

