#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PartyMemberListEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PartyMemberListEntry.PartyMemberListEntry_C
// 0x0068 (0x0BF8 - 0x0B90)
class UPartyMemberListEntry_C final : public UFortPartyMemberListEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B90(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Selected;                                          // 0x0B98(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hovered;                                           // 0x0BA0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                AnimatedInputBorder;                               // 0x0BA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Arrow;                                             // 0x0BB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_OnlineStatusIndicator;                      // 0x0BB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      EmptyButtonToEatOneMouseUpEvent;                   // 0x0BC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                EntryBorder;                                       // 0x0BC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Encourage;                                         // 0x0BD0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD1[0x3];                                      // 0x0BD1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           EncourageEpicFriend_IdleColor;                     // 0x0BD4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           EncourageEpicFriend_HoveredColor;                  // 0x0BE4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PartyMemberListEntry(int32 EntryPoint);
	void BP_OnHovered();
	void BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen);
	void BP_OnUnhovered();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PartyMemberListEntry_C">();
	}
	static class UPartyMemberListEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPartyMemberListEntry_C>();
	}
};
static_assert(alignof(UPartyMemberListEntry_C) == 0x000008, "Wrong alignment on UPartyMemberListEntry_C");
static_assert(sizeof(UPartyMemberListEntry_C) == 0x000BF8, "Wrong size on UPartyMemberListEntry_C");
static_assert(offsetof(UPartyMemberListEntry_C, UberGraphFrame) == 0x000B90, "Member 'UPartyMemberListEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPartyMemberListEntry_C, Selected) == 0x000B98, "Member 'UPartyMemberListEntry_C::Selected' has a wrong offset!");
static_assert(offsetof(UPartyMemberListEntry_C, Hovered) == 0x000BA0, "Member 'UPartyMemberListEntry_C::Hovered' has a wrong offset!");
static_assert(offsetof(UPartyMemberListEntry_C, AnimatedInputBorder) == 0x000BA8, "Member 'UPartyMemberListEntry_C::AnimatedInputBorder' has a wrong offset!");
static_assert(offsetof(UPartyMemberListEntry_C, Arrow) == 0x000BB0, "Member 'UPartyMemberListEntry_C::Arrow' has a wrong offset!");
static_assert(offsetof(UPartyMemberListEntry_C, Border_OnlineStatusIndicator) == 0x000BB8, "Member 'UPartyMemberListEntry_C::Border_OnlineStatusIndicator' has a wrong offset!");
static_assert(offsetof(UPartyMemberListEntry_C, EmptyButtonToEatOneMouseUpEvent) == 0x000BC0, "Member 'UPartyMemberListEntry_C::EmptyButtonToEatOneMouseUpEvent' has a wrong offset!");
static_assert(offsetof(UPartyMemberListEntry_C, EntryBorder) == 0x000BC8, "Member 'UPartyMemberListEntry_C::EntryBorder' has a wrong offset!");
static_assert(offsetof(UPartyMemberListEntry_C, Encourage) == 0x000BD0, "Member 'UPartyMemberListEntry_C::Encourage' has a wrong offset!");
static_assert(offsetof(UPartyMemberListEntry_C, EncourageEpicFriend_IdleColor) == 0x000BD4, "Member 'UPartyMemberListEntry_C::EncourageEpicFriend_IdleColor' has a wrong offset!");
static_assert(offsetof(UPartyMemberListEntry_C, EncourageEpicFriend_HoveredColor) == 0x000BE4, "Member 'UPartyMemberListEntry_C::EncourageEpicFriend_HoveredColor' has a wrong offset!");

}

