#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerPawn_Generic_Parent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function PlayerPawn_Generic_Parent.PlayerPawn_Generic_Parent_C.ExecuteUbergraph_PlayerPawn_Generic_Parent
// 0x0090 (0x0090 - 0x0000)
struct PlayerPawn_Generic_Parent_C_ExecuteUbergraph_PlayerPawn_Generic_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPostProcessComponent*                  CallFunc_AddComponent_ReturnValue;                 // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0xF];                                       // 0x0051(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_CustomEvent_NewTransform;                   // 0x0060(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerPawn_Generic_Parent_C_ExecuteUbergraph_PlayerPawn_Generic_Parent) == 0x000010, "Wrong alignment on PlayerPawn_Generic_Parent_C_ExecuteUbergraph_PlayerPawn_Generic_Parent");
static_assert(sizeof(PlayerPawn_Generic_Parent_C_ExecuteUbergraph_PlayerPawn_Generic_Parent) == 0x000090, "Wrong size on PlayerPawn_Generic_Parent_C_ExecuteUbergraph_PlayerPawn_Generic_Parent");
static_assert(offsetof(PlayerPawn_Generic_Parent_C_ExecuteUbergraph_PlayerPawn_Generic_Parent, EntryPoint) == 0x000000, "Member 'PlayerPawn_Generic_Parent_C_ExecuteUbergraph_PlayerPawn_Generic_Parent::EntryPoint' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Generic_Parent_C_ExecuteUbergraph_PlayerPawn_Generic_Parent, Temp_struct_Variable) == 0x000010, "Member 'PlayerPawn_Generic_Parent_C_ExecuteUbergraph_PlayerPawn_Generic_Parent::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Generic_Parent_C_ExecuteUbergraph_PlayerPawn_Generic_Parent, CallFunc_IsLocallyControlled_ReturnValue) == 0x000040, "Member 'PlayerPawn_Generic_Parent_C_ExecuteUbergraph_PlayerPawn_Generic_Parent::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Generic_Parent_C_ExecuteUbergraph_PlayerPawn_Generic_Parent, CallFunc_AddComponent_ReturnValue) == 0x000048, "Member 'PlayerPawn_Generic_Parent_C_ExecuteUbergraph_PlayerPawn_Generic_Parent::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Generic_Parent_C_ExecuteUbergraph_PlayerPawn_Generic_Parent, CallFunc_IsDedicatedServer_ReturnValue) == 0x000050, "Member 'PlayerPawn_Generic_Parent_C_ExecuteUbergraph_PlayerPawn_Generic_Parent::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Generic_Parent_C_ExecuteUbergraph_PlayerPawn_Generic_Parent, K2Node_CustomEvent_NewTransform) == 0x000060, "Member 'PlayerPawn_Generic_Parent_C_ExecuteUbergraph_PlayerPawn_Generic_Parent::K2Node_CustomEvent_NewTransform' has a wrong offset!");

// Function PlayerPawn_Generic_Parent.PlayerPawn_Generic_Parent_C.Player Creates a Splash
// 0x0030 (0x0030 - 0x0000)
struct PlayerPawn_Generic_Parent_C_Player_Creates_a_Splash final
{
public:
	struct FTransform                             NewTransform;                                      // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerPawn_Generic_Parent_C_Player_Creates_a_Splash) == 0x000010, "Wrong alignment on PlayerPawn_Generic_Parent_C_Player_Creates_a_Splash");
static_assert(sizeof(PlayerPawn_Generic_Parent_C_Player_Creates_a_Splash) == 0x000030, "Wrong size on PlayerPawn_Generic_Parent_C_Player_Creates_a_Splash");
static_assert(offsetof(PlayerPawn_Generic_Parent_C_Player_Creates_a_Splash, NewTransform) == 0x000000, "Member 'PlayerPawn_Generic_Parent_C_Player_Creates_a_Splash::NewTransform' has a wrong offset!");

}

