#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerBanner

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function PlayerBanner.PlayerBanner_C.ExecuteUbergraph_PlayerBanner
// 0x0250 (0x0250 - 0x0000)
struct PlayerBanner_C_ExecuteUbergraph_PlayerBanner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortTeamMemberInfo                    K2Node_CustomEvent_TeamMemberInfo;                 // 0x0008(0x0200)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_UniqueNetIdRepl_ReturnValue;      // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetBannerImage_Success;                   // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_UniqueNetIdReplUniqueNetIdRepl_ReturnValue; // 0x020A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x020B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFortPublicAccountInfo                 K2Node_CustomEvent_NewInfo;                        // 0x020C(0x0034)(NoDestructor)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESubGame                                      CallFunc_GetSubGame_ReturnValue;                   // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerBanner_C_ExecuteUbergraph_PlayerBanner) == 0x000008, "Wrong alignment on PlayerBanner_C_ExecuteUbergraph_PlayerBanner");
static_assert(sizeof(PlayerBanner_C_ExecuteUbergraph_PlayerBanner) == 0x000250, "Wrong size on PlayerBanner_C_ExecuteUbergraph_PlayerBanner");
static_assert(offsetof(PlayerBanner_C_ExecuteUbergraph_PlayerBanner, EntryPoint) == 0x000000, "Member 'PlayerBanner_C_ExecuteUbergraph_PlayerBanner::EntryPoint' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_ExecuteUbergraph_PlayerBanner, K2Node_CustomEvent_TeamMemberInfo) == 0x000008, "Member 'PlayerBanner_C_ExecuteUbergraph_PlayerBanner::K2Node_CustomEvent_TeamMemberInfo' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_ExecuteUbergraph_PlayerBanner, CallFunc_IsValid_UniqueNetIdRepl_ReturnValue) == 0x000208, "Member 'PlayerBanner_C_ExecuteUbergraph_PlayerBanner::CallFunc_IsValid_UniqueNetIdRepl_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_ExecuteUbergraph_PlayerBanner, CallFunc_SetBannerImage_Success) == 0x000209, "Member 'PlayerBanner_C_ExecuteUbergraph_PlayerBanner::CallFunc_SetBannerImage_Success' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_ExecuteUbergraph_PlayerBanner, CallFunc_EqualEqual_UniqueNetIdReplUniqueNetIdRepl_ReturnValue) == 0x00020A, "Member 'PlayerBanner_C_ExecuteUbergraph_PlayerBanner::CallFunc_EqualEqual_UniqueNetIdReplUniqueNetIdRepl_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_ExecuteUbergraph_PlayerBanner, CallFunc_BooleanAND_ReturnValue) == 0x00020B, "Member 'PlayerBanner_C_ExecuteUbergraph_PlayerBanner::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_ExecuteUbergraph_PlayerBanner, K2Node_CustomEvent_NewInfo) == 0x00020C, "Member 'PlayerBanner_C_ExecuteUbergraph_PlayerBanner::K2Node_CustomEvent_NewInfo' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_ExecuteUbergraph_PlayerBanner, CallFunc_GetContext_ReturnValue) == 0x000240, "Member 'PlayerBanner_C_ExecuteUbergraph_PlayerBanner::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_ExecuteUbergraph_PlayerBanner, CallFunc_GetSubGame_ReturnValue) == 0x000248, "Member 'PlayerBanner_C_ExecuteUbergraph_PlayerBanner::CallFunc_GetSubGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_ExecuteUbergraph_PlayerBanner, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000249, "Member 'PlayerBanner_C_ExecuteUbergraph_PlayerBanner::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function PlayerBanner.PlayerBanner_C.Account Info Changed
// 0x0034 (0x0034 - 0x0000)
struct PlayerBanner_C_Account_Info_Changed final
{
public:
	struct FFortPublicAccountInfo                 NewInfo;                                           // 0x0000(0x0034)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(PlayerBanner_C_Account_Info_Changed) == 0x000004, "Wrong alignment on PlayerBanner_C_Account_Info_Changed");
static_assert(sizeof(PlayerBanner_C_Account_Info_Changed) == 0x000034, "Wrong size on PlayerBanner_C_Account_Info_Changed");
static_assert(offsetof(PlayerBanner_C_Account_Info_Changed, NewInfo) == 0x000000, "Member 'PlayerBanner_C_Account_Info_Changed::NewInfo' has a wrong offset!");

// Function PlayerBanner.PlayerBanner_C.OnTeamMemberStateChanged
// 0x0200 (0x0200 - 0x0000)
struct PlayerBanner_C_OnTeamMemberStateChanged final
{
public:
	struct FFortTeamMemberInfo                    TeamMemberInfo;                                    // 0x0000(0x0200)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(PlayerBanner_C_OnTeamMemberStateChanged) == 0x000008, "Wrong alignment on PlayerBanner_C_OnTeamMemberStateChanged");
static_assert(sizeof(PlayerBanner_C_OnTeamMemberStateChanged) == 0x000200, "Wrong size on PlayerBanner_C_OnTeamMemberStateChanged");
static_assert(offsetof(PlayerBanner_C_OnTeamMemberStateChanged, TeamMemberInfo) == 0x000000, "Member 'PlayerBanner_C_OnTeamMemberStateChanged::TeamMemberInfo' has a wrong offset!");

// Function PlayerBanner.PlayerBanner_C.SetBannerImage
// 0x0058 (0x0058 - 0x0000)
struct PlayerBanner_C_SetBannerImage final
{
public:
	struct FFortHomeBaseInfo                      Image_info;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Success;                                           // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerBanner_C_SetBannerImage) == 0x000008, "Wrong alignment on PlayerBanner_C_SetBannerImage");
static_assert(sizeof(PlayerBanner_C_SetBannerImage) == 0x000058, "Wrong size on PlayerBanner_C_SetBannerImage");
static_assert(offsetof(PlayerBanner_C_SetBannerImage, Image_info) == 0x000000, "Member 'PlayerBanner_C_SetBannerImage::Image_info' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_SetBannerImage, Success) == 0x000040, "Member 'PlayerBanner_C_SetBannerImage::Success' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_SetBannerImage, CallFunc_Conv_StringToName_ReturnValue) == 0x000044, "Member 'PlayerBanner_C_SetBannerImage::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_SetBannerImage, CallFunc_Conv_StringToName_ReturnValue_1) == 0x00004C, "Member 'PlayerBanner_C_SetBannerImage::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");

// Function PlayerBanner.PlayerBanner_C.SetBannerIconId
// 0x00A8 (0x00A8 - 0x0000)
struct PlayerBanner_C_SetBannerIconId final
{
public:
	class FName                                   InBannerIconId;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Option_B___If_false__use_Option_A_Variable; // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetBannerSmallIconAssetFromRowName_ReturnValue; // 0x0020(0x0028)(HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetBannerLargeIconAssetFromRowName_ReturnValue; // 0x0048(0x0028)(HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 K2Node_Select_Default;                             // 0x0070(0x0028)(HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetBannerMID_BannerMID;                   // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue_1;          // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerBanner_C_SetBannerIconId) == 0x000008, "Wrong alignment on PlayerBanner_C_SetBannerIconId");
static_assert(sizeof(PlayerBanner_C_SetBannerIconId) == 0x0000A8, "Wrong size on PlayerBanner_C_SetBannerIconId");
static_assert(offsetof(PlayerBanner_C_SetBannerIconId, InBannerIconId) == 0x000000, "Member 'PlayerBanner_C_SetBannerIconId::InBannerIconId' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_SetBannerIconId, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'PlayerBanner_C_SetBannerIconId::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_SetBannerIconId, Temp_bool_Option_B___If_false__use_Option_A_Variable) == 0x000018, "Member 'PlayerBanner_C_SetBannerIconId::Temp_bool_Option_B___If_false__use_Option_A_Variable' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_SetBannerIconId, CallFunc_NotEqual_NameName_ReturnValue) == 0x000019, "Member 'PlayerBanner_C_SetBannerIconId::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_SetBannerIconId, Temp_bool_Variable) == 0x00001A, "Member 'PlayerBanner_C_SetBannerIconId::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_SetBannerIconId, CallFunc_GetBannerSmallIconAssetFromRowName_ReturnValue) == 0x000020, "Member 'PlayerBanner_C_SetBannerIconId::CallFunc_GetBannerSmallIconAssetFromRowName_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_SetBannerIconId, CallFunc_GetBannerLargeIconAssetFromRowName_ReturnValue) == 0x000048, "Member 'PlayerBanner_C_SetBannerIconId::CallFunc_GetBannerLargeIconAssetFromRowName_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_SetBannerIconId, K2Node_Select_Default) == 0x000070, "Member 'PlayerBanner_C_SetBannerIconId::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_SetBannerIconId, CallFunc_GetBannerMID_BannerMID) == 0x000098, "Member 'PlayerBanner_C_SetBannerIconId::CallFunc_GetBannerMID_BannerMID' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_SetBannerIconId, CallFunc_NotEqual_NameName_ReturnValue_1) == 0x0000A0, "Member 'PlayerBanner_C_SetBannerIconId::CallFunc_NotEqual_NameName_ReturnValue_1' has a wrong offset!");

// Function PlayerBanner.PlayerBanner_C.SetBannerColorId
// 0x0068 (0x0068 - 0x0000)
struct PlayerBanner_C_SetBannerColorId final
{
public:
	class FName                                   InBannerColorId;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetBannerMID_BannerMID;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHomebaseBannerColor                   CallFunc_GetBannerColorFromRowName_ReturnValue;    // 0x0014(0x0020)(NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetBannerMID_BannerMID_1;                 // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetSecondaryColor_ReturnValue;            // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetPrimaryColor_ReturnValue;              // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue_1;          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerBanner_C_SetBannerColorId) == 0x000008, "Wrong alignment on PlayerBanner_C_SetBannerColorId");
static_assert(sizeof(PlayerBanner_C_SetBannerColorId) == 0x000068, "Wrong size on PlayerBanner_C_SetBannerColorId");
static_assert(offsetof(PlayerBanner_C_SetBannerColorId, InBannerColorId) == 0x000000, "Member 'PlayerBanner_C_SetBannerColorId::InBannerColorId' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_SetBannerColorId, CallFunc_GetBannerMID_BannerMID) == 0x000008, "Member 'PlayerBanner_C_SetBannerColorId::CallFunc_GetBannerMID_BannerMID' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_SetBannerColorId, CallFunc_NotEqual_NameName_ReturnValue) == 0x000010, "Member 'PlayerBanner_C_SetBannerColorId::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_SetBannerColorId, CallFunc_GetBannerColorFromRowName_ReturnValue) == 0x000014, "Member 'PlayerBanner_C_SetBannerColorId::CallFunc_GetBannerColorFromRowName_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_SetBannerColorId, CallFunc_GetBannerMID_BannerMID_1) == 0x000038, "Member 'PlayerBanner_C_SetBannerColorId::CallFunc_GetBannerMID_BannerMID_1' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_SetBannerColorId, CallFunc_GetSecondaryColor_ReturnValue) == 0x000040, "Member 'PlayerBanner_C_SetBannerColorId::CallFunc_GetSecondaryColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_SetBannerColorId, CallFunc_GetPrimaryColor_ReturnValue) == 0x000050, "Member 'PlayerBanner_C_SetBannerColorId::CallFunc_GetPrimaryColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_SetBannerColorId, CallFunc_NotEqual_NameName_ReturnValue_1) == 0x000060, "Member 'PlayerBanner_C_SetBannerColorId::CallFunc_NotEqual_NameName_ReturnValue_1' has a wrong offset!");

// Function PlayerBanner.PlayerBanner_C.SetBannerOwner
// 0x0068 (0x0068 - 0x0000)
struct PlayerBanner_C_SetBannerOwner final
{
public:
	struct FUniqueNetIdRepl                       OwnerId;                                           // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	TDelegate<void(const struct FFortPublicAccountInfo& NewInfo)> K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FFortTeamMemberInfo& TeamMemberInfo)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_UniqueNetIdRepl_ReturnValue;      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUITeamInfo*                        CallFunc_GetLocalPlayerTeam_ReturnValue;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue_1;                 // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerBanner_C_SetBannerOwner) == 0x000008, "Wrong alignment on PlayerBanner_C_SetBannerOwner");
static_assert(sizeof(PlayerBanner_C_SetBannerOwner) == 0x000068, "Wrong size on PlayerBanner_C_SetBannerOwner");
static_assert(offsetof(PlayerBanner_C_SetBannerOwner, OwnerId) == 0x000000, "Member 'PlayerBanner_C_SetBannerOwner::OwnerId' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_SetBannerOwner, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'PlayerBanner_C_SetBannerOwner::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_SetBannerOwner, K2Node_CreateDelegate_OutputDelegate_1) == 0x000038, "Member 'PlayerBanner_C_SetBannerOwner::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_SetBannerOwner, CallFunc_GetContext_ReturnValue) == 0x000048, "Member 'PlayerBanner_C_SetBannerOwner::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_SetBannerOwner, CallFunc_IsValid_UniqueNetIdRepl_ReturnValue) == 0x000050, "Member 'PlayerBanner_C_SetBannerOwner::CallFunc_IsValid_UniqueNetIdRepl_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_SetBannerOwner, CallFunc_GetLocalPlayerTeam_ReturnValue) == 0x000058, "Member 'PlayerBanner_C_SetBannerOwner::CallFunc_GetLocalPlayerTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_SetBannerOwner, CallFunc_GetContext_ReturnValue_1) == 0x000060, "Member 'PlayerBanner_C_SetBannerOwner::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");

// Function PlayerBanner.PlayerBanner_C.GetBannerMID
// 0x0010 (0x0010 - 0x0000)
struct PlayerBanner_C_GetBannerMID final
{
public:
	class UMaterialInstanceDynamic*               BannerMID;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerBanner_C_GetBannerMID) == 0x000008, "Wrong alignment on PlayerBanner_C_GetBannerMID");
static_assert(sizeof(PlayerBanner_C_GetBannerMID) == 0x000010, "Wrong size on PlayerBanner_C_GetBannerMID");
static_assert(offsetof(PlayerBanner_C_GetBannerMID, BannerMID) == 0x000000, "Member 'PlayerBanner_C_GetBannerMID::BannerMID' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_GetBannerMID, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'PlayerBanner_C_GetBannerMID::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function PlayerBanner.PlayerBanner_C.OnBannerIconLoaded
// 0x0020 (0x0020 - 0x0000)
struct PlayerBanner_C_OnBannerIconLoaded final
{
public:
	class UObject*                                LoadedObject;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetBannerMID_BannerMID;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               K2Node_DynamicCast_AsTexture;                      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerBanner_C_OnBannerIconLoaded) == 0x000008, "Wrong alignment on PlayerBanner_C_OnBannerIconLoaded");
static_assert(sizeof(PlayerBanner_C_OnBannerIconLoaded) == 0x000020, "Wrong size on PlayerBanner_C_OnBannerIconLoaded");
static_assert(offsetof(PlayerBanner_C_OnBannerIconLoaded, LoadedObject) == 0x000000, "Member 'PlayerBanner_C_OnBannerIconLoaded::LoadedObject' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_OnBannerIconLoaded, CallFunc_GetBannerMID_BannerMID) == 0x000008, "Member 'PlayerBanner_C_OnBannerIconLoaded::CallFunc_GetBannerMID_BannerMID' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_OnBannerIconLoaded, K2Node_DynamicCast_AsTexture) == 0x000010, "Member 'PlayerBanner_C_OnBannerIconLoaded::K2Node_DynamicCast_AsTexture' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_OnBannerIconLoaded, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'PlayerBanner_C_OnBannerIconLoaded::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function PlayerBanner.PlayerBanner_C.OnSurroundIconLoaded
// 0x0020 (0x0020 - 0x0000)
struct PlayerBanner_C_OnSurroundIconLoaded final
{
public:
	class UObject*                                LoadedObject;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               K2Node_DynamicCast_AsTexture;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerBanner_C_OnSurroundIconLoaded) == 0x000008, "Wrong alignment on PlayerBanner_C_OnSurroundIconLoaded");
static_assert(sizeof(PlayerBanner_C_OnSurroundIconLoaded) == 0x000020, "Wrong size on PlayerBanner_C_OnSurroundIconLoaded");
static_assert(offsetof(PlayerBanner_C_OnSurroundIconLoaded, LoadedObject) == 0x000000, "Member 'PlayerBanner_C_OnSurroundIconLoaded::LoadedObject' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_OnSurroundIconLoaded, K2Node_DynamicCast_AsTexture) == 0x000008, "Member 'PlayerBanner_C_OnSurroundIconLoaded::K2Node_DynamicCast_AsTexture' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_OnSurroundIconLoaded, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'PlayerBanner_C_OnSurroundIconLoaded::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_OnSurroundIconLoaded, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000018, "Member 'PlayerBanner_C_OnSurroundIconLoaded::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function PlayerBanner.PlayerBanner_C.RefreshSurround
// 0x0090 (0x0090 - 0x0000)
struct PlayerBanner_C_RefreshSurround final
{
public:
	int32                                         Level;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAthenaSeasonBannerLevel               CallFunc_GetSeasonBannerInfo_ReturnValue;          // 0x0008(0x0050)()
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAssetNull_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_DynamicCast_AsMaterial_Interface;           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Object)>        K2Node_CreateDelegate_OutputDelegate;              // 0x007C(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(PlayerBanner_C_RefreshSurround) == 0x000008, "Wrong alignment on PlayerBanner_C_RefreshSurround");
static_assert(sizeof(PlayerBanner_C_RefreshSurround) == 0x000090, "Wrong size on PlayerBanner_C_RefreshSurround");
static_assert(offsetof(PlayerBanner_C_RefreshSurround, Level) == 0x000000, "Member 'PlayerBanner_C_RefreshSurround::Level' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_RefreshSurround, CallFunc_GetSeasonBannerInfo_ReturnValue) == 0x000008, "Member 'PlayerBanner_C_RefreshSurround::CallFunc_GetSeasonBannerInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_RefreshSurround, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000058, "Member 'PlayerBanner_C_RefreshSurround::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_RefreshSurround, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000060, "Member 'PlayerBanner_C_RefreshSurround::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_RefreshSurround, CallFunc_IsAssetNull_ReturnValue) == 0x000068, "Member 'PlayerBanner_C_RefreshSurround::CallFunc_IsAssetNull_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_RefreshSurround, K2Node_DynamicCast_AsMaterial_Interface) == 0x000070, "Member 'PlayerBanner_C_RefreshSurround::K2Node_DynamicCast_AsMaterial_Interface' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_RefreshSurround, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'PlayerBanner_C_RefreshSurround::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_RefreshSurround, K2Node_CreateDelegate_OutputDelegate) == 0x00007C, "Member 'PlayerBanner_C_RefreshSurround::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function PlayerBanner.PlayerBanner_C.ToggleBannerMask
// 0x0020 (0x0020 - 0x0000)
struct PlayerBanner_C_ToggleBannerMask final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetBannerMID_BannerMID;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerBanner_C_ToggleBannerMask) == 0x000008, "Wrong alignment on PlayerBanner_C_ToggleBannerMask");
static_assert(sizeof(PlayerBanner_C_ToggleBannerMask) == 0x000020, "Wrong size on PlayerBanner_C_ToggleBannerMask");
static_assert(offsetof(PlayerBanner_C_ToggleBannerMask, Enable) == 0x000000, "Member 'PlayerBanner_C_ToggleBannerMask::Enable' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_ToggleBannerMask, Temp_bool_Variable) == 0x000001, "Member 'PlayerBanner_C_ToggleBannerMask::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_ToggleBannerMask, Temp_float_Variable) == 0x000004, "Member 'PlayerBanner_C_ToggleBannerMask::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_ToggleBannerMask, Temp_float_Variable_1) == 0x000008, "Member 'PlayerBanner_C_ToggleBannerMask::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_ToggleBannerMask, CallFunc_GetBannerMID_BannerMID) == 0x000010, "Member 'PlayerBanner_C_ToggleBannerMask::CallFunc_GetBannerMID_BannerMID' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_ToggleBannerMask, K2Node_Select_Default) == 0x000018, "Member 'PlayerBanner_C_ToggleBannerMask::K2Node_Select_Default' has a wrong offset!");

// Function PlayerBanner.PlayerBanner_C.SetBannerIconAndColor
// 0x0010 (0x0010 - 0x0000)
struct PlayerBanner_C_SetBannerIconAndColor final
{
public:
	class FName                                   IconId;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ColorId;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerBanner_C_SetBannerIconAndColor) == 0x000004, "Wrong alignment on PlayerBanner_C_SetBannerIconAndColor");
static_assert(sizeof(PlayerBanner_C_SetBannerIconAndColor) == 0x000010, "Wrong size on PlayerBanner_C_SetBannerIconAndColor");
static_assert(offsetof(PlayerBanner_C_SetBannerIconAndColor, IconId) == 0x000000, "Member 'PlayerBanner_C_SetBannerIconAndColor::IconId' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_SetBannerIconAndColor, ColorId) == 0x000008, "Member 'PlayerBanner_C_SetBannerIconAndColor::ColorId' has a wrong offset!");

// Function PlayerBanner.PlayerBanner_C.SetBannerIconAndColorFromProfile
// 0x0168 (0x0168 - 0x0000)
struct PlayerBanner_C_SetBannerIconAndColorFromProfile final
{
public:
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue_1;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue_2;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortAthenaLoadout                     CallFunc_GetLoadoutForPlayer_ReturnValue;          // 0x0018(0x00F0)()
	ESubGame                                      CallFunc_GetSubGame_ReturnValue;                   // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10A[0x2];                                      // 0x010A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x010C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x0114(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortHomeBaseInfo                      CallFunc_GetHomeBaseInfoForPlayer_Result;          // 0x0120(0x0040)()
	bool                                          CallFunc_SetBannerImage_Success;                   // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerBanner_C_SetBannerIconAndColorFromProfile) == 0x000008, "Wrong alignment on PlayerBanner_C_SetBannerIconAndColorFromProfile");
static_assert(sizeof(PlayerBanner_C_SetBannerIconAndColorFromProfile) == 0x000168, "Wrong size on PlayerBanner_C_SetBannerIconAndColorFromProfile");
static_assert(offsetof(PlayerBanner_C_SetBannerIconAndColorFromProfile, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'PlayerBanner_C_SetBannerIconAndColorFromProfile::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_SetBannerIconAndColorFromProfile, CallFunc_GetContext_ReturnValue_1) == 0x000008, "Member 'PlayerBanner_C_SetBannerIconAndColorFromProfile::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_SetBannerIconAndColorFromProfile, CallFunc_GetContext_ReturnValue_2) == 0x000010, "Member 'PlayerBanner_C_SetBannerIconAndColorFromProfile::CallFunc_GetContext_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_SetBannerIconAndColorFromProfile, CallFunc_GetLoadoutForPlayer_ReturnValue) == 0x000018, "Member 'PlayerBanner_C_SetBannerIconAndColorFromProfile::CallFunc_GetLoadoutForPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_SetBannerIconAndColorFromProfile, CallFunc_GetSubGame_ReturnValue) == 0x000108, "Member 'PlayerBanner_C_SetBannerIconAndColorFromProfile::CallFunc_GetSubGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_SetBannerIconAndColorFromProfile, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000109, "Member 'PlayerBanner_C_SetBannerIconAndColorFromProfile::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_SetBannerIconAndColorFromProfile, CallFunc_Conv_StringToName_ReturnValue) == 0x00010C, "Member 'PlayerBanner_C_SetBannerIconAndColorFromProfile::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_SetBannerIconAndColorFromProfile, CallFunc_Conv_StringToName_ReturnValue_1) == 0x000114, "Member 'PlayerBanner_C_SetBannerIconAndColorFromProfile::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_SetBannerIconAndColorFromProfile, CallFunc_GetHomeBaseInfoForPlayer_Result) == 0x000120, "Member 'PlayerBanner_C_SetBannerIconAndColorFromProfile::CallFunc_GetHomeBaseInfoForPlayer_Result' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_SetBannerIconAndColorFromProfile, CallFunc_SetBannerImage_Success) == 0x000160, "Member 'PlayerBanner_C_SetBannerIconAndColorFromProfile::CallFunc_SetBannerImage_Success' has a wrong offset!");

// Function PlayerBanner.PlayerBanner_C.SetupSurround
// 0x0020 (0x0020 - 0x0000)
struct PlayerBanner_C_SetupSurround final
{
public:
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ULoadGuardSlot*                         K2Node_DynamicCast_AsLoad_Guard_Slot;              // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerBanner_C_SetupSurround) == 0x000008, "Wrong alignment on PlayerBanner_C_SetupSurround");
static_assert(sizeof(PlayerBanner_C_SetupSurround) == 0x000020, "Wrong size on PlayerBanner_C_SetupSurround");
static_assert(offsetof(PlayerBanner_C_SetupSurround, K2Node_MakeStruct_Margin) == 0x000000, "Member 'PlayerBanner_C_SetupSurround::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_SetupSurround, K2Node_DynamicCast_AsLoad_Guard_Slot) == 0x000010, "Member 'PlayerBanner_C_SetupSurround::K2Node_DynamicCast_AsLoad_Guard_Slot' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_SetupSurround, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'PlayerBanner_C_SetupSurround::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function PlayerBanner.PlayerBanner_C.UnbindDelegates
// 0x0038 (0x0038 - 0x0000)
struct PlayerBanner_C_UnbindDelegates final
{
public:
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FFortPublicAccountInfo& NewInfo)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UFortUITeamInfo*                        CallFunc_GetLocalPlayerTeam_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FFortTeamMemberInfo& TeamMemberInfo)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue_1;                 // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerBanner_C_UnbindDelegates) == 0x000008, "Wrong alignment on PlayerBanner_C_UnbindDelegates");
static_assert(sizeof(PlayerBanner_C_UnbindDelegates) == 0x000038, "Wrong size on PlayerBanner_C_UnbindDelegates");
static_assert(offsetof(PlayerBanner_C_UnbindDelegates, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'PlayerBanner_C_UnbindDelegates::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_UnbindDelegates, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'PlayerBanner_C_UnbindDelegates::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PlayerBanner_C_UnbindDelegates, CallFunc_GetLocalPlayerTeam_ReturnValue) == 0x000018, "Member 'PlayerBanner_C_UnbindDelegates::CallFunc_GetLocalPlayerTeam_ReturnValue' has a wrong offset!");
