#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RebootCardIndicator

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass RebootCardIndicator.RebootCardIndicator_C
// 0x0050 (0x04A8 - 0x0458)
class URebootCardIndicator_C final : public UAthenaRebootCardIndicator
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0458(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       UpdateTime;                                        // 0x0460(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Nameplate;                                  // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 burst;                                             // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_RebootIcon;                                  // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                IndicatorSpacer;                                   // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         RebootCountdownContainer;                          // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TimeText;                                          // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         CurTime;                                           // 0x0498(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EndTime;                                           // 0x049C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TimerHandle;                                       // 0x04A0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_RebootCardIndicator(int32 EntryPoint);
	void HandleDisplayForSelf(bool bSelf);
	void UpdateCountdownText();
	void SetupCountdown(float StartTimeLocalWorld, float EndTimeLocalWorld);
	void bp_UpdateCountdownText();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RebootCardIndicator_C">();
	}
	static class URebootCardIndicator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URebootCardIndicator_C>();
	}
};
static_assert(alignof(URebootCardIndicator_C) == 0x000008, "Wrong alignment on URebootCardIndicator_C");
static_assert(sizeof(URebootCardIndicator_C) == 0x0004A8, "Wrong size on URebootCardIndicator_C");
static_assert(offsetof(URebootCardIndicator_C, UberGraphFrame) == 0x000458, "Member 'URebootCardIndicator_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(URebootCardIndicator_C, UpdateTime) == 0x000460, "Member 'URebootCardIndicator_C::UpdateTime' has a wrong offset!");
static_assert(offsetof(URebootCardIndicator_C, Border_Nameplate) == 0x000468, "Member 'URebootCardIndicator_C::Border_Nameplate' has a wrong offset!");
static_assert(offsetof(URebootCardIndicator_C, burst) == 0x000470, "Member 'URebootCardIndicator_C::burst' has a wrong offset!");
static_assert(offsetof(URebootCardIndicator_C, Image_RebootIcon) == 0x000478, "Member 'URebootCardIndicator_C::Image_RebootIcon' has a wrong offset!");
static_assert(offsetof(URebootCardIndicator_C, IndicatorSpacer) == 0x000480, "Member 'URebootCardIndicator_C::IndicatorSpacer' has a wrong offset!");
static_assert(offsetof(URebootCardIndicator_C, RebootCountdownContainer) == 0x000488, "Member 'URebootCardIndicator_C::RebootCountdownContainer' has a wrong offset!");
static_assert(offsetof(URebootCardIndicator_C, TimeText) == 0x000490, "Member 'URebootCardIndicator_C::TimeText' has a wrong offset!");
static_assert(offsetof(URebootCardIndicator_C, CurTime) == 0x000498, "Member 'URebootCardIndicator_C::CurTime' has a wrong offset!");
static_assert(offsetof(URebootCardIndicator_C, EndTime) == 0x00049C, "Member 'URebootCardIndicator_C::EndTime' has a wrong offset!");
static_assert(offsetof(URebootCardIndicator_C, TimerHandle) == 0x0004A0, "Member 'URebootCardIndicator_C::TimerHandle' has a wrong offset!");

}

