#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SafeZoneIndicator

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function SafeZoneIndicator.SafeZoneIndicator_C.OnSafeZoneStateChangeDispatcher__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct SafeZoneIndicator_C_OnSafeZoneStateChangeDispatcher__DelegateSignature final
{
public:
	EFortSafeZoneState                            SafeZoneState;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SafeZoneIndicator_C_OnSafeZoneStateChangeDispatcher__DelegateSignature) == 0x000001, "Wrong alignment on SafeZoneIndicator_C_OnSafeZoneStateChangeDispatcher__DelegateSignature");
static_assert(sizeof(SafeZoneIndicator_C_OnSafeZoneStateChangeDispatcher__DelegateSignature) == 0x000001, "Wrong size on SafeZoneIndicator_C_OnSafeZoneStateChangeDispatcher__DelegateSignature");
static_assert(offsetof(SafeZoneIndicator_C_OnSafeZoneStateChangeDispatcher__DelegateSignature, SafeZoneState) == 0x000000, "Member 'SafeZoneIndicator_C_OnSafeZoneStateChangeDispatcher__DelegateSignature::SafeZoneState' has a wrong offset!");

// Function SafeZoneIndicator.SafeZoneIndicator_C.ExecuteUbergraph_SafeZoneIndicator
// 0x0060 (0x0060 - 0x0000)
struct SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	EFortSafeZoneState                            K2Node_Event_NewState;                             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInitial;                             // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27[0x1];                                       // 0x0027(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTimelineLength_ReturnValue;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_NewParam;                       // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAthena_GameState_C*                    CallFunc_GetAthenaGameState_AthenaGS;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeSinceSafeZonesStart_ReturnValue;   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetServerWorldTimeSeconds_ReturnValue;    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue;       // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0050(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator) == 0x000008, "Wrong alignment on SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator");
static_assert(sizeof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator) == 0x000060, "Wrong size on SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, EntryPoint) == 0x000000, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::EntryPoint' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, K2Node_MakeStruct_LinearColor) == 0x000004, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, K2Node_Event_NewState) == 0x000024, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::K2Node_Event_NewState' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, K2Node_Event_bInitial) == 0x000025, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::K2Node_Event_bInitial' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, K2Node_SwitchEnum_CmpSuccess) == 0x000026, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_GetTimelineLength_ReturnValue) == 0x000028, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_GetTimelineLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, K2Node_CustomEvent_NewParam) == 0x00002C, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::K2Node_CustomEvent_NewParam' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_GetAthenaGameState_AthenaGS) == 0x000030, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_GetAthenaGameState_AthenaGS' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_GetTimeSinceSafeZonesStart_ReturnValue) == 0x000038, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_GetTimeSinceSafeZonesStart_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_GetServerWorldTimeSeconds_ReturnValue) == 0x00003C, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_GetServerWorldTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000040, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_K2_IsTimerActiveHandle_ReturnValue) == 0x000041, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_K2_IsTimerActiveHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_Not_PreBool_ReturnValue) == 0x000042, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_Greater_IntInt_ReturnValue) == 0x000043, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000044, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000048, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00004C, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000050, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000058, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");

// Function SafeZoneIndicator.SafeZoneIndicator_C.stormy
// 0x0004 (0x0004 - 0x0000)
struct SafeZoneIndicator_C_Stormy final
{
public:
	float                                         NewParam;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SafeZoneIndicator_C_Stormy) == 0x000004, "Wrong alignment on SafeZoneIndicator_C_Stormy");
static_assert(sizeof(SafeZoneIndicator_C_Stormy) == 0x000004, "Wrong size on SafeZoneIndicator_C_Stormy");
static_assert(offsetof(SafeZoneIndicator_C_Stormy, NewParam) == 0x000000, "Member 'SafeZoneIndicator_C_Stormy::NewParam' has a wrong offset!");

// Function SafeZoneIndicator.SafeZoneIndicator_C.OnSafeZoneStateChange
// 0x0002 (0x0002 - 0x0000)
struct SafeZoneIndicator_C_OnSafeZoneStateChange final
{
public:
	EFortSafeZoneState                            NewState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInitial;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SafeZoneIndicator_C_OnSafeZoneStateChange) == 0x000001, "Wrong alignment on SafeZoneIndicator_C_OnSafeZoneStateChange");
static_assert(sizeof(SafeZoneIndicator_C_OnSafeZoneStateChange) == 0x000002, "Wrong size on SafeZoneIndicator_C_OnSafeZoneStateChange");
static_assert(offsetof(SafeZoneIndicator_C_OnSafeZoneStateChange, NewState) == 0x000000, "Member 'SafeZoneIndicator_C_OnSafeZoneStateChange::NewState' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_OnSafeZoneStateChange, bInitial) == 0x000001, "Member 'SafeZoneIndicator_C_OnSafeZoneStateChange::bInitial' has a wrong offset!");

// Function SafeZoneIndicator.SafeZoneIndicator_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct SafeZoneIndicator_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SafeZoneIndicator_C_UserConstructionScript) == 0x000008, "Wrong alignment on SafeZoneIndicator_C_UserConstructionScript");
static_assert(sizeof(SafeZoneIndicator_C_UserConstructionScript) == 0x000010, "Wrong size on SafeZoneIndicator_C_UserConstructionScript");
static_assert(offsetof(SafeZoneIndicator_C_UserConstructionScript, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'SafeZoneIndicator_C_UserConstructionScript::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'SafeZoneIndicator_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function SafeZoneIndicator.SafeZoneIndicator_C.InitClosestPointAudio
// 0x0018 (0x0018 - 0x0000)
struct SafeZoneIndicator_C_InitClosestPointAudio final
{
public:
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_1;         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_2;         // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SafeZoneIndicator_C_InitClosestPointAudio) == 0x000008, "Wrong alignment on SafeZoneIndicator_C_InitClosestPointAudio");
static_assert(sizeof(SafeZoneIndicator_C_InitClosestPointAudio) == 0x000018, "Wrong size on SafeZoneIndicator_C_InitClosestPointAudio");
static_assert(offsetof(SafeZoneIndicator_C_InitClosestPointAudio, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000000, "Member 'SafeZoneIndicator_C_InitClosestPointAudio::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_InitClosestPointAudio, CallFunc_SpawnSoundAttached_ReturnValue_1) == 0x000008, "Member 'SafeZoneIndicator_C_InitClosestPointAudio::CallFunc_SpawnSoundAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_InitClosestPointAudio, CallFunc_SpawnSoundAttached_ReturnValue_2) == 0x000010, "Member 'SafeZoneIndicator_C_InitClosestPointAudio::CallFunc_SpawnSoundAttached_ReturnValue_2' has a wrong offset!");

// Function SafeZoneIndicator.SafeZoneIndicator_C.GetAthenaGameState
// 0x0020 (0x0020 - 0x0000)
struct SafeZoneIndicator_C_GetAthenaGameState final
{
public:
	class AAthena_GameState_C*                    AthenaGS;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAthena_GameState_C*                    K2Node_DynamicCast_AsAthena_Game_State;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SafeZoneIndicator_C_GetAthenaGameState) == 0x000008, "Wrong alignment on SafeZoneIndicator_C_GetAthenaGameState");
static_assert(sizeof(SafeZoneIndicator_C_GetAthenaGameState) == 0x000020, "Wrong size on SafeZoneIndicator_C_GetAthenaGameState");
static_assert(offsetof(SafeZoneIndicator_C_GetAthenaGameState, AthenaGS) == 0x000000, "Member 'SafeZoneIndicator_C_GetAthenaGameState::AthenaGS' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_GetAthenaGameState, CallFunc_GetGameState_ReturnValue) == 0x000008, "Member 'SafeZoneIndicator_C_GetAthenaGameState::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_GetAthenaGameState, K2Node_DynamicCast_AsAthena_Game_State) == 0x000010, "Member 'SafeZoneIndicator_C_GetAthenaGameState::K2Node_DynamicCast_AsAthena_Game_State' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_GetAthenaGameState, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'SafeZoneIndicator_C_GetAthenaGameState::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

