#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ScreenCapture

#include "Basic.hpp"


namespace SDK::Params
{

// Function ScreenCapture.ScreenCaptureContext.CreateScreenCaptureContext
// 0x0010 (0x0010 - 0x0000)
struct ScreenCaptureContext_CreateScreenCaptureContext final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UScreenCaptureContext*                  ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScreenCaptureContext_CreateScreenCaptureContext) == 0x000008, "Wrong alignment on ScreenCaptureContext_CreateScreenCaptureContext");
static_assert(sizeof(ScreenCaptureContext_CreateScreenCaptureContext) == 0x000010, "Wrong size on ScreenCaptureContext_CreateScreenCaptureContext");
static_assert(offsetof(ScreenCaptureContext_CreateScreenCaptureContext, WorldContextObject) == 0x000000, "Member 'ScreenCaptureContext_CreateScreenCaptureContext::WorldContextObject' has a wrong offset!");
static_assert(offsetof(ScreenCaptureContext_CreateScreenCaptureContext, ReturnValue) == 0x000008, "Member 'ScreenCaptureContext_CreateScreenCaptureContext::ReturnValue' has a wrong offset!");

// Function ScreenCapture.ScreenCaptureContext.RemoveFile
// 0x0018 (0x0018 - 0x0000)
struct ScreenCaptureContext_RemoveFile final
{
public:
	class FString                                 LocalFilePath;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ScreenCaptureContext_RemoveFile) == 0x000008, "Wrong alignment on ScreenCaptureContext_RemoveFile");
static_assert(sizeof(ScreenCaptureContext_RemoveFile) == 0x000018, "Wrong size on ScreenCaptureContext_RemoveFile");
static_assert(offsetof(ScreenCaptureContext_RemoveFile, LocalFilePath) == 0x000000, "Member 'ScreenCaptureContext_RemoveFile::LocalFilePath' has a wrong offset!");
static_assert(offsetof(ScreenCaptureContext_RemoveFile, ReturnValue) == 0x000010, "Member 'ScreenCaptureContext_RemoveFile::ReturnValue' has a wrong offset!");

// Function ScreenCapture.ScreenCaptureContext.SaveToAlbum
// 0x0018 (0x0018 - 0x0000)
struct ScreenCaptureContext_SaveToAlbum final
{
public:
	class FString                                 LocalFilePath;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ScreenCaptureContext_SaveToAlbum) == 0x000008, "Wrong alignment on ScreenCaptureContext_SaveToAlbum");
static_assert(sizeof(ScreenCaptureContext_SaveToAlbum) == 0x000018, "Wrong size on ScreenCaptureContext_SaveToAlbum");
static_assert(offsetof(ScreenCaptureContext_SaveToAlbum, LocalFilePath) == 0x000000, "Member 'ScreenCaptureContext_SaveToAlbum::LocalFilePath' has a wrong offset!");
static_assert(offsetof(ScreenCaptureContext_SaveToAlbum, ReturnValue) == 0x000010, "Member 'ScreenCaptureContext_SaveToAlbum::ReturnValue' has a wrong offset!");

// Function ScreenCapture.ScreenCaptureContext.StartCapture
// 0x0002 (0x0002 - 0x0000)
struct ScreenCaptureContext_StartCapture final
{
public:
	bool                                          bInRecordAppAudio;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGeneratePreviewImage;                             // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScreenCaptureContext_StartCapture) == 0x000001, "Wrong alignment on ScreenCaptureContext_StartCapture");
static_assert(sizeof(ScreenCaptureContext_StartCapture) == 0x000002, "Wrong size on ScreenCaptureContext_StartCapture");
static_assert(offsetof(ScreenCaptureContext_StartCapture, bInRecordAppAudio) == 0x000000, "Member 'ScreenCaptureContext_StartCapture::bInRecordAppAudio' has a wrong offset!");
static_assert(offsetof(ScreenCaptureContext_StartCapture, bGeneratePreviewImage) == 0x000001, "Member 'ScreenCaptureContext_StartCapture::bGeneratePreviewImage' has a wrong offset!");

// Function ScreenCapture.ScreenCaptureContext.StopCapture
// 0x0001 (0x0001 - 0x0000)
struct ScreenCaptureContext_StopCapture final
{
public:
	bool                                          bIsCaptureInterrupted;                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScreenCaptureContext_StopCapture) == 0x000001, "Wrong alignment on ScreenCaptureContext_StopCapture");
static_assert(sizeof(ScreenCaptureContext_StopCapture) == 0x000001, "Wrong size on ScreenCaptureContext_StopCapture");
static_assert(offsetof(ScreenCaptureContext_StopCapture, bIsCaptureInterrupted) == 0x000000, "Member 'ScreenCaptureContext_StopCapture::bIsCaptureInterrupted' has a wrong offset!");

// Function ScreenCapture.ScreenCaptureContext.ToggleMicrophoneRecording
// 0x0001 (0x0001 - 0x0000)
struct ScreenCaptureContext_ToggleMicrophoneRecording final
{
public:
	bool                                          bEnableMicrophone;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScreenCaptureContext_ToggleMicrophoneRecording) == 0x000001, "Wrong alignment on ScreenCaptureContext_ToggleMicrophoneRecording");
static_assert(sizeof(ScreenCaptureContext_ToggleMicrophoneRecording) == 0x000001, "Wrong size on ScreenCaptureContext_ToggleMicrophoneRecording");
static_assert(offsetof(ScreenCaptureContext_ToggleMicrophoneRecording, bEnableMicrophone) == 0x000000, "Member 'ScreenCaptureContext_ToggleMicrophoneRecording::bEnableMicrophone' has a wrong offset!");

// Function ScreenCapture.ScreenCaptureContext.IsRecording
// 0x0001 (0x0001 - 0x0000)
struct ScreenCaptureContext_IsRecording final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScreenCaptureContext_IsRecording) == 0x000001, "Wrong alignment on ScreenCaptureContext_IsRecording");
static_assert(sizeof(ScreenCaptureContext_IsRecording) == 0x000001, "Wrong size on ScreenCaptureContext_IsRecording");
static_assert(offsetof(ScreenCaptureContext_IsRecording, ReturnValue) == 0x000000, "Member 'ScreenCaptureContext_IsRecording::ReturnValue' has a wrong offset!");

}

