#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ScreenCapture

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class ScreenCapture.ScreenCaptureContext
// 0x00A8 (0x00D0 - 0x0028)
class UScreenCaptureContext final : public UObject
{
public:
	UMulticastInlineDelegateProperty_             OnCaptureFinishedDelegate;                         // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_             OnCaptureInterruptedDelegate;                      // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_             OnVideoSavedToAlbumDelegate;                       // 0x0048(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_             OnScreenshotCapturedDelegate;                      // 0x0058(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_68[0x58];                                      // 0x0068(0x0058)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             PreviewImage;                                      // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UScreenCaptureContext* CreateScreenCaptureContext(class UObject* WorldContextObject);

	bool RemoveFile(const class FString& LocalFilePath);
	bool SaveToAlbum(const class FString& LocalFilePath);
	void StartCapture(bool bInRecordAppAudio, bool bGeneratePreviewImage);
	void StopCapture(bool bIsCaptureInterrupted);
	void TakeScreenshot();
	void ToggleMicrophoneRecording(bool bEnableMicrophone);

	bool IsRecording() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ScreenCaptureContext">();
	}
	static class UScreenCaptureContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScreenCaptureContext>();
	}
};
static_assert(alignof(UScreenCaptureContext) == 0x000008, "Wrong alignment on UScreenCaptureContext");
static_assert(sizeof(UScreenCaptureContext) == 0x0000D0, "Wrong size on UScreenCaptureContext");
static_assert(offsetof(UScreenCaptureContext, OnCaptureFinishedDelegate) == 0x000028, "Member 'UScreenCaptureContext::OnCaptureFinishedDelegate' has a wrong offset!");
static_assert(offsetof(UScreenCaptureContext, OnCaptureInterruptedDelegate) == 0x000038, "Member 'UScreenCaptureContext::OnCaptureInterruptedDelegate' has a wrong offset!");
static_assert(offsetof(UScreenCaptureContext, OnVideoSavedToAlbumDelegate) == 0x000048, "Member 'UScreenCaptureContext::OnVideoSavedToAlbumDelegate' has a wrong offset!");
static_assert(offsetof(UScreenCaptureContext, OnScreenshotCapturedDelegate) == 0x000058, "Member 'UScreenCaptureContext::OnScreenshotCapturedDelegate' has a wrong offset!");
static_assert(offsetof(UScreenCaptureContext, PreviewImage) == 0x0000C0, "Member 'UScreenCaptureContext::PreviewImage' has a wrong offset!");

}

