#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidecarSys

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct SidecarSys.SidecarFileInfo
// 0x0068 (0x0068 - 0x0000)
struct FSidecarFileInfo final
{
public:
	TMap<class FString, class FString>            Meta;                                              // 0x0000(0x0050)(ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bIsCheckedOut;                                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOperationPending;                                 // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CheckoutGuid;                                      // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSidecarFileInfo) == 0x000008, "Wrong alignment on FSidecarFileInfo");
static_assert(sizeof(FSidecarFileInfo) == 0x000068, "Wrong size on FSidecarFileInfo");
static_assert(offsetof(FSidecarFileInfo, Meta) == 0x000000, "Member 'FSidecarFileInfo::Meta' has a wrong offset!");
static_assert(offsetof(FSidecarFileInfo, bIsCheckedOut) == 0x000050, "Member 'FSidecarFileInfo::bIsCheckedOut' has a wrong offset!");
static_assert(offsetof(FSidecarFileInfo, bOperationPending) == 0x000051, "Member 'FSidecarFileInfo::bOperationPending' has a wrong offset!");
static_assert(offsetof(FSidecarFileInfo, CheckoutGuid) == 0x000058, "Member 'FSidecarFileInfo::CheckoutGuid' has a wrong offset!");

}

