#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialUMG

#include "Basic.hpp"

#include "CommonUI_classes.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"
#include "Party_classes.hpp"
#include "SocialUMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class SocialUMG.SocialChatChannelTab
// 0x0010 (0x0B50 - 0x0B40)
class USocialChatChannelTab final : public UCommonButton
{
public:
	class USocialChatChannel*                     ChatChannel;                                       // 0x0B40(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       CommonText_ChannelName;                            // 0x0B48(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialChatChannelTab">();
	}
	static class USocialChatChannelTab* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialChatChannelTab>();
	}
};
static_assert(alignof(USocialChatChannelTab) == 0x000008, "Wrong alignment on USocialChatChannelTab");
static_assert(sizeof(USocialChatChannelTab) == 0x000B50, "Wrong size on USocialChatChannelTab");
static_assert(offsetof(USocialChatChannelTab, ChatChannel) == 0x000B40, "Member 'USocialChatChannelTab::ChatChannel' has a wrong offset!");
static_assert(offsetof(USocialChatChannelTab, CommonText_ChannelName) == 0x000B48, "Member 'USocialChatChannelTab::CommonText_ChannelName' has a wrong offset!");

// Class SocialUMG.SocialChatContainer
// 0x0058 (0x0280 - 0x0228)
class USocialChatContainer : public UUserWidget
{
public:
	class USocialChatManager*                     ChatManager;                                       // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class USocialChatChannel*>             JoinedChannels;                                    // 0x0230(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	class USocialChatChannel*                     ActiveChannel;                                     // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonGroup*                     TabButtonGroup;                                    // 0x0248(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_250[0x8];                                      // 0x0250(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class USocialChatMessageList*                 ChatList_Messages;                                 // 0x0258(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USocialChatEditableText*                ChatEditableText_MessageEntry;                     // 0x0260(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButton*                          Button_SendMessage;                                // 0x0268(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                       EntryBox_JoinedChannels;                           // 0x0270(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UScrollBox*                             ScrollBox_Channels;                                // 0x0278(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void DynamicHandleMessageTextCommitted(const class FText& MessageText, ETextCommit CommitMethod);
	void FocusEditableText();
	void HandleLeftTabPressed();
	void HandleRightTabPressed();
	void OnChatOpenChanged(bool bShouldBeOpen);
	void SendCurrentMessage();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialChatContainer">();
	}
	static class USocialChatContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialChatContainer>();
	}
};
static_assert(alignof(USocialChatContainer) == 0x000008, "Wrong alignment on USocialChatContainer");
static_assert(sizeof(USocialChatContainer) == 0x000280, "Wrong size on USocialChatContainer");
static_assert(offsetof(USocialChatContainer, ChatManager) == 0x000228, "Member 'USocialChatContainer::ChatManager' has a wrong offset!");
static_assert(offsetof(USocialChatContainer, JoinedChannels) == 0x000230, "Member 'USocialChatContainer::JoinedChannels' has a wrong offset!");
static_assert(offsetof(USocialChatContainer, ActiveChannel) == 0x000240, "Member 'USocialChatContainer::ActiveChannel' has a wrong offset!");
static_assert(offsetof(USocialChatContainer, TabButtonGroup) == 0x000248, "Member 'USocialChatContainer::TabButtonGroup' has a wrong offset!");
static_assert(offsetof(USocialChatContainer, ChatList_Messages) == 0x000258, "Member 'USocialChatContainer::ChatList_Messages' has a wrong offset!");
static_assert(offsetof(USocialChatContainer, ChatEditableText_MessageEntry) == 0x000260, "Member 'USocialChatContainer::ChatEditableText_MessageEntry' has a wrong offset!");
static_assert(offsetof(USocialChatContainer, Button_SendMessage) == 0x000268, "Member 'USocialChatContainer::Button_SendMessage' has a wrong offset!");
static_assert(offsetof(USocialChatContainer, EntryBox_JoinedChannels) == 0x000270, "Member 'USocialChatContainer::EntryBox_JoinedChannels' has a wrong offset!");
static_assert(offsetof(USocialChatContainer, ScrollBox_Channels) == 0x000278, "Member 'USocialChatContainer::ScrollBox_Channels' has a wrong offset!");

// Class SocialUMG.SocialChatEditableText
// 0x04E0 (0x05E0 - 0x0100)
class USocialChatEditableText final : public UWidget
{
public:
	uint8                                         Pad_100[0x20];                                     // 0x0100(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEditableTextStyle                     EditableTextStyle;                                 // 0x0120(0x0218)(Edit, NativeAccessSpecifierPrivate)
	struct FTextBlockStyle                        AutoCompleteStyle;                                 // 0x0338(0x0268)(Edit, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5A0[0x40];                                     // 0x05A0(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialChatEditableText">();
	}
	static class USocialChatEditableText* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialChatEditableText>();
	}
};
static_assert(alignof(USocialChatEditableText) == 0x000008, "Wrong alignment on USocialChatEditableText");
static_assert(sizeof(USocialChatEditableText) == 0x0005E0, "Wrong size on USocialChatEditableText");
static_assert(offsetof(USocialChatEditableText, EditableTextStyle) == 0x000120, "Member 'USocialChatEditableText::EditableTextStyle' has a wrong offset!");
static_assert(offsetof(USocialChatEditableText, AutoCompleteStyle) == 0x000338, "Member 'USocialChatEditableText::AutoCompleteStyle' has a wrong offset!");

// Class SocialUMG.SocialChatMessageEntry
// 0x0148 (0x0370 - 0x0228)
class USocialChatMessageEntry : public UUserWidget
{
public:
	uint8                                         Pad_228[0x18];                                     // 0x0228(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSocialChatMessageEntryStyle           DefaultStyle;                                      // 0x0240(0x0120)(Edit, Protected, NativeAccessSpecifierProtected)
	class UCommonRichTextBlock*                   RichText_Message;                                  // 0x0360(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UButton*                                Button_MessageButton;                              // 0x0368(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnMessageSet();

	bool CanInteract() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialChatMessageEntry">();
	}
	static class USocialChatMessageEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialChatMessageEntry>();
	}
};
static_assert(alignof(USocialChatMessageEntry) == 0x000008, "Wrong alignment on USocialChatMessageEntry");
static_assert(sizeof(USocialChatMessageEntry) == 0x000370, "Wrong size on USocialChatMessageEntry");
static_assert(offsetof(USocialChatMessageEntry, DefaultStyle) == 0x000240, "Member 'USocialChatMessageEntry::DefaultStyle' has a wrong offset!");
static_assert(offsetof(USocialChatMessageEntry, RichText_Message) == 0x000360, "Member 'USocialChatMessageEntry::RichText_Message' has a wrong offset!");
static_assert(offsetof(USocialChatMessageEntry, Button_MessageButton) == 0x000368, "Member 'USocialChatMessageEntry::Button_MessageButton' has a wrong offset!");

// Class SocialUMG.SocialChatMessageList
// 0x00F0 (0x02F0 - 0x0200)
class USocialChatMessageList final : public UListViewBase
{
public:
	uint8                                         Pad_200[0xC0];                                     // 0x0200(0x00C0)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsFocusable;                                      // 0x02C0(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USocialChatChannel*                     ActiveChannel;                                     // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2D0[0x20];                                     // 0x02D0(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialChatMessageList">();
	}
	static class USocialChatMessageList* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialChatMessageList>();
	}
};
static_assert(alignof(USocialChatMessageList) == 0x000008, "Wrong alignment on USocialChatMessageList");
static_assert(sizeof(USocialChatMessageList) == 0x0002F0, "Wrong size on USocialChatMessageList");
static_assert(offsetof(USocialChatMessageList, bIsFocusable) == 0x0002C0, "Member 'USocialChatMessageList::bIsFocusable' has a wrong offset!");
static_assert(offsetof(USocialChatMessageList, ActiveChannel) == 0x0002C8, "Member 'USocialChatMessageList::ActiveChannel' has a wrong offset!");

// Class SocialUMG.SocialGroupListEntry
// 0x0028 (0x0B68 - 0x0B40)
class USocialGroupListEntry final : public UCommonButton
{
public:
	uint8                                         Pad_B40[0x8];                                      // 0x0B40(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class USocialInteractionMenu>     ActionMenuClass;                                   // 0x0B48(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USocialGroupChannel*                    SocialGroup;                                       // 0x0B50(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             Text_GroupName;                                    // 0x0B58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMenuAnchor*                            MenuAnchor_Actions;                                // 0x0B60(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	class UWidget* HandleGetMenuContent();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialGroupListEntry">();
	}
	static class USocialGroupListEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialGroupListEntry>();
	}
};
static_assert(alignof(USocialGroupListEntry) == 0x000008, "Wrong alignment on USocialGroupListEntry");
static_assert(sizeof(USocialGroupListEntry) == 0x000B68, "Wrong size on USocialGroupListEntry");
static_assert(offsetof(USocialGroupListEntry, ActionMenuClass) == 0x000B48, "Member 'USocialGroupListEntry::ActionMenuClass' has a wrong offset!");
static_assert(offsetof(USocialGroupListEntry, SocialGroup) == 0x000B50, "Member 'USocialGroupListEntry::SocialGroup' has a wrong offset!");
static_assert(offsetof(USocialGroupListEntry, Text_GroupName) == 0x000B58, "Member 'USocialGroupListEntry::Text_GroupName' has a wrong offset!");
static_assert(offsetof(USocialGroupListEntry, MenuAnchor_Actions) == 0x000B60, "Member 'USocialGroupListEntry::MenuAnchor_Actions' has a wrong offset!");

// Class SocialUMG.SocialGroupTreeView
// 0x0020 (0x03C8 - 0x03A8)
class USocialGroupTreeView final : public UTreeView
{
public:
	TSubclassOf<class USocialGroupListEntry>      GroupEntryWidgetClass;                             // 0x03A8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class USocialUserListEntry>       UserEntryWidgetClass;                              // 0x03B0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class USocialInteractionMenu>     ActionMenuClass;                                   // 0x03B8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USocialInteractionMenu*                 ActionMenu;                                        // 0x03C0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialGroupTreeView">();
	}
	static class USocialGroupTreeView* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialGroupTreeView>();
	}
};
static_assert(alignof(USocialGroupTreeView) == 0x000008, "Wrong alignment on USocialGroupTreeView");
static_assert(sizeof(USocialGroupTreeView) == 0x0003C8, "Wrong size on USocialGroupTreeView");
static_assert(offsetof(USocialGroupTreeView, GroupEntryWidgetClass) == 0x0003A8, "Member 'USocialGroupTreeView::GroupEntryWidgetClass' has a wrong offset!");
static_assert(offsetof(USocialGroupTreeView, UserEntryWidgetClass) == 0x0003B0, "Member 'USocialGroupTreeView::UserEntryWidgetClass' has a wrong offset!");
static_assert(offsetof(USocialGroupTreeView, ActionMenuClass) == 0x0003B8, "Member 'USocialGroupTreeView::ActionMenuClass' has a wrong offset!");
static_assert(offsetof(USocialGroupTreeView, ActionMenu) == 0x0003C0, "Member 'USocialGroupTreeView::ActionMenu' has a wrong offset!");

// Class SocialUMG.SocialInteractionButton
// 0x0060 (0x0BA0 - 0x0B40)
class USocialInteractionButton : public UCommonButton
{
public:
	struct FLinearColor                           DefaultIndicatorColor;                             // 0x0B40(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                           AlertingIndicatorColor;                            // 0x0B50(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B60[0x30];                                     // 0x0B60(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       Text_InteractionName;                              // 0x0B90(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBorder*                                Border_InteractionIndicator;                       // 0x0B98(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnInteractionSet();

	class FName GetInteractionName() const;
	bool IsPlatformOnlyFriend() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialInteractionButton">();
	}
	static class USocialInteractionButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialInteractionButton>();
	}
};
static_assert(alignof(USocialInteractionButton) == 0x000008, "Wrong alignment on USocialInteractionButton");
static_assert(sizeof(USocialInteractionButton) == 0x000BA0, "Wrong size on USocialInteractionButton");
static_assert(offsetof(USocialInteractionButton, DefaultIndicatorColor) == 0x000B40, "Member 'USocialInteractionButton::DefaultIndicatorColor' has a wrong offset!");
static_assert(offsetof(USocialInteractionButton, AlertingIndicatorColor) == 0x000B50, "Member 'USocialInteractionButton::AlertingIndicatorColor' has a wrong offset!");
static_assert(offsetof(USocialInteractionButton, Text_InteractionName) == 0x000B90, "Member 'USocialInteractionButton::Text_InteractionName' has a wrong offset!");
static_assert(offsetof(USocialInteractionButton, Border_InteractionIndicator) == 0x000B98, "Member 'USocialInteractionButton::Border_InteractionIndicator' has a wrong offset!");

// Class SocialUMG.SocialInteractionMenu
// 0x0080 (0x02A8 - 0x0228)
class USocialInteractionMenu : public UUserWidget
{
public:
	class UObject*                                SocialContext;                                     // 0x0228(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_230[0x40];                                     // 0x0230(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	class UDynamicEntryBox*                       EntryBox_PositiveInteractions;                     // 0x0270(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                       EntryBox_NegativeInteractions;                     // 0x0278(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USpacer*                                Spacer_InteractionSeparator;                       // 0x0280(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonWidgetSwitcher*                  Switcher_Confirmation;                             // 0x0288(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextBlock*                             Text_ConfirmationLabel;                            // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                          Button_Confirm;                                    // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                          Button_Decline;                                    // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnSocialContextSet();
	void OnToggleConfirmation(bool bIsVisible);

	class UWidget* GetFirstEntryToCenter() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialInteractionMenu">();
	}
	static class USocialInteractionMenu* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialInteractionMenu>();
	}
};
static_assert(alignof(USocialInteractionMenu) == 0x000008, "Wrong alignment on USocialInteractionMenu");
static_assert(sizeof(USocialInteractionMenu) == 0x0002A8, "Wrong size on USocialInteractionMenu");
static_assert(offsetof(USocialInteractionMenu, SocialContext) == 0x000228, "Member 'USocialInteractionMenu::SocialContext' has a wrong offset!");
static_assert(offsetof(USocialInteractionMenu, EntryBox_PositiveInteractions) == 0x000270, "Member 'USocialInteractionMenu::EntryBox_PositiveInteractions' has a wrong offset!");
static_assert(offsetof(USocialInteractionMenu, EntryBox_NegativeInteractions) == 0x000278, "Member 'USocialInteractionMenu::EntryBox_NegativeInteractions' has a wrong offset!");
static_assert(offsetof(USocialInteractionMenu, Spacer_InteractionSeparator) == 0x000280, "Member 'USocialInteractionMenu::Spacer_InteractionSeparator' has a wrong offset!");
static_assert(offsetof(USocialInteractionMenu, Switcher_Confirmation) == 0x000288, "Member 'USocialInteractionMenu::Switcher_Confirmation' has a wrong offset!");
static_assert(offsetof(USocialInteractionMenu, Text_ConfirmationLabel) == 0x000290, "Member 'USocialInteractionMenu::Text_ConfirmationLabel' has a wrong offset!");
static_assert(offsetof(USocialInteractionMenu, Button_Confirm) == 0x000298, "Member 'USocialInteractionMenu::Button_Confirm' has a wrong offset!");
static_assert(offsetof(USocialInteractionMenu, Button_Decline) == 0x0002A0, "Member 'USocialInteractionMenu::Button_Decline' has a wrong offset!");

// Class SocialUMG.DesignerPreviewChatChannel
// 0x0068 (0x0150 - 0x00E8)
class UDesignerPreviewChatChannel final : public USocialChatChannel
{
public:
	uint8                                         Pad_E8[0x68];                                      // 0x00E8(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DesignerPreviewChatChannel">();
	}
	static class UDesignerPreviewChatChannel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDesignerPreviewChatChannel>();
	}
};
static_assert(alignof(UDesignerPreviewChatChannel) == 0x000008, "Wrong alignment on UDesignerPreviewChatChannel");
static_assert(sizeof(UDesignerPreviewChatChannel) == 0x000150, "Wrong size on UDesignerPreviewChatChannel");

// Class SocialUMG.SocialListEntry
// 0x0028 (0x0B68 - 0x0B40)
class USocialListEntry : public UCommonButton
{
public:
	uint8                                         Pad_B40[0x8];                                      // 0x0B40(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class USocialInteractionMenu>     ActionMenuClass;                                   // 0x0B48(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonRichTextBlock*                   Text_DisplayName;                                  // 0x0B50(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonRichTextBlock*                   Text_RichPresence;                                 // 0x0B58(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMenuAnchor*                            MenuAnchor_Actions;                                // 0x0B60(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	class UWidget* HandleGetMenuContent();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialListEntry">();
	}
	static class USocialListEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialListEntry>();
	}
};
static_assert(alignof(USocialListEntry) == 0x000008, "Wrong alignment on USocialListEntry");
static_assert(sizeof(USocialListEntry) == 0x000B68, "Wrong size on USocialListEntry");
static_assert(offsetof(USocialListEntry, ActionMenuClass) == 0x000B48, "Member 'USocialListEntry::ActionMenuClass' has a wrong offset!");
static_assert(offsetof(USocialListEntry, Text_DisplayName) == 0x000B50, "Member 'USocialListEntry::Text_DisplayName' has a wrong offset!");
static_assert(offsetof(USocialListEntry, Text_RichPresence) == 0x000B58, "Member 'USocialListEntry::Text_RichPresence' has a wrong offset!");
static_assert(offsetof(USocialListEntry, MenuAnchor_Actions) == 0x000B60, "Member 'USocialListEntry::MenuAnchor_Actions' has a wrong offset!");

// Class SocialUMG.SocialUserListEntry
// 0x0008 (0x0B70 - 0x0B68)
class USocialUserListEntry : public USocialListEntry
{
public:
	class USocialUser*                            SocialUser;                                        // 0x0B68(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnUserPresenceChanged(EOnlineStatus OnlineStatus);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialUserListEntry">();
	}
	static class USocialUserListEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialUserListEntry>();
	}
};
static_assert(alignof(USocialUserListEntry) == 0x000008, "Wrong alignment on USocialUserListEntry");
static_assert(sizeof(USocialUserListEntry) == 0x000B70, "Wrong size on USocialUserListEntry");
static_assert(offsetof(USocialUserListEntry, SocialUser) == 0x000B68, "Member 'USocialUserListEntry::SocialUser' has a wrong offset!");

// Class SocialUMG.SocialInviteListEntry
// 0x0008 (0x0B70 - 0x0B68)
class USocialInviteListEntry : public USocialListEntry
{
public:
	class USocialFriendInvite*                    SocialInvite;                                      // 0x0B68(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialInviteListEntry">();
	}
	static class USocialInviteListEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialInviteListEntry>();
	}
};
static_assert(alignof(USocialInviteListEntry) == 0x000008, "Wrong alignment on USocialInviteListEntry");
static_assert(sizeof(USocialInviteListEntry) == 0x000B70, "Wrong size on USocialInviteListEntry");
static_assert(offsetof(USocialInviteListEntry, SocialInvite) == 0x000B68, "Member 'USocialInviteListEntry::SocialInvite' has a wrong offset!");

// Class SocialUMG.SocialActionItem
// 0x0008 (0x0030 - 0x0028)
class USocialActionItem : public UObject
{
public:
	class USocialUser*                            CurrentUser;                                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialActionItem">();
	}
	static class USocialActionItem* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialActionItem>();
	}
};
static_assert(alignof(USocialActionItem) == 0x000008, "Wrong alignment on USocialActionItem");
static_assert(sizeof(USocialActionItem) == 0x000030, "Wrong size on USocialActionItem");
static_assert(offsetof(USocialActionItem, CurrentUser) == 0x000028, "Member 'USocialActionItem::CurrentUser' has a wrong offset!");

// Class SocialUMG.SocialFriendInvite
// 0x0000 (0x0030 - 0x0030)
class USocialFriendInvite final : public USocialActionItem
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialFriendInvite">();
	}
	static class USocialFriendInvite* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialFriendInvite>();
	}
};
static_assert(alignof(USocialFriendInvite) == 0x000008, "Wrong alignment on USocialFriendInvite");
static_assert(sizeof(USocialFriendInvite) == 0x000030, "Wrong size on USocialFriendInvite");

// Class SocialUMG.SocialPartyInvite
// 0x0000 (0x0030 - 0x0030)
class USocialPartyInvite final : public USocialActionItem
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialPartyInvite">();
	}
	static class USocialPartyInvite* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialPartyInvite>();
	}
};
static_assert(alignof(USocialPartyInvite) == 0x000008, "Wrong alignment on USocialPartyInvite");
static_assert(sizeof(USocialPartyInvite) == 0x000030, "Wrong size on USocialPartyInvite");

// Class SocialUMG.SocialUserListHeader
// 0x0040 (0x0068 - 0x0028)
class USocialUserListHeader : public UObject
{
public:
	uint8                                         Pad_28[0x40];                                      // 0x0028(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialUserListHeader">();
	}
	static class USocialUserListHeader* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialUserListHeader>();
	}
};
static_assert(alignof(USocialUserListHeader) == 0x000008, "Wrong alignment on USocialUserListHeader");
static_assert(sizeof(USocialUserListHeader) == 0x000068, "Wrong size on USocialUserListHeader");

// Class SocialUMG.SocialFriendInviteListHeader
// 0x0010 (0x0078 - 0x0068)
class USocialFriendInviteListHeader final : public USocialUserListHeader
{
public:
	TArray<class USocialFriendInvite*>            FriendInvites;                                     // 0x0068(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialFriendInviteListHeader">();
	}
	static class USocialFriendInviteListHeader* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialFriendInviteListHeader>();
	}
};
static_assert(alignof(USocialFriendInviteListHeader) == 0x000008, "Wrong alignment on USocialFriendInviteListHeader");
static_assert(sizeof(USocialFriendInviteListHeader) == 0x000078, "Wrong size on USocialFriendInviteListHeader");
static_assert(offsetof(USocialFriendInviteListHeader, FriendInvites) == 0x000068, "Member 'USocialFriendInviteListHeader::FriendInvites' has a wrong offset!");

// Class SocialUMG.SocialPartyInviteListHeader
// 0x0010 (0x0078 - 0x0068)
class USocialPartyInviteListHeader final : public USocialUserListHeader
{
public:
	TArray<class USocialPartyInvite*>             PartyInvites;                                      // 0x0068(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialPartyInviteListHeader">();
	}
	static class USocialPartyInviteListHeader* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialPartyInviteListHeader>();
	}
};
static_assert(alignof(USocialPartyInviteListHeader) == 0x000008, "Wrong alignment on USocialPartyInviteListHeader");
static_assert(sizeof(USocialPartyInviteListHeader) == 0x000078, "Wrong size on USocialPartyInviteListHeader");
static_assert(offsetof(USocialPartyInviteListHeader, PartyInvites) == 0x000068, "Member 'USocialPartyInviteListHeader::PartyInvites' has a wrong offset!");

// Class SocialUMG.SocialUserListHeaderEntry
// 0x0020 (0x0B60 - 0x0B40)
class USocialUserListHeaderEntry : public UCommonButton
{
public:
	uint8                                         Pad_B40[0x8];                                      // 0x0B40(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class USocialUserListHeader*                  ListHeader;                                        // 0x0B48(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             Text_ListName;                                     // 0x0B50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextBlock*                             Text_NumEntries;                                   // 0x0B58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialUserListHeaderEntry">();
	}
	static class USocialUserListHeaderEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialUserListHeaderEntry>();
	}
};
static_assert(alignof(USocialUserListHeaderEntry) == 0x000008, "Wrong alignment on USocialUserListHeaderEntry");
static_assert(sizeof(USocialUserListHeaderEntry) == 0x000B60, "Wrong size on USocialUserListHeaderEntry");
static_assert(offsetof(USocialUserListHeaderEntry, ListHeader) == 0x000B48, "Member 'USocialUserListHeaderEntry::ListHeader' has a wrong offset!");
static_assert(offsetof(USocialUserListHeaderEntry, Text_ListName) == 0x000B50, "Member 'USocialUserListHeaderEntry::Text_ListName' has a wrong offset!");
static_assert(offsetof(USocialUserListHeaderEntry, Text_NumEntries) == 0x000B58, "Member 'USocialUserListHeaderEntry::Text_NumEntries' has a wrong offset!");

// Class SocialUMG.SocialUserTreeView
// 0x0090 (0x0438 - 0x03A8)
class USocialUserTreeView : public UTreeView
{
public:
	TSubclassOf<class USocialUserListEntry>       UserEntryWidgetClass;                              // 0x03A8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class USocialInviteListEntry>     InviteEntryWidgetClass;                            // 0x03B0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USocialInteractionMenu*                 ActiveActionMenu;                                  // 0x03B8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class USocialUserListHeader*>          ListHeaders;                                       // 0x03C0(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TMap<TSubclassOf<class USocialInteractionMenu>, class USocialInteractionMenu*> CachedActionMenuPool;                              // 0x03D0(0x0050)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_420[0x18];                                     // 0x0420(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialUserTreeView">();
	}
	static class USocialUserTreeView* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialUserTreeView>();
	}
};
static_assert(alignof(USocialUserTreeView) == 0x000008, "Wrong alignment on USocialUserTreeView");
static_assert(sizeof(USocialUserTreeView) == 0x000438, "Wrong size on USocialUserTreeView");
static_assert(offsetof(USocialUserTreeView, UserEntryWidgetClass) == 0x0003A8, "Member 'USocialUserTreeView::UserEntryWidgetClass' has a wrong offset!");
static_assert(offsetof(USocialUserTreeView, InviteEntryWidgetClass) == 0x0003B0, "Member 'USocialUserTreeView::InviteEntryWidgetClass' has a wrong offset!");
static_assert(offsetof(USocialUserTreeView, ActiveActionMenu) == 0x0003B8, "Member 'USocialUserTreeView::ActiveActionMenu' has a wrong offset!");
