#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialInteraction

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function SocialInteraction.SocialInteraction_C.ExecuteUbergraph_SocialInteraction
// 0x0028 (0x0028 - 0x0000)
struct SocialInteraction_C_ExecuteUbergraph_SocialInteraction final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlatformOnlyFriend_ReturnValue;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetInteractionName_ReturnValue;           // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SocialInteraction_C_ExecuteUbergraph_SocialInteraction) == 0x000008, "Wrong alignment on SocialInteraction_C_ExecuteUbergraph_SocialInteraction");
static_assert(sizeof(SocialInteraction_C_ExecuteUbergraph_SocialInteraction) == 0x000028, "Wrong size on SocialInteraction_C_ExecuteUbergraph_SocialInteraction");
static_assert(offsetof(SocialInteraction_C_ExecuteUbergraph_SocialInteraction, EntryPoint) == 0x000000, "Member 'SocialInteraction_C_ExecuteUbergraph_SocialInteraction::EntryPoint' has a wrong offset!");
static_assert(offsetof(SocialInteraction_C_ExecuteUbergraph_SocialInteraction, Temp_bool_Variable) == 0x000004, "Member 'SocialInteraction_C_ExecuteUbergraph_SocialInteraction::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SocialInteraction_C_ExecuteUbergraph_SocialInteraction, Temp_byte_Variable) == 0x000005, "Member 'SocialInteraction_C_ExecuteUbergraph_SocialInteraction::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SocialInteraction_C_ExecuteUbergraph_SocialInteraction, Temp_byte_Variable_1) == 0x000006, "Member 'SocialInteraction_C_ExecuteUbergraph_SocialInteraction::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(SocialInteraction_C_ExecuteUbergraph_SocialInteraction, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'SocialInteraction_C_ExecuteUbergraph_SocialInteraction::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialInteraction_C_ExecuteUbergraph_SocialInteraction, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'SocialInteraction_C_ExecuteUbergraph_SocialInteraction::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SocialInteraction_C_ExecuteUbergraph_SocialInteraction, CallFunc_IsPlatformOnlyFriend_ReturnValue) == 0x000018, "Member 'SocialInteraction_C_ExecuteUbergraph_SocialInteraction::CallFunc_IsPlatformOnlyFriend_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialInteraction_C_ExecuteUbergraph_SocialInteraction, CallFunc_GetInteractionName_ReturnValue) == 0x00001C, "Member 'SocialInteraction_C_ExecuteUbergraph_SocialInteraction::CallFunc_GetInteractionName_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialInteraction_C_ExecuteUbergraph_SocialInteraction, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000024, "Member 'SocialInteraction_C_ExecuteUbergraph_SocialInteraction::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialInteraction_C_ExecuteUbergraph_SocialInteraction, K2Node_Select_Default) == 0x000025, "Member 'SocialInteraction_C_ExecuteUbergraph_SocialInteraction::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SocialInteraction_C_ExecuteUbergraph_SocialInteraction, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x000026, "Member 'SocialInteraction_C_ExecuteUbergraph_SocialInteraction::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SocialInteraction_C_ExecuteUbergraph_SocialInteraction, CallFunc_BooleanOR_ReturnValue) == 0x000027, "Member 'SocialInteraction_C_ExecuteUbergraph_SocialInteraction::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

