#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialPanel_FriendLinkButton

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function SocialPanel_FriendLinkButton.SocialPanel_FriendLinkButton_C.ExecuteUbergraph_SocialPanel_FriendLinkButton
// 0x0048 (0x0048 - 0x0000)
struct SocialPanel_FriendLinkButton_C_ExecuteUbergraph_SocialPanel_FriendLinkButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFriendLinkShareButtonType                    Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_2;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFriendLinkShareButtonType                    K2Node_Event_Type;                                 // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialPanel_FriendLinkButton_C_ExecuteUbergraph_SocialPanel_FriendLinkButton) == 0x000008, "Wrong alignment on SocialPanel_FriendLinkButton_C_ExecuteUbergraph_SocialPanel_FriendLinkButton");
static_assert(sizeof(SocialPanel_FriendLinkButton_C_ExecuteUbergraph_SocialPanel_FriendLinkButton) == 0x000048, "Wrong size on SocialPanel_FriendLinkButton_C_ExecuteUbergraph_SocialPanel_FriendLinkButton");
static_assert(offsetof(SocialPanel_FriendLinkButton_C_ExecuteUbergraph_SocialPanel_FriendLinkButton, EntryPoint) == 0x000000, "Member 'SocialPanel_FriendLinkButton_C_ExecuteUbergraph_SocialPanel_FriendLinkButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(SocialPanel_FriendLinkButton_C_ExecuteUbergraph_SocialPanel_FriendLinkButton, Temp_byte_Variable) == 0x000004, "Member 'SocialPanel_FriendLinkButton_C_ExecuteUbergraph_SocialPanel_FriendLinkButton::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SocialPanel_FriendLinkButton_C_ExecuteUbergraph_SocialPanel_FriendLinkButton, Temp_object_Variable) == 0x000008, "Member 'SocialPanel_FriendLinkButton_C_ExecuteUbergraph_SocialPanel_FriendLinkButton::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(SocialPanel_FriendLinkButton_C_ExecuteUbergraph_SocialPanel_FriendLinkButton, Temp_object_Variable_1) == 0x000010, "Member 'SocialPanel_FriendLinkButton_C_ExecuteUbergraph_SocialPanel_FriendLinkButton::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(SocialPanel_FriendLinkButton_C_ExecuteUbergraph_SocialPanel_FriendLinkButton, Temp_object_Variable_2) == 0x000018, "Member 'SocialPanel_FriendLinkButton_C_ExecuteUbergraph_SocialPanel_FriendLinkButton::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(SocialPanel_FriendLinkButton_C_ExecuteUbergraph_SocialPanel_FriendLinkButton, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'SocialPanel_FriendLinkButton_C_ExecuteUbergraph_SocialPanel_FriendLinkButton::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialPanel_FriendLinkButton_C_ExecuteUbergraph_SocialPanel_FriendLinkButton, CallFunc_PlayAnimation_ReturnValue_1) == 0x000028, "Member 'SocialPanel_FriendLinkButton_C_ExecuteUbergraph_SocialPanel_FriendLinkButton::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SocialPanel_FriendLinkButton_C_ExecuteUbergraph_SocialPanel_FriendLinkButton, CallFunc_PlayAnimation_ReturnValue_2) == 0x000030, "Member 'SocialPanel_FriendLinkButton_C_ExecuteUbergraph_SocialPanel_FriendLinkButton::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SocialPanel_FriendLinkButton_C_ExecuteUbergraph_SocialPanel_FriendLinkButton, K2Node_Event_Type) == 0x000038, "Member 'SocialPanel_FriendLinkButton_C_ExecuteUbergraph_SocialPanel_FriendLinkButton::K2Node_Event_Type' has a wrong offset!");
static_assert(offsetof(SocialPanel_FriendLinkButton_C_ExecuteUbergraph_SocialPanel_FriendLinkButton, K2Node_Select_Default) == 0x000040, "Member 'SocialPanel_FriendLinkButton_C_ExecuteUbergraph_SocialPanel_FriendLinkButton::K2Node_Select_Default' has a wrong offset!");

// Function SocialPanel_FriendLinkButton.SocialPanel_FriendLinkButton_C.OnShareButtonTypeSet
// 0x0001 (0x0001 - 0x0000)
struct SocialPanel_FriendLinkButton_C_OnShareButtonTypeSet final
{
public:
	EFriendLinkShareButtonType                    Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialPanel_FriendLinkButton_C_OnShareButtonTypeSet) == 0x000001, "Wrong alignment on SocialPanel_FriendLinkButton_C_OnShareButtonTypeSet");
static_assert(sizeof(SocialPanel_FriendLinkButton_C_OnShareButtonTypeSet) == 0x000001, "Wrong size on SocialPanel_FriendLinkButton_C_OnShareButtonTypeSet");
static_assert(offsetof(SocialPanel_FriendLinkButton_C_OnShareButtonTypeSet, Type) == 0x000000, "Member 'SocialPanel_FriendLinkButton_C_OnShareButtonTypeSet::Type' has a wrong offset!");

}

