#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialPanelWeGameFriendButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SocialPanelWeGameFriendButton.SocialPanelWeGameFriendButton_C
// 0x0018 (0x0B58 - 0x0B40)
class USocialPanelWeGameFriendButton_C final : public UCommonButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B40(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnHovered;                                         // 0x0B48(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_LinkPrompt;                                   // 0x0B50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SocialPanelWeGameFriendButton(int32 EntryPoint);
	void BP_OnHovered();
	void BP_OnUnhovered();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SocialPanelWeGameFriendButton_C">();
	}
	static class USocialPanelWeGameFriendButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialPanelWeGameFriendButton_C>();
	}
};
static_assert(alignof(USocialPanelWeGameFriendButton_C) == 0x000008, "Wrong alignment on USocialPanelWeGameFriendButton_C");
static_assert(sizeof(USocialPanelWeGameFriendButton_C) == 0x000B58, "Wrong size on USocialPanelWeGameFriendButton_C");
static_assert(offsetof(USocialPanelWeGameFriendButton_C, UberGraphFrame) == 0x000B40, "Member 'USocialPanelWeGameFriendButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USocialPanelWeGameFriendButton_C, OnHovered) == 0x000B48, "Member 'USocialPanelWeGameFriendButton_C::OnHovered' has a wrong offset!");
static_assert(offsetof(USocialPanelWeGameFriendButton_C, Text_LinkPrompt) == 0x000B50, "Member 'USocialPanelWeGameFriendButton_C::Text_LinkPrompt' has a wrong offset!");

}

