#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialUMG

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "SocialUMG_structs.hpp"


namespace SDK::Params
{

// Function SocialUMG.SocialChatContainer.DynamicHandleMessageTextCommitted
// 0x0020 (0x0020 - 0x0000)
struct SocialChatContainer_DynamicHandleMessageTextCommitted final
{
public:
	class FText                                   MessageText;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	ETextCommit                                   CommitMethod;                                      // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SocialChatContainer_DynamicHandleMessageTextCommitted) == 0x000008, "Wrong alignment on SocialChatContainer_DynamicHandleMessageTextCommitted");
static_assert(sizeof(SocialChatContainer_DynamicHandleMessageTextCommitted) == 0x000020, "Wrong size on SocialChatContainer_DynamicHandleMessageTextCommitted");
static_assert(offsetof(SocialChatContainer_DynamicHandleMessageTextCommitted, MessageText) == 0x000000, "Member 'SocialChatContainer_DynamicHandleMessageTextCommitted::MessageText' has a wrong offset!");
static_assert(offsetof(SocialChatContainer_DynamicHandleMessageTextCommitted, CommitMethod) == 0x000018, "Member 'SocialChatContainer_DynamicHandleMessageTextCommitted::CommitMethod' has a wrong offset!");

// Function SocialUMG.SocialChatContainer.OnChatOpenChanged
// 0x0001 (0x0001 - 0x0000)
struct SocialChatContainer_OnChatOpenChanged final
{
public:
	bool                                          bShouldBeOpen;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SocialChatContainer_OnChatOpenChanged) == 0x000001, "Wrong alignment on SocialChatContainer_OnChatOpenChanged");
static_assert(sizeof(SocialChatContainer_OnChatOpenChanged) == 0x000001, "Wrong size on SocialChatContainer_OnChatOpenChanged");
static_assert(offsetof(SocialChatContainer_OnChatOpenChanged, bShouldBeOpen) == 0x000000, "Member 'SocialChatContainer_OnChatOpenChanged::bShouldBeOpen' has a wrong offset!");

// Function SocialUMG.SocialChatMessageEntry.CanInteract
// 0x0001 (0x0001 - 0x0000)
struct SocialChatMessageEntry_CanInteract final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SocialChatMessageEntry_CanInteract) == 0x000001, "Wrong alignment on SocialChatMessageEntry_CanInteract");
static_assert(sizeof(SocialChatMessageEntry_CanInteract) == 0x000001, "Wrong size on SocialChatMessageEntry_CanInteract");
static_assert(offsetof(SocialChatMessageEntry_CanInteract, ReturnValue) == 0x000000, "Member 'SocialChatMessageEntry_CanInteract::ReturnValue' has a wrong offset!");

// Function SocialUMG.SocialGroupListEntry.HandleGetMenuContent
// 0x0008 (0x0008 - 0x0000)
struct SocialGroupListEntry_HandleGetMenuContent final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SocialGroupListEntry_HandleGetMenuContent) == 0x000008, "Wrong alignment on SocialGroupListEntry_HandleGetMenuContent");
static_assert(sizeof(SocialGroupListEntry_HandleGetMenuContent) == 0x000008, "Wrong size on SocialGroupListEntry_HandleGetMenuContent");
static_assert(offsetof(SocialGroupListEntry_HandleGetMenuContent, ReturnValue) == 0x000000, "Member 'SocialGroupListEntry_HandleGetMenuContent::ReturnValue' has a wrong offset!");

// Function SocialUMG.SocialInteractionButton.GetInteractionName
// 0x0008 (0x0008 - 0x0000)
struct SocialInteractionButton_GetInteractionName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SocialInteractionButton_GetInteractionName) == 0x000004, "Wrong alignment on SocialInteractionButton_GetInteractionName");
static_assert(sizeof(SocialInteractionButton_GetInteractionName) == 0x000008, "Wrong size on SocialInteractionButton_GetInteractionName");
static_assert(offsetof(SocialInteractionButton_GetInteractionName, ReturnValue) == 0x000000, "Member 'SocialInteractionButton_GetInteractionName::ReturnValue' has a wrong offset!");

// Function SocialUMG.SocialInteractionButton.IsPlatformOnlyFriend
// 0x0001 (0x0001 - 0x0000)
struct SocialInteractionButton_IsPlatformOnlyFriend final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SocialInteractionButton_IsPlatformOnlyFriend) == 0x000001, "Wrong alignment on SocialInteractionButton_IsPlatformOnlyFriend");
static_assert(sizeof(SocialInteractionButton_IsPlatformOnlyFriend) == 0x000001, "Wrong size on SocialInteractionButton_IsPlatformOnlyFriend");
static_assert(offsetof(SocialInteractionButton_IsPlatformOnlyFriend, ReturnValue) == 0x000000, "Member 'SocialInteractionButton_IsPlatformOnlyFriend::ReturnValue' has a wrong offset!");

// Function SocialUMG.SocialInteractionMenu.OnToggleConfirmation
// 0x0001 (0x0001 - 0x0000)
struct SocialInteractionMenu_OnToggleConfirmation final
{
public:
	bool                                          bIsVisible;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SocialInteractionMenu_OnToggleConfirmation) == 0x000001, "Wrong alignment on SocialInteractionMenu_OnToggleConfirmation");
static_assert(sizeof(SocialInteractionMenu_OnToggleConfirmation) == 0x000001, "Wrong size on SocialInteractionMenu_OnToggleConfirmation");
static_assert(offsetof(SocialInteractionMenu_OnToggleConfirmation, bIsVisible) == 0x000000, "Member 'SocialInteractionMenu_OnToggleConfirmation::bIsVisible' has a wrong offset!");

// Function SocialUMG.SocialInteractionMenu.GetFirstEntryToCenter
// 0x0008 (0x0008 - 0x0000)
struct SocialInteractionMenu_GetFirstEntryToCenter final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SocialInteractionMenu_GetFirstEntryToCenter) == 0x000008, "Wrong alignment on SocialInteractionMenu_GetFirstEntryToCenter");
static_assert(sizeof(SocialInteractionMenu_GetFirstEntryToCenter) == 0x000008, "Wrong size on SocialInteractionMenu_GetFirstEntryToCenter");
static_assert(offsetof(SocialInteractionMenu_GetFirstEntryToCenter, ReturnValue) == 0x000000, "Member 'SocialInteractionMenu_GetFirstEntryToCenter::ReturnValue' has a wrong offset!");

// Function SocialUMG.SocialListEntry.HandleGetMenuContent
// 0x0008 (0x0008 - 0x0000)
struct SocialListEntry_HandleGetMenuContent final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SocialListEntry_HandleGetMenuContent) == 0x000008, "Wrong alignment on SocialListEntry_HandleGetMenuContent");
static_assert(sizeof(SocialListEntry_HandleGetMenuContent) == 0x000008, "Wrong size on SocialListEntry_HandleGetMenuContent");
static_assert(offsetof(SocialListEntry_HandleGetMenuContent, ReturnValue) == 0x000000, "Member 'SocialListEntry_HandleGetMenuContent::ReturnValue' has a wrong offset!");

// Function SocialUMG.SocialUserListEntry.OnUserPresenceChanged
// 0x0001 (0x0001 - 0x0000)
struct SocialUserListEntry_OnUserPresenceChanged final
{
public:
	EOnlineStatus                                 OnlineStatus;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SocialUserListEntry_OnUserPresenceChanged) == 0x000001, "Wrong alignment on SocialUserListEntry_OnUserPresenceChanged");
static_assert(sizeof(SocialUserListEntry_OnUserPresenceChanged) == 0x000001, "Wrong size on SocialUserListEntry_OnUserPresenceChanged");
static_assert(offsetof(SocialUserListEntry_OnUserPresenceChanged, OnlineStatus) == 0x000000, "Member 'SocialUserListEntry_OnUserPresenceChanged::OnlineStatus' has a wrong offset!");

}

