#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialPanelWeGameFriendButton

#include "Basic.hpp"


namespace SDK::Params
{

// Function SocialPanelWeGameFriendButton.SocialPanelWeGameFriendButton_C.ExecuteUbergraph_SocialPanelWeGameFriendButton
// 0x0018 (0x0018 - 0x0000)
struct SocialPanelWeGameFriendButton_C_ExecuteUbergraph_SocialPanelWeGameFriendButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialPanelWeGameFriendButton_C_ExecuteUbergraph_SocialPanelWeGameFriendButton) == 0x000008, "Wrong alignment on SocialPanelWeGameFriendButton_C_ExecuteUbergraph_SocialPanelWeGameFriendButton");
static_assert(sizeof(SocialPanelWeGameFriendButton_C_ExecuteUbergraph_SocialPanelWeGameFriendButton) == 0x000018, "Wrong size on SocialPanelWeGameFriendButton_C_ExecuteUbergraph_SocialPanelWeGameFriendButton");
static_assert(offsetof(SocialPanelWeGameFriendButton_C_ExecuteUbergraph_SocialPanelWeGameFriendButton, EntryPoint) == 0x000000, "Member 'SocialPanelWeGameFriendButton_C_ExecuteUbergraph_SocialPanelWeGameFriendButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(SocialPanelWeGameFriendButton_C_ExecuteUbergraph_SocialPanelWeGameFriendButton, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'SocialPanelWeGameFriendButton_C_ExecuteUbergraph_SocialPanelWeGameFriendButton::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialPanelWeGameFriendButton_C_ExecuteUbergraph_SocialPanelWeGameFriendButton, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'SocialPanelWeGameFriendButton_C_ExecuteUbergraph_SocialPanelWeGameFriendButton::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

}

