#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Synthesis

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Synthesis_structs.hpp"


namespace SDK::Params
{

// Function Synthesis.SourceEffectEnvelopeFollowerPreset.RegisterEnvelopeFollowerListener
// 0x0008 (0x0008 - 0x0000)
struct SourceEffectEnvelopeFollowerPreset_RegisterEnvelopeFollowerListener final
{
public:
	class UEnvelopeFollowerListener*              EnvelopeFollowerListener;                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SourceEffectEnvelopeFollowerPreset_RegisterEnvelopeFollowerListener) == 0x000008, "Wrong alignment on SourceEffectEnvelopeFollowerPreset_RegisterEnvelopeFollowerListener");
static_assert(sizeof(SourceEffectEnvelopeFollowerPreset_RegisterEnvelopeFollowerListener) == 0x000008, "Wrong size on SourceEffectEnvelopeFollowerPreset_RegisterEnvelopeFollowerListener");
static_assert(offsetof(SourceEffectEnvelopeFollowerPreset_RegisterEnvelopeFollowerListener, EnvelopeFollowerListener) == 0x000000, "Member 'SourceEffectEnvelopeFollowerPreset_RegisterEnvelopeFollowerListener::EnvelopeFollowerListener' has a wrong offset!");

// Function Synthesis.SourceEffectEnvelopeFollowerPreset.SetSettings
// 0x000C (0x000C - 0x0000)
struct SourceEffectEnvelopeFollowerPreset_SetSettings final
{
public:
	struct FSourceEffectEnvelopeFollowerSettings  InSettings;                                        // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(SourceEffectEnvelopeFollowerPreset_SetSettings) == 0x000004, "Wrong alignment on SourceEffectEnvelopeFollowerPreset_SetSettings");
static_assert(sizeof(SourceEffectEnvelopeFollowerPreset_SetSettings) == 0x00000C, "Wrong size on SourceEffectEnvelopeFollowerPreset_SetSettings");
static_assert(offsetof(SourceEffectEnvelopeFollowerPreset_SetSettings, InSettings) == 0x000000, "Member 'SourceEffectEnvelopeFollowerPreset_SetSettings::InSettings' has a wrong offset!");

// Function Synthesis.SourceEffectEnvelopeFollowerPreset.UnregisterEnvelopeFollowerListener
// 0x0008 (0x0008 - 0x0000)
struct SourceEffectEnvelopeFollowerPreset_UnregisterEnvelopeFollowerListener final
{
public:
	class UEnvelopeFollowerListener*              EnvelopeFollowerListener;                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SourceEffectEnvelopeFollowerPreset_UnregisterEnvelopeFollowerListener) == 0x000008, "Wrong alignment on SourceEffectEnvelopeFollowerPreset_UnregisterEnvelopeFollowerListener");
static_assert(sizeof(SourceEffectEnvelopeFollowerPreset_UnregisterEnvelopeFollowerListener) == 0x000008, "Wrong size on SourceEffectEnvelopeFollowerPreset_UnregisterEnvelopeFollowerListener");
static_assert(offsetof(SourceEffectEnvelopeFollowerPreset_UnregisterEnvelopeFollowerListener, EnvelopeFollowerListener) == 0x000000, "Member 'SourceEffectEnvelopeFollowerPreset_UnregisterEnvelopeFollowerListener::EnvelopeFollowerListener' has a wrong offset!");

// Function Synthesis.ModularSynthLibrary.AddModularSynthPresetToBankAsset
// 0x00F8 (0x00F8 - 0x0000)
struct ModularSynthLibrary_AddModularSynthPresetToBankAsset final
{
public:
	class UModularSynthPresetBank*                InBank;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModularSynthPreset                    Preset;                                            // 0x0008(0x00E0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 PresetName;                                        // 0x00E8(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularSynthLibrary_AddModularSynthPresetToBankAsset) == 0x000008, "Wrong alignment on ModularSynthLibrary_AddModularSynthPresetToBankAsset");
static_assert(sizeof(ModularSynthLibrary_AddModularSynthPresetToBankAsset) == 0x0000F8, "Wrong size on ModularSynthLibrary_AddModularSynthPresetToBankAsset");
static_assert(offsetof(ModularSynthLibrary_AddModularSynthPresetToBankAsset, InBank) == 0x000000, "Member 'ModularSynthLibrary_AddModularSynthPresetToBankAsset::InBank' has a wrong offset!");
static_assert(offsetof(ModularSynthLibrary_AddModularSynthPresetToBankAsset, Preset) == 0x000008, "Member 'ModularSynthLibrary_AddModularSynthPresetToBankAsset::Preset' has a wrong offset!");
static_assert(offsetof(ModularSynthLibrary_AddModularSynthPresetToBankAsset, PresetName) == 0x0000E8, "Member 'ModularSynthLibrary_AddModularSynthPresetToBankAsset::PresetName' has a wrong offset!");

// Function Synthesis.ModularSynthComponent.CreatePatch
// 0x0020 (0x0020 - 0x0000)
struct ModularSynthComponent_CreatePatch final
{
public:
	ESynth1PatchSource                            PatchSource;                                       // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSynth1PatchCable>              PatchCables;                                       // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bEnableByDefault;                                  // 0x0018(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPatchId                               ReturnValue;                                       // 0x001C(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularSynthComponent_CreatePatch) == 0x000008, "Wrong alignment on ModularSynthComponent_CreatePatch");
static_assert(sizeof(ModularSynthComponent_CreatePatch) == 0x000020, "Wrong size on ModularSynthComponent_CreatePatch");
static_assert(offsetof(ModularSynthComponent_CreatePatch, PatchSource) == 0x000000, "Member 'ModularSynthComponent_CreatePatch::PatchSource' has a wrong offset!");
static_assert(offsetof(ModularSynthComponent_CreatePatch, PatchCables) == 0x000008, "Member 'ModularSynthComponent_CreatePatch::PatchCables' has a wrong offset!");
static_assert(offsetof(ModularSynthComponent_CreatePatch, bEnableByDefault) == 0x000018, "Member 'ModularSynthComponent_CreatePatch::bEnableByDefault' has a wrong offset!");
static_assert(offsetof(ModularSynthComponent_CreatePatch, ReturnValue) == 0x00001C, "Member 'ModularSynthComponent_CreatePatch::ReturnValue' has a wrong offset!");

// Function Synthesis.ModularSynthComponent.NoteOff
// 0x0008 (0x0008 - 0x0000)
struct ModularSynthComponent_NoteOff final
{
public:
	float                                         Note;                                              // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllNotesOff;                                      // 0x0004(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bKillAllNotes;                                     // 0x0005(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ModularSynthComponent_NoteOff) == 0x000004, "Wrong alignment on ModularSynthComponent_NoteOff");
static_assert(sizeof(ModularSynthComponent_NoteOff) == 0x000008, "Wrong size on ModularSynthComponent_NoteOff");
static_assert(offsetof(ModularSynthComponent_NoteOff, Note) == 0x000000, "Member 'ModularSynthComponent_NoteOff::Note' has a wrong offset!");
static_assert(offsetof(ModularSynthComponent_NoteOff, bAllNotesOff) == 0x000004, "Member 'ModularSynthComponent_NoteOff::bAllNotesOff' has a wrong offset!");
static_assert(offsetof(ModularSynthComponent_NoteOff, bKillAllNotes) == 0x000005, "Member 'ModularSynthComponent_NoteOff::bKillAllNotes' has a wrong offset!");

// Function Synthesis.ModularSynthComponent.NoteOn
// 0x000C (0x000C - 0x0000)
struct ModularSynthComponent_NoteOn final
{
public:
	float                                         Note;                                              // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Velocity;                                          // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularSynthComponent_NoteOn) == 0x000004, "Wrong alignment on ModularSynthComponent_NoteOn");
static_assert(sizeof(ModularSynthComponent_NoteOn) == 0x00000C, "Wrong size on ModularSynthComponent_NoteOn");
static_assert(offsetof(ModularSynthComponent_NoteOn, Note) == 0x000000, "Member 'ModularSynthComponent_NoteOn::Note' has a wrong offset!");
static_assert(offsetof(ModularSynthComponent_NoteOn, Velocity) == 0x000004, "Member 'ModularSynthComponent_NoteOn::Velocity' has a wrong offset!");
static_assert(offsetof(ModularSynthComponent_NoteOn, Duration) == 0x000008, "Member 'ModularSynthComponent_NoteOn::Duration' has a wrong offset!");

// Function Synthesis.ModularSynthComponent.SetAttackTime
// 0x0004 (0x0004 - 0x0000)
struct ModularSynthComponent_SetAttackTime final
{
public:
	float                                         AttackTimeMsec;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularSynthComponent_SetAttackTime) == 0x000004, "Wrong alignment on ModularSynthComponent_SetAttackTime");
static_assert(sizeof(ModularSynthComponent_SetAttackTime) == 0x000004, "Wrong size on ModularSynthComponent_SetAttackTime");
static_assert(offsetof(ModularSynthComponent_SetAttackTime, AttackTimeMsec) == 0x000000, "Member 'ModularSynthComponent_SetAttackTime::AttackTimeMsec' has a wrong offset!");

// Function Synthesis.ModularSynthComponent.SetChorusDepth
// 0x0004 (0x0004 - 0x0000)
struct ModularSynthComponent_SetChorusDepth final
{
public:
	float                                         Depth;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularSynthComponent_SetChorusDepth) == 0x000004, "Wrong alignment on ModularSynthComponent_SetChorusDepth");
static_assert(sizeof(ModularSynthComponent_SetChorusDepth) == 0x000004, "Wrong size on ModularSynthComponent_SetChorusDepth");
static_assert(offsetof(ModularSynthComponent_SetChorusDepth, Depth) == 0x000000, "Member 'ModularSynthComponent_SetChorusDepth::Depth' has a wrong offset!");

// Function Synthesis.ModularSynthComponent.SetChorusEnabled
// 0x0001 (0x0001 - 0x0000)
struct ModularSynthComponent_SetChorusEnabled final
{
public:
	bool                                          EnableChorus;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularSynthComponent_SetChorusEnabled) == 0x000001, "Wrong alignment on ModularSynthComponent_SetChorusEnabled");
static_assert(sizeof(ModularSynthComponent_SetChorusEnabled) == 0x000001, "Wrong size on ModularSynthComponent_SetChorusEnabled");
static_assert(offsetof(ModularSynthComponent_SetChorusEnabled, EnableChorus) == 0x000000, "Member 'ModularSynthComponent_SetChorusEnabled::EnableChorus' has a wrong offset!");

// Function Synthesis.ModularSynthComponent.SetChorusFeedback
// 0x0004 (0x0004 - 0x0000)
struct ModularSynthComponent_SetChorusFeedback final
{
public:
	float                                         Feedback;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularSynthComponent_SetChorusFeedback) == 0x000004, "Wrong alignment on ModularSynthComponent_SetChorusFeedback");
static_assert(sizeof(ModularSynthComponent_SetChorusFeedback) == 0x000004, "Wrong size on ModularSynthComponent_SetChorusFeedback");
static_assert(offsetof(ModularSynthComponent_SetChorusFeedback, Feedback) == 0x000000, "Member 'ModularSynthComponent_SetChorusFeedback::Feedback' has a wrong offset!");

// Function Synthesis.ModularSynthComponent.SetChorusFrequency
// 0x0004 (0x0004 - 0x0000)
struct ModularSynthComponent_SetChorusFrequency final
{
public:
	float                                         Frequency;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularSynthComponent_SetChorusFrequency) == 0x000004, "Wrong alignment on ModularSynthComponent_SetChorusFrequency");
static_assert(sizeof(ModularSynthComponent_SetChorusFrequency) == 0x000004, "Wrong size on ModularSynthComponent_SetChorusFrequency");
static_assert(offsetof(ModularSynthComponent_SetChorusFrequency, Frequency) == 0x000000, "Member 'ModularSynthComponent_SetChorusFrequency::Frequency' has a wrong offset!");

// Function Synthesis.ModularSynthComponent.SetDecayTime
// 0x0004 (0x0004 - 0x0000)
struct ModularSynthComponent_SetDecayTime final
{
public:
	float                                         DecayTimeMsec;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularSynthComponent_SetDecayTime) == 0x000004, "Wrong alignment on ModularSynthComponent_SetDecayTime");
static_assert(sizeof(ModularSynthComponent_SetDecayTime) == 0x000004, "Wrong size on ModularSynthComponent_SetDecayTime");
static_assert(offsetof(ModularSynthComponent_SetDecayTime, DecayTimeMsec) == 0x000000, "Member 'ModularSynthComponent_SetDecayTime::DecayTimeMsec' has a wrong offset!");

// Function Synthesis.ModularSynthComponent.SetEnableLegato
// 0x0001 (0x0001 - 0x0000)
struct ModularSynthComponent_SetEnableLegato final
{
public:
	bool                                          LegatoEnabled;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularSynthComponent_SetEnableLegato) == 0x000001, "Wrong alignment on ModularSynthComponent_SetEnableLegato");
static_assert(sizeof(ModularSynthComponent_SetEnableLegato) == 0x000001, "Wrong size on ModularSynthComponent_SetEnableLegato");
static_assert(offsetof(ModularSynthComponent_SetEnableLegato, LegatoEnabled) == 0x000000, "Member 'ModularSynthComponent_SetEnableLegato::LegatoEnabled' has a wrong offset!");

// Function Synthesis.ModularSynthComponent.SetEnablePatch
// 0x0008 (0x0008 - 0x0000)
struct ModularSynthComponent_SetEnablePatch final
{
public:
	struct FPatchId                               PatchId;                                           // 0x0000(0x0004)(ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bIsEnabled;                                        // 0x0004(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0005(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ModularSynthComponent_SetEnablePatch) == 0x000004, "Wrong alignment on ModularSynthComponent_SetEnablePatch");
static_assert(sizeof(ModularSynthComponent_SetEnablePatch) == 0x000008, "Wrong size on ModularSynthComponent_SetEnablePatch");
static_assert(offsetof(ModularSynthComponent_SetEnablePatch, PatchId) == 0x000000, "Member 'ModularSynthComponent_SetEnablePatch::PatchId' has a wrong offset!");
static_assert(offsetof(ModularSynthComponent_SetEnablePatch, bIsEnabled) == 0x000004, "Member 'ModularSynthComponent_SetEnablePatch::bIsEnabled' has a wrong offset!");
static_assert(offsetof(ModularSynthComponent_SetEnablePatch, ReturnValue) == 0x000005, "Member 'ModularSynthComponent_SetEnablePatch::ReturnValue' has a wrong offset!");

// Function Synthesis.ModularSynthComponent.SetEnablePolyphony
// 0x0001 (0x0001 - 0x0000)
struct ModularSynthComponent_SetEnablePolyphony final
{
public:
	bool                                          bEnablePolyphony;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularSynthComponent_SetEnablePolyphony) == 0x000001, "Wrong alignment on ModularSynthComponent_SetEnablePolyphony");
static_assert(sizeof(ModularSynthComponent_SetEnablePolyphony) == 0x000001, "Wrong size on ModularSynthComponent_SetEnablePolyphony");
static_assert(offsetof(ModularSynthComponent_SetEnablePolyphony, bEnablePolyphony) == 0x000000, "Member 'ModularSynthComponent_SetEnablePolyphony::bEnablePolyphony' has a wrong offset!");

// Function Synthesis.ModularSynthComponent.SetEnableRetrigger
// 0x0001 (0x0001 - 0x0000)
struct ModularSynthComponent_SetEnableRetrigger final
{
public:
	bool                                          RetriggerEnabled;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularSynthComponent_SetEnableRetrigger) == 0x000001, "Wrong alignment on ModularSynthComponent_SetEnableRetrigger");
static_assert(sizeof(ModularSynthComponent_SetEnableRetrigger) == 0x000001, "Wrong size on ModularSynthComponent_SetEnableRetrigger");
static_assert(offsetof(ModularSynthComponent_SetEnableRetrigger, RetriggerEnabled) == 0x000000, "Member 'ModularSynthComponent_SetEnableRetrigger::RetriggerEnabled' has a wrong offset!");

// Function Synthesis.ModularSynthComponent.SetEnableUnison
// 0x0001 (0x0001 - 0x0000)
struct ModularSynthComponent_SetEnableUnison final
{
public:
	bool                                          EnableUnison;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularSynthComponent_SetEnableUnison) == 0x000001, "Wrong alignment on ModularSynthComponent_SetEnableUnison");
static_assert(sizeof(ModularSynthComponent_SetEnableUnison) == 0x000001, "Wrong size on ModularSynthComponent_SetEnableUnison");
static_assert(offsetof(ModularSynthComponent_SetEnableUnison, EnableUnison) == 0x000000, "Member 'ModularSynthComponent_SetEnableUnison::EnableUnison' has a wrong offset!");

// Function Synthesis.ModularSynthComponent.SetFilterAlgorithm
// 0x0001 (0x0001 - 0x0000)
struct ModularSynthComponent_SetFilterAlgorithm final
{
public:
	ESynthFilterAlgorithm                         FilterAlgorithm;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularSynthComponent_SetFilterAlgorithm) == 0x000001, "Wrong alignment on ModularSynthComponent_SetFilterAlgorithm");
static_assert(sizeof(ModularSynthComponent_SetFilterAlgorithm) == 0x000001, "Wrong size on ModularSynthComponent_SetFilterAlgorithm");
static_assert(offsetof(ModularSynthComponent_SetFilterAlgorithm, FilterAlgorithm) == 0x000000, "Member 'ModularSynthComponent_SetFilterAlgorithm::FilterAlgorithm' has a wrong offset!");

// Function Synthesis.ModularSynthComponent.SetFilterFrequency
// 0x0004 (0x0004 - 0x0000)
struct ModularSynthComponent_SetFilterFrequency final
{
public:
	float                                         FilterFrequencyHz;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularSynthComponent_SetFilterFrequency) == 0x000004, "Wrong alignment on ModularSynthComponent_SetFilterFrequency");
static_assert(sizeof(ModularSynthComponent_SetFilterFrequency) == 0x000004, "Wrong size on ModularSynthComponent_SetFilterFrequency");
static_assert(offsetof(ModularSynthComponent_SetFilterFrequency, FilterFrequencyHz) == 0x000000, "Member 'ModularSynthComponent_SetFilterFrequency::FilterFrequencyHz' has a wrong offset!");

// Function Synthesis.ModularSynthComponent.SetFilterFrequencyMod
// 0x0004 (0x0004 - 0x0000)
struct ModularSynthComponent_SetFilterFrequencyMod final
{
public:
	float                                         FilterFrequencyHz;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularSynthComponent_SetFilterFrequencyMod) == 0x000004, "Wrong alignment on ModularSynthComponent_SetFilterFrequencyMod");
static_assert(sizeof(ModularSynthComponent_SetFilterFrequencyMod) == 0x000004, "Wrong size on ModularSynthComponent_SetFilterFrequencyMod");
static_assert(offsetof(ModularSynthComponent_SetFilterFrequencyMod, FilterFrequencyHz) == 0x000000, "Member 'ModularSynthComponent_SetFilterFrequencyMod::FilterFrequencyHz' has a wrong offset!");

// Function Synthesis.ModularSynthComponent.SetFilterQ
// 0x0004 (0x0004 - 0x0000)
struct ModularSynthComponent_SetFilterQ final
{
public:
	float                                         FilterQ;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularSynthComponent_SetFilterQ) == 0x000004, "Wrong alignment on ModularSynthComponent_SetFilterQ");
static_assert(sizeof(ModularSynthComponent_SetFilterQ) == 0x000004, "Wrong size on ModularSynthComponent_SetFilterQ");
static_assert(offsetof(ModularSynthComponent_SetFilterQ, FilterQ) == 0x000000, "Member 'ModularSynthComponent_SetFilterQ::FilterQ' has a wrong offset!");

// Function Synthesis.ModularSynthComponent.SetFilterQMod
// 0x0004 (0x0004 - 0x0000)
struct ModularSynthComponent_SetFilterQMod final
{
public:
	float                                         FilterQ;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularSynthComponent_SetFilterQMod) == 0x000004, "Wrong alignment on ModularSynthComponent_SetFilterQMod");
static_assert(sizeof(ModularSynthComponent_SetFilterQMod) == 0x000004, "Wrong size on ModularSynthComponent_SetFilterQMod");
static_assert(offsetof(ModularSynthComponent_SetFilterQMod, FilterQ) == 0x000000, "Member 'ModularSynthComponent_SetFilterQMod::FilterQ' has a wrong offset!");

// Function Synthesis.ModularSynthComponent.SetFilterType
// 0x0001 (0x0001 - 0x0000)
struct ModularSynthComponent_SetFilterType final
{
public:
	ESynthFilterType                              FilterType;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularSynthComponent_SetFilterType) == 0x000001, "Wrong alignment on ModularSynthComponent_SetFilterType");
static_assert(sizeof(ModularSynthComponent_SetFilterType) == 0x000001, "Wrong size on ModularSynthComponent_SetFilterType");
static_assert(offsetof(ModularSynthComponent_SetFilterType, FilterType) == 0x000000, "Member 'ModularSynthComponent_SetFilterType::FilterType' has a wrong offset!");

// Function Synthesis.ModularSynthComponent.SetGainDb
// 0x0004 (0x0004 - 0x0000)
struct ModularSynthComponent_SetGainDb final
{
public:
	float                                         GainDb;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularSynthComponent_SetGainDb) == 0x000004, "Wrong alignment on ModularSynthComponent_SetGainDb");
static_assert(sizeof(ModularSynthComponent_SetGainDb) == 0x000004, "Wrong size on ModularSynthComponent_SetGainDb");
static_assert(offsetof(ModularSynthComponent_SetGainDb, GainDb) == 0x000000, "Member 'ModularSynthComponent_SetGainDb::GainDb' has a wrong offset!");

// Function Synthesis.ModularSynthComponent.SetLFOFrequency
// 0x0008 (0x0008 - 0x0000)
struct ModularSynthComponent_SetLFOFrequency final
{
public:
	int32                                         LFOIndex;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FrequencyHz;                                       // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularSynthComponent_SetLFOFrequency) == 0x000004, "Wrong alignment on ModularSynthComponent_SetLFOFrequency");
static_assert(sizeof(ModularSynthComponent_SetLFOFrequency) == 0x000008, "Wrong size on ModularSynthComponent_SetLFOFrequency");
static_assert(offsetof(ModularSynthComponent_SetLFOFrequency, LFOIndex) == 0x000000, "Member 'ModularSynthComponent_SetLFOFrequency::LFOIndex' has a wrong offset!");
static_assert(offsetof(ModularSynthComponent_SetLFOFrequency, FrequencyHz) == 0x000004, "Member 'ModularSynthComponent_SetLFOFrequency::FrequencyHz' has a wrong offset!");

// Function Synthesis.ModularSynthComponent.SetLFOFrequencyMod
// 0x0008 (0x0008 - 0x0000)
struct ModularSynthComponent_SetLFOFrequencyMod final
{
public:
	int32                                         LFOIndex;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FrequencyModHz;                                    // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularSynthComponent_SetLFOFrequencyMod) == 0x000004, "Wrong alignment on ModularSynthComponent_SetLFOFrequencyMod");
static_assert(sizeof(ModularSynthComponent_SetLFOFrequencyMod) == 0x000008, "Wrong size on ModularSynthComponent_SetLFOFrequencyMod");
static_assert(offsetof(ModularSynthComponent_SetLFOFrequencyMod, LFOIndex) == 0x000000, "Member 'ModularSynthComponent_SetLFOFrequencyMod::LFOIndex' has a wrong offset!");
static_assert(offsetof(ModularSynthComponent_SetLFOFrequencyMod, FrequencyModHz) == 0x000004, "Member 'ModularSynthComponent_SetLFOFrequencyMod::FrequencyModHz' has a wrong offset!");

// Function Synthesis.ModularSynthComponent.SetLFOGain
// 0x0008 (0x0008 - 0x0000)
struct ModularSynthComponent_SetLFOGain final
{
public:
	int32                                         LFOIndex;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Gain;                                              // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularSynthComponent_SetLFOGain) == 0x000004, "Wrong alignment on ModularSynthComponent_SetLFOGain");
static_assert(sizeof(ModularSynthComponent_SetLFOGain) == 0x000008, "Wrong size on ModularSynthComponent_SetLFOGain");
static_assert(offsetof(ModularSynthComponent_SetLFOGain, LFOIndex) == 0x000000, "Member 'ModularSynthComponent_SetLFOGain::LFOIndex' has a wrong offset!");
static_assert(offsetof(ModularSynthComponent_SetLFOGain, Gain) == 0x000004, "Member 'ModularSynthComponent_SetLFOGain::Gain' has a wrong offset!");

// Function Synthesis.ModularSynthComponent.SetLFOGainMod
// 0x0008 (0x0008 - 0x0000)
struct ModularSynthComponent_SetLFOGainMod final
{
public:
	int32                                         LFOIndex;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GainMod;                                           // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularSynthComponent_SetLFOGainMod) == 0x000004, "Wrong alignment on ModularSynthComponent_SetLFOGainMod");
static_assert(sizeof(ModularSynthComponent_SetLFOGainMod) == 0x000008, "Wrong size on ModularSynthComponent_SetLFOGainMod");
static_assert(offsetof(ModularSynthComponent_SetLFOGainMod, LFOIndex) == 0x000000, "Member 'ModularSynthComponent_SetLFOGainMod::LFOIndex' has a wrong offset!");
static_assert(offsetof(ModularSynthComponent_SetLFOGainMod, GainMod) == 0x000004, "Member 'ModularSynthComponent_SetLFOGainMod::GainMod' has a wrong offset!");

// Function Synthesis.ModularSynthComponent.SetLFOMode
// 0x0008 (0x0008 - 0x0000)
struct ModularSynthComponent_SetLFOMode final
{
public:
	int32                                         LFOIndex;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESynthLFOMode                                 LFOMode;                                           // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ModularSynthComponent_SetLFOMode) == 0x000004, "Wrong alignment on ModularSynthComponent_SetLFOMode");
static_assert(sizeof(ModularSynthComponent_SetLFOMode) == 0x000008, "Wrong size on ModularSynthComponent_SetLFOMode");
static_assert(offsetof(ModularSynthComponent_SetLFOMode, LFOIndex) == 0x000000, "Member 'ModularSynthComponent_SetLFOMode::LFOIndex' has a wrong offset!");
static_assert(offsetof(ModularSynthComponent_SetLFOMode, LFOMode) == 0x000004, "Member 'ModularSynthComponent_SetLFOMode::LFOMode' has a wrong offset!");

// Function Synthesis.ModularSynthComponent.SetLFOPatch
// 0x0008 (0x0008 - 0x0000)
struct ModularSynthComponent_SetLFOPatch final
{
public:
	int32                                         LFOIndex;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESynthLFOPatchType                            LFOPatchType;                                      // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ModularSynthComponent_SetLFOPatch) == 0x000004, "Wrong alignment on ModularSynthComponent_SetLFOPatch");
static_assert(sizeof(ModularSynthComponent_SetLFOPatch) == 0x000008, "Wrong size on ModularSynthComponent_SetLFOPatch");
static_assert(offsetof(ModularSynthComponent_SetLFOPatch, LFOIndex) == 0x000000, "Member 'ModularSynthComponent_SetLFOPatch::LFOIndex' has a wrong offset!");
static_assert(offsetof(ModularSynthComponent_SetLFOPatch, LFOPatchType) == 0x000004, "Member 'ModularSynthComponent_SetLFOPatch::LFOPatchType' has a wrong offset!");

// Function Synthesis.ModularSynthComponent.SetLFOType
// 0x0008 (0x0008 - 0x0000)
struct ModularSynthComponent_SetLFOType final
{
public:
	int32                                         LFOIndex;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESynthLFOType                                 LFOType;                                           // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ModularSynthComponent_SetLFOType) == 0x000004, "Wrong alignment on ModularSynthComponent_SetLFOType");
static_assert(sizeof(ModularSynthComponent_SetLFOType) == 0x000008, "Wrong size on ModularSynthComponent_SetLFOType");
static_assert(offsetof(ModularSynthComponent_SetLFOType, LFOIndex) == 0x000000, "Member 'ModularSynthComponent_SetLFOType::LFOIndex' has a wrong offset!");
static_assert(offsetof(ModularSynthComponent_SetLFOType, LFOType) == 0x000004, "Member 'ModularSynthComponent_SetLFOType::LFOType' has a wrong offset!");

// Function Synthesis.ModularSynthComponent.SetModEnvAttackTime
// 0x0004 (0x0004 - 0x0000)
struct ModularSynthComponent_SetModEnvAttackTime final
{
public:
	float                                         AttackTimeMsec;                                    // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularSynthComponent_SetModEnvAttackTime) == 0x000004, "Wrong alignment on ModularSynthComponent_SetModEnvAttackTime");
static_assert(sizeof(ModularSynthComponent_SetModEnvAttackTime) == 0x000004, "Wrong size on ModularSynthComponent_SetModEnvAttackTime");
static_assert(offsetof(ModularSynthComponent_SetModEnvAttackTime, AttackTimeMsec) == 0x000000, "Member 'ModularSynthComponent_SetModEnvAttackTime::AttackTimeMsec' has a wrong offset!");

// Function Synthesis.ModularSynthComponent.SetModEnvBiasInvert
// 0x0001 (0x0001 - 0x0000)
struct ModularSynthComponent_SetModEnvBiasInvert final
{
public:
	bool                                          bInvert;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularSynthComponent_SetModEnvBiasInvert) == 0x000001, "Wrong alignment on ModularSynthComponent_SetModEnvBiasInvert");
static_assert(sizeof(ModularSynthComponent_SetModEnvBiasInvert) == 0x000001, "Wrong size on ModularSynthComponent_SetModEnvBiasInvert");
static_assert(offsetof(ModularSynthComponent_SetModEnvBiasInvert, bInvert) == 0x000000, "Member 'ModularSynthComponent_SetModEnvBiasInvert::bInvert' has a wrong offset!");

// Function Synthesis.ModularSynthComponent.SetModEnvBiasPatch
// 0x0001 (0x0001 - 0x0000)
struct ModularSynthComponent_SetModEnvBiasPatch final
{
public:
	ESynthModEnvBiasPatch                         InPatchType;                                       // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularSynthComponent_SetModEnvBiasPatch) == 0x000001, "Wrong alignment on ModularSynthComponent_SetModEnvBiasPatch");
static_assert(sizeof(ModularSynthComponent_SetModEnvBiasPatch) == 0x000001, "Wrong size on ModularSynthComponent_SetModEnvBiasPatch");
static_assert(offsetof(ModularSynthComponent_SetModEnvBiasPatch, InPatchType) == 0x000000, "Member 'ModularSynthComponent_SetModEnvBiasPatch::InPatchType' has a wrong offset!");

// Function Synthesis.ModularSynthComponent.SetModEnvDecayTime
// 0x0004 (0x0004 - 0x0000)
struct ModularSynthComponent_SetModEnvDecayTime final
{
public:
	float                                         DecayTimeMsec;                                     // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularSynthComponent_SetModEnvDecayTime) == 0x000004, "Wrong alignment on ModularSynthComponent_SetModEnvDecayTime");
static_assert(sizeof(ModularSynthComponent_SetModEnvDecayTime) == 0x000004, "Wrong size on ModularSynthComponent_SetModEnvDecayTime");
static_assert(offsetof(ModularSynthComponent_SetModEnvDecayTime, DecayTimeMsec) == 0x000000, "Member 'ModularSynthComponent_SetModEnvDecayTime::DecayTimeMsec' has a wrong offset!");

// Function Synthesis.ModularSynthComponent.SetModEnvDepth
// 0x0004 (0x0004 - 0x0000)
struct ModularSynthComponent_SetModEnvDepth final
{
public:
	float                                         Depth;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularSynthComponent_SetModEnvDepth) == 0x000004, "Wrong alignment on ModularSynthComponent_SetModEnvDepth");
static_assert(sizeof(ModularSynthComponent_SetModEnvDepth) == 0x000004, "Wrong size on ModularSynthComponent_SetModEnvDepth");
static_assert(offsetof(ModularSynthComponent_SetModEnvDepth, Depth) == 0x000000, "Member 'ModularSynthComponent_SetModEnvDepth::Depth' has a wrong offset!");

// Function Synthesis.ModularSynthComponent.SetModEnvInvert
// 0x0001 (0x0001 - 0x0000)
struct ModularSynthComponent_SetModEnvInvert final
{
public:
	bool                                          bInvert;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularSynthComponent_SetModEnvInvert) == 0x000001, "Wrong alignment on ModularSynthComponent_SetModEnvInvert");
static_assert(sizeof(ModularSynthComponent_SetModEnvInvert) == 0x000001, "Wrong size on ModularSynthComponent_SetModEnvInvert");
static_assert(offsetof(ModularSynthComponent_SetModEnvInvert, bInvert) == 0x000000, "Member 'ModularSynthComponent_SetModEnvInvert::bInvert' has a wrong offset!");

// Function Synthesis.ModularSynthComponent.SetModEnvPatch
// 0x0001 (0x0001 - 0x0000)
struct ModularSynthComponent_SetModEnvPatch final
{
public:
	ESynthModEnvPatch                             InPatchType;                                       // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularSynthComponent_SetModEnvPatch) == 0x000001, "Wrong alignment on ModularSynthComponent_SetModEnvPatch");
static_assert(sizeof(ModularSynthComponent_SetModEnvPatch) == 0x000001, "Wrong size on ModularSynthComponent_SetModEnvPatch");
static_assert(offsetof(ModularSynthComponent_SetModEnvPatch, InPatchType) == 0x000000, "Member 'ModularSynthComponent_SetModEnvPatch::InPatchType' has a wrong offset!");

// Function Synthesis.ModularSynthComponent.SetModEnvReleaseTime
// 0x0004 (0x0004 - 0x0000)
struct ModularSynthComponent_SetModEnvReleaseTime final
{
public:
	float                                         Release;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularSynthComponent_SetModEnvReleaseTime) == 0x000004, "Wrong alignment on ModularSynthComponent_SetModEnvReleaseTime");
static_assert(sizeof(ModularSynthComponent_SetModEnvReleaseTime) == 0x000004, "Wrong size on ModularSynthComponent_SetModEnvReleaseTime");
static_assert(offsetof(ModularSynthComponent_SetModEnvReleaseTime, Release) == 0x000000, "Member 'ModularSynthComponent_SetModEnvReleaseTime::Release' has a wrong offset!");

// Function Synthesis.ModularSynthComponent.SetModEnvSustainGain
// 0x0004 (0x0004 - 0x0000)
struct ModularSynthComponent_SetModEnvSustainGain final
{
public:
	float                                         SustainGain;                                       // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularSynthComponent_SetModEnvSustainGain) == 0x000004, "Wrong alignment on ModularSynthComponent_SetModEnvSustainGain");
static_assert(sizeof(ModularSynthComponent_SetModEnvSustainGain) == 0x000004, "Wrong size on ModularSynthComponent_SetModEnvSustainGain");
static_assert(offsetof(ModularSynthComponent_SetModEnvSustainGain, SustainGain) == 0x000000, "Member 'ModularSynthComponent_SetModEnvSustainGain::SustainGain' has a wrong offset!");

// Function Synthesis.ModularSynthComponent.SetOscCents
// 0x0008 (0x0008 - 0x0000)
struct ModularSynthComponent_SetOscCents final
{
public:
	int32                                         OscIndex;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Cents;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularSynthComponent_SetOscCents) == 0x000004, "Wrong alignment on ModularSynthComponent_SetOscCents");
static_assert(sizeof(ModularSynthComponent_SetOscCents) == 0x000008, "Wrong size on ModularSynthComponent_SetOscCents");
static_assert(offsetof(ModularSynthComponent_SetOscCents, OscIndex) == 0x000000, "Member 'ModularSynthComponent_SetOscCents::OscIndex' has a wrong offset!");
static_assert(offsetof(ModularSynthComponent_SetOscCents, Cents) == 0x000004, "Member 'ModularSynthComponent_SetOscCents::Cents' has a wrong offset!");

// Function Synthesis.ModularSynthComponent.SetOscFrequencyMod
// 0x0008 (0x0008 - 0x0000)
struct ModularSynthComponent_SetOscFrequencyMod final
{
public:
	int32                                         OscIndex;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OscFreqMod;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularSynthComponent_SetOscFrequencyMod) == 0x000004, "Wrong alignment on ModularSynthComponent_SetOscFrequencyMod");
static_assert(sizeof(ModularSynthComponent_SetOscFrequencyMod) == 0x000008, "Wrong size on ModularSynthComponent_SetOscFrequencyMod");
static_assert(offsetof(ModularSynthComponent_SetOscFrequencyMod, OscIndex) == 0x000000, "Member 'ModularSynthComponent_SetOscFrequencyMod::OscIndex' has a wrong offset!");
static_assert(offsetof(ModularSynthComponent_SetOscFrequencyMod, OscFreqMod) == 0x000004, "Member 'ModularSynthComponent_SetOscFrequencyMod::OscFreqMod' has a wrong offset!");

// Function Synthesis.ModularSynthComponent.SetOscGain
// 0x0008 (0x0008 - 0x0000)
struct ModularSynthComponent_SetOscGain final
{
public:
	int32                                         OscIndex;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OscGain;                                           // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularSynthComponent_SetOscGain) == 0x000004, "Wrong alignment on ModularSynthComponent_SetOscGain");
static_assert(sizeof(ModularSynthComponent_SetOscGain) == 0x000008, "Wrong size on ModularSynthComponent_SetOscGain");
static_assert(offsetof(ModularSynthComponent_SetOscGain, OscIndex) == 0x000000, "Member 'ModularSynthComponent_SetOscGain::OscIndex' has a wrong offset!");
static_assert(offsetof(ModularSynthComponent_SetOscGain, OscGain) == 0x000004, "Member 'ModularSynthComponent_SetOscGain::OscGain' has a wrong offset!");

// Function Synthesis.ModularSynthComponent.SetOscGainMod
// 0x0008 (0x0008 - 0x0000)
struct ModularSynthComponent_SetOscGainMod final
{
public:
	int32                                         OscIndex;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OscGainMod;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularSynthComponent_SetOscGainMod) == 0x000004, "Wrong alignment on ModularSynthComponent_SetOscGainMod");
static_assert(sizeof(ModularSynthComponent_SetOscGainMod) == 0x000008, "Wrong size on ModularSynthComponent_SetOscGainMod");
static_assert(offsetof(ModularSynthComponent_SetOscGainMod, OscIndex) == 0x000000, "Member 'ModularSynthComponent_SetOscGainMod::OscIndex' has a wrong offset!");
static_assert(offsetof(ModularSynthComponent_SetOscGainMod, OscGainMod) == 0x000004, "Member 'ModularSynthComponent_SetOscGainMod::OscGainMod' has a wrong offset!");

// Function Synthesis.ModularSynthComponent.SetOscOctave
// 0x0008 (0x0008 - 0x0000)
struct ModularSynthComponent_SetOscOctave final
{
public:
	int32                                         OscIndex;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Octave;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularSynthComponent_SetOscOctave) == 0x000004, "Wrong alignment on ModularSynthComponent_SetOscOctave");
static_assert(sizeof(ModularSynthComponent_SetOscOctave) == 0x000008, "Wrong size on ModularSynthComponent_SetOscOctave");
static_assert(offsetof(ModularSynthComponent_SetOscOctave, OscIndex) == 0x000000, "Member 'ModularSynthComponent_SetOscOctave::OscIndex' has a wrong offset!");
static_assert(offsetof(ModularSynthComponent_SetOscOctave, Octave) == 0x000004, "Member 'ModularSynthComponent_SetOscOctave::Octave' has a wrong offset!");

// Function Synthesis.ModularSynthComponent.SetOscPulsewidth
// 0x0008 (0x0008 - 0x0000)
struct ModularSynthComponent_SetOscPulsewidth final
{
public:
	int32                                         OscIndex;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Pulsewidth;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularSynthComponent_SetOscPulsewidth) == 0x000004, "Wrong alignment on ModularSynthComponent_SetOscPulsewidth");
static_assert(sizeof(ModularSynthComponent_SetOscPulsewidth) == 0x000008, "Wrong size on ModularSynthComponent_SetOscPulsewidth");
static_assert(offsetof(ModularSynthComponent_SetOscPulsewidth, OscIndex) == 0x000000, "Member 'ModularSynthComponent_SetOscPulsewidth::OscIndex' has a wrong offset!");
static_assert(offsetof(ModularSynthComponent_SetOscPulsewidth, Pulsewidth) == 0x000004, "Member 'ModularSynthComponent_SetOscPulsewidth::Pulsewidth' has a wrong offset!");

// Function Synthesis.ModularSynthComponent.SetOscSemitones
// 0x0008 (0x0008 - 0x0000)
struct ModularSynthComponent_SetOscSemitones final
{
public:
	int32                                         OscIndex;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Semitones;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularSynthComponent_SetOscSemitones) == 0x000004, "Wrong alignment on ModularSynthComponent_SetOscSemitones");
static_assert(sizeof(ModularSynthComponent_SetOscSemitones) == 0x000008, "Wrong size on ModularSynthComponent_SetOscSemitones");
static_assert(offsetof(ModularSynthComponent_SetOscSemitones, OscIndex) == 0x000000, "Member 'ModularSynthComponent_SetOscSemitones::OscIndex' has a wrong offset!");
static_assert(offsetof(ModularSynthComponent_SetOscSemitones, Semitones) == 0x000004, "Member 'ModularSynthComponent_SetOscSemitones::Semitones' has a wrong offset!");

// Function Synthesis.ModularSynthComponent.SetOscSync
// 0x0001 (0x0001 - 0x0000)
struct ModularSynthComponent_SetOscSync final
{
public:
	bool                                          bIsSynced;                                         // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularSynthComponent_SetOscSync) == 0x000001, "Wrong alignment on ModularSynthComponent_SetOscSync");
static_assert(sizeof(ModularSynthComponent_SetOscSync) == 0x000001, "Wrong size on ModularSynthComponent_SetOscSync");
static_assert(offsetof(ModularSynthComponent_SetOscSync, bIsSynced) == 0x000000, "Member 'ModularSynthComponent_SetOscSync::bIsSynced' has a wrong offset!");

// Function Synthesis.ModularSynthComponent.SetOscType
// 0x0008 (0x0008 - 0x0000)
struct ModularSynthComponent_SetOscType final
{
public:
	int32                                         OscIndex;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESynth1OscType                                OscType;                                           // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ModularSynthComponent_SetOscType) == 0x000004, "Wrong alignment on ModularSynthComponent_SetOscType");
static_assert(sizeof(ModularSynthComponent_SetOscType) == 0x000008, "Wrong size on ModularSynthComponent_SetOscType");
static_assert(offsetof(ModularSynthComponent_SetOscType, OscIndex) == 0x000000, "Member 'ModularSynthComponent_SetOscType::OscIndex' has a wrong offset!");
static_assert(offsetof(ModularSynthComponent_SetOscType, OscType) == 0x000004, "Member 'ModularSynthComponent_SetOscType::OscType' has a wrong offset!");

// Function Synthesis.ModularSynthComponent.SetPan
// 0x0004 (0x0004 - 0x0000)
struct ModularSynthComponent_SetPan final
{
public:
	float                                         Pan;                                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularSynthComponent_SetPan) == 0x000004, "Wrong alignment on ModularSynthComponent_SetPan");
static_assert(sizeof(ModularSynthComponent_SetPan) == 0x000004, "Wrong size on ModularSynthComponent_SetPan");
static_assert(offsetof(ModularSynthComponent_SetPan, Pan) == 0x000000, "Member 'ModularSynthComponent_SetPan::Pan' has a wrong offset!");

// Function Synthesis.ModularSynthComponent.SetPitchBend
// 0x0004 (0x0004 - 0x0000)
struct ModularSynthComponent_SetPitchBend final
{
public:
	float                                         PitchBend;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularSynthComponent_SetPitchBend) == 0x000004, "Wrong alignment on ModularSynthComponent_SetPitchBend");
static_assert(sizeof(ModularSynthComponent_SetPitchBend) == 0x000004, "Wrong size on ModularSynthComponent_SetPitchBend");
static_assert(offsetof(ModularSynthComponent_SetPitchBend, PitchBend) == 0x000000, "Member 'ModularSynthComponent_SetPitchBend::PitchBend' has a wrong offset!");

// Function Synthesis.ModularSynthComponent.SetPortamento
// 0x0004 (0x0004 - 0x0000)
struct ModularSynthComponent_SetPortamento final
{
public:
	float                                         Portamento;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularSynthComponent_SetPortamento) == 0x000004, "Wrong alignment on ModularSynthComponent_SetPortamento");
static_assert(sizeof(ModularSynthComponent_SetPortamento) == 0x000004, "Wrong size on ModularSynthComponent_SetPortamento");
static_assert(offsetof(ModularSynthComponent_SetPortamento, Portamento) == 0x000000, "Member 'ModularSynthComponent_SetPortamento::Portamento' has a wrong offset!");

// Function Synthesis.ModularSynthComponent.SetReleaseTime
// 0x0004 (0x0004 - 0x0000)
struct ModularSynthComponent_SetReleaseTime final
{
public:
	float                                         ReleaseTimeMsec;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularSynthComponent_SetReleaseTime) == 0x000004, "Wrong alignment on ModularSynthComponent_SetReleaseTime");
static_assert(sizeof(ModularSynthComponent_SetReleaseTime) == 0x000004, "Wrong size on ModularSynthComponent_SetReleaseTime");
static_assert(offsetof(ModularSynthComponent_SetReleaseTime, ReleaseTimeMsec) == 0x000000, "Member 'ModularSynthComponent_SetReleaseTime::ReleaseTimeMsec' has a wrong offset!");

// Function Synthesis.ModularSynthComponent.SetSpread
// 0x0004 (0x0004 - 0x0000)
struct ModularSynthComponent_SetSpread final
{
public:
	float                                         Spread;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularSynthComponent_SetSpread) == 0x000004, "Wrong alignment on ModularSynthComponent_SetSpread");
static_assert(sizeof(ModularSynthComponent_SetSpread) == 0x000004, "Wrong size on ModularSynthComponent_SetSpread");
static_assert(offsetof(ModularSynthComponent_SetSpread, Spread) == 0x000000, "Member 'ModularSynthComponent_SetSpread::Spread' has a wrong offset!");

// Function Synthesis.ModularSynthComponent.SetStereoDelayFeedback
// 0x0004 (0x0004 - 0x0000)
struct ModularSynthComponent_SetStereoDelayFeedback final
{
public:
	float                                         DelayFeedback;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularSynthComponent_SetStereoDelayFeedback) == 0x000004, "Wrong alignment on ModularSynthComponent_SetStereoDelayFeedback");
static_assert(sizeof(ModularSynthComponent_SetStereoDelayFeedback) == 0x000004, "Wrong size on ModularSynthComponent_SetStereoDelayFeedback");
static_assert(offsetof(ModularSynthComponent_SetStereoDelayFeedback, DelayFeedback) == 0x000000, "Member 'ModularSynthComponent_SetStereoDelayFeedback::DelayFeedback' has a wrong offset!");

// Function Synthesis.ModularSynthComponent.SetStereoDelayIsEnabled
// 0x0001 (0x0001 - 0x0000)
struct ModularSynthComponent_SetStereoDelayIsEnabled final
{
public:
	bool                                          StereoDelayEnabled;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularSynthComponent_SetStereoDelayIsEnabled) == 0x000001, "Wrong alignment on ModularSynthComponent_SetStereoDelayIsEnabled");
static_assert(sizeof(ModularSynthComponent_SetStereoDelayIsEnabled) == 0x000001, "Wrong size on ModularSynthComponent_SetStereoDelayIsEnabled");
static_assert(offsetof(ModularSynthComponent_SetStereoDelayIsEnabled, StereoDelayEnabled) == 0x000000, "Member 'ModularSynthComponent_SetStereoDelayIsEnabled::StereoDelayEnabled' has a wrong offset!");

// Function Synthesis.ModularSynthComponent.SetStereoDelayMode
// 0x0001 (0x0001 - 0x0000)
struct ModularSynthComponent_SetStereoDelayMode final
{
public:
	ESynthStereoDelayMode                         StereoDelayMode;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularSynthComponent_SetStereoDelayMode) == 0x000001, "Wrong alignment on ModularSynthComponent_SetStereoDelayMode");
static_assert(sizeof(ModularSynthComponent_SetStereoDelayMode) == 0x000001, "Wrong size on ModularSynthComponent_SetStereoDelayMode");
static_assert(offsetof(ModularSynthComponent_SetStereoDelayMode, StereoDelayMode) == 0x000000, "Member 'ModularSynthComponent_SetStereoDelayMode::StereoDelayMode' has a wrong offset!");

// Function Synthesis.ModularSynthComponent.SetStereoDelayRatio
// 0x0004 (0x0004 - 0x0000)
struct ModularSynthComponent_SetStereoDelayRatio final
{
public:
	float                                         DelayRatio;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularSynthComponent_SetStereoDelayRatio) == 0x000004, "Wrong alignment on ModularSynthComponent_SetStereoDelayRatio");
static_assert(sizeof(ModularSynthComponent_SetStereoDelayRatio) == 0x000004, "Wrong size on ModularSynthComponent_SetStereoDelayRatio");
static_assert(offsetof(ModularSynthComponent_SetStereoDelayRatio, DelayRatio) == 0x000000, "Member 'ModularSynthComponent_SetStereoDelayRatio::DelayRatio' has a wrong offset!");

// Function Synthesis.ModularSynthComponent.SetStereoDelayTime
// 0x0004 (0x0004 - 0x0000)
struct ModularSynthComponent_SetStereoDelayTime final
{
public:
