#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TeamMemberManage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TeamMemberManage.TeamMemberManage_C
// 0x0050 (0x0400 - 0x03B0)
class UTeamMemberManage_C final : public UFortTeamMemberManage
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_LocalPlayerBannerEditor_C*          BP_LocalPlayerBannerEditor;                        // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPanelButton_C*                         CloseButton;                                       // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      CloseProfileButton;                                // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  ContentSwitcher;                                   // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_8;                                           // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULightbox_C*                            Lightbox;                                          // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlayCloseButton;                                // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               TeamMemberManageOptions;                           // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TeamMemberManage(int32 EntryPoint);
	void OpenBannerEditor();
	void BndEvt__ContentSwitcher_K2Node_ComponentBoundEvent_2_OnActiveWidgetChanged__DelegateSignature(class UWidget* ActiveWidget, int32 ActiveWidgetIndex);
	void OnDeactivated();
	void BndEvt__BP_LocalPlayerBannerEditor_K2Node_ComponentBoundEvent_1_CloseBannerEditor__DelegateSignature(class FName IconId, class FName ColorId);
	void OnActivated();
	void OnParticipationChanged(bool bIsParticipating);
	void BndEvt__CloseProfileButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TeamMemberManage_C">();
	}
	static class UTeamMemberManage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTeamMemberManage_C>();
	}
};
static_assert(alignof(UTeamMemberManage_C) == 0x000008, "Wrong alignment on UTeamMemberManage_C");
static_assert(sizeof(UTeamMemberManage_C) == 0x000400, "Wrong size on UTeamMemberManage_C");
static_assert(offsetof(UTeamMemberManage_C, UberGraphFrame) == 0x0003B0, "Member 'UTeamMemberManage_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTeamMemberManage_C, BP_LocalPlayerBannerEditor) == 0x0003B8, "Member 'UTeamMemberManage_C::BP_LocalPlayerBannerEditor' has a wrong offset!");
static_assert(offsetof(UTeamMemberManage_C, CloseButton) == 0x0003C0, "Member 'UTeamMemberManage_C::CloseButton' has a wrong offset!");
static_assert(offsetof(UTeamMemberManage_C, CloseProfileButton) == 0x0003C8, "Member 'UTeamMemberManage_C::CloseProfileButton' has a wrong offset!");
static_assert(offsetof(UTeamMemberManage_C, ContentSwitcher) == 0x0003D0, "Member 'UTeamMemberManage_C::ContentSwitcher' has a wrong offset!");
static_assert(offsetof(UTeamMemberManage_C, Image_0) == 0x0003D8, "Member 'UTeamMemberManage_C::Image_0' has a wrong offset!");
static_assert(offsetof(UTeamMemberManage_C, Image_8) == 0x0003E0, "Member 'UTeamMemberManage_C::Image_8' has a wrong offset!");
static_assert(offsetof(UTeamMemberManage_C, Lightbox) == 0x0003E8, "Member 'UTeamMemberManage_C::Lightbox' has a wrong offset!");
static_assert(offsetof(UTeamMemberManage_C, OverlayCloseButton) == 0x0003F0, "Member 'UTeamMemberManage_C::OverlayCloseButton' has a wrong offset!");
static_assert(offsetof(UTeamMemberManage_C, TeamMemberManageOptions) == 0x0003F8, "Member 'UTeamMemberManage_C::TeamMemberManageOptions' has a wrong offset!");

}

