#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TeamMemberListEntry

#include "Basic.hpp"


namespace SDK::Params
{

// Function TeamMemberListEntry.TeamMemberListEntry_C.ExecuteUbergraph_TeamMemberListEntry
// 0x0038 (0x0038 - 0x0000)
struct TeamMemberListEntry_C_ExecuteUbergraph_TeamMemberListEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsOpen;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TeamMemberListEntry_C_ExecuteUbergraph_TeamMemberListEntry) == 0x000008, "Wrong alignment on TeamMemberListEntry_C_ExecuteUbergraph_TeamMemberListEntry");
static_assert(sizeof(TeamMemberListEntry_C_ExecuteUbergraph_TeamMemberListEntry) == 0x000038, "Wrong size on TeamMemberListEntry_C_ExecuteUbergraph_TeamMemberListEntry");
static_assert(offsetof(TeamMemberListEntry_C_ExecuteUbergraph_TeamMemberListEntry, EntryPoint) == 0x000000, "Member 'TeamMemberListEntry_C_ExecuteUbergraph_TeamMemberListEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(TeamMemberListEntry_C_ExecuteUbergraph_TeamMemberListEntry, K2Node_ComponentBoundEvent_bIsOpen) == 0x000004, "Member 'TeamMemberListEntry_C_ExecuteUbergraph_TeamMemberListEntry::K2Node_ComponentBoundEvent_bIsOpen' has a wrong offset!");
static_assert(offsetof(TeamMemberListEntry_C_ExecuteUbergraph_TeamMemberListEntry, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'TeamMemberListEntry_C_ExecuteUbergraph_TeamMemberListEntry::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberListEntry_C_ExecuteUbergraph_TeamMemberListEntry, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'TeamMemberListEntry_C_ExecuteUbergraph_TeamMemberListEntry::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TeamMemberListEntry_C_ExecuteUbergraph_TeamMemberListEntry, CallFunc_GetUINavigationManager_ReturnValue) == 0x000018, "Member 'TeamMemberListEntry_C_ExecuteUbergraph_TeamMemberListEntry::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberListEntry_C_ExecuteUbergraph_TeamMemberListEntry, CallFunc_PlayAnimation_ReturnValue_2) == 0x000020, "Member 'TeamMemberListEntry_C_ExecuteUbergraph_TeamMemberListEntry::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TeamMemberListEntry_C_ExecuteUbergraph_TeamMemberListEntry, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000028, "Member 'TeamMemberListEntry_C_ExecuteUbergraph_TeamMemberListEntry::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberListEntry_C_ExecuteUbergraph_TeamMemberListEntry, CallFunc_PlayAnimation_ReturnValue_3) == 0x000030, "Member 'TeamMemberListEntry_C_ExecuteUbergraph_TeamMemberListEntry::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");

// Function TeamMemberListEntry.TeamMemberListEntry_C.BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct TeamMemberListEntry_C_BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature final
{
public:
	bool                                          bIsOpen;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TeamMemberListEntry_C_BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature) == 0x000001, "Wrong alignment on TeamMemberListEntry_C_BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature");
static_assert(sizeof(TeamMemberListEntry_C_BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature) == 0x000001, "Wrong size on TeamMemberListEntry_C_BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature");
static_assert(offsetof(TeamMemberListEntry_C_BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature, bIsOpen) == 0x000000, "Member 'TeamMemberListEntry_C_BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature::bIsOpen' has a wrong offset!");

}

