#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TooltipMinusBasicMultiLineMinusS

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "TooltipStat_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function Tooltip-BasicMultiLine-S.Tooltip-BasicMultiLine-S_C.ExecuteUbergraph_Tooltip-BasicMultiLine-S
// 0x0024 (0x0024 - 0x0000)
struct TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_9;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x1];                                       // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS) == 0x000004, "Wrong alignment on TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS");
static_assert(sizeof(TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS) == 0x000024, "Wrong size on TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS");
static_assert(offsetof(TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS, EntryPoint) == 0x000000, "Member 'TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS::EntryPoint' has a wrong offset!");
static_assert(offsetof(TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS, Temp_bool_Variable) == 0x000004, "Member 'TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS, Temp_byte_Variable) == 0x000005, "Member 'TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS, Temp_byte_Variable_1) == 0x000006, "Member 'TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS, Temp_bool_Variable_1) == 0x000007, "Member 'TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS, Temp_byte_Variable_2) == 0x000008, "Member 'TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS, Temp_byte_Variable_3) == 0x000009, "Member 'TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS, Temp_bool_Variable_2) == 0x00000A, "Member 'TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS, Temp_byte_Variable_4) == 0x00000B, "Member 'TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS, Temp_byte_Variable_5) == 0x00000C, "Member 'TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS, Temp_bool_Variable_3) == 0x00000D, "Member 'TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS, Temp_byte_Variable_6) == 0x00000E, "Member 'TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS, Temp_byte_Variable_7) == 0x00000F, "Member 'TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS, Temp_bool_Variable_4) == 0x000010, "Member 'TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS, Temp_byte_Variable_8) == 0x000011, "Member 'TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS, Temp_byte_Variable_9) == 0x000012, "Member 'TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS, CallFunc_TextIsEmpty_ReturnValue) == 0x000018, "Member 'TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS, CallFunc_Greater_IntInt_ReturnValue) == 0x000019, "Member 'TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS, CallFunc_Not_PreBool_ReturnValue) == 0x00001A, "Member 'TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS, K2Node_Select_Default) == 0x00001B, "Member 'TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS, K2Node_Select_Default_1) == 0x00001C, "Member 'TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS, CallFunc_IsValid_ReturnValue) == 0x00001D, "Member 'TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS, CallFunc_BooleanOR_ReturnValue) == 0x00001E, "Member 'TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS, K2Node_Select_Default_2) == 0x00001F, "Member 'TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS, CallFunc_BooleanOR_ReturnValue_1) == 0x000020, "Member 'TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS, K2Node_Select_Default_3) == 0x000021, "Member 'TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS, K2Node_Select_Default_4) == 0x000022, "Member 'TooltipMinusBasicMultiLineMinusS_C_ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS::K2Node_Select_Default_4' has a wrong offset!");

// Function Tooltip-BasicMultiLine-S.Tooltip-BasicMultiLine-S_C.Get Body Text
// 0x0098 (0x0098 - 0x0000)
struct TooltipMinusBasicMultiLineMinusS_C_Get_Body_Text final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x000C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTooltipStatWidget_C*                   CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Array_Get_Item;                           // 0x0030(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTooltipStat                           K2Node_MakeStruct_TooltipStat;                     // 0x0050(0x0038)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TooltipMinusBasicMultiLineMinusS_C_Get_Body_Text) == 0x000008, "Wrong alignment on TooltipMinusBasicMultiLineMinusS_C_Get_Body_Text");
static_assert(sizeof(TooltipMinusBasicMultiLineMinusS_C_Get_Body_Text) == 0x000098, "Wrong size on TooltipMinusBasicMultiLineMinusS_C_Get_Body_Text");
static_assert(offsetof(TooltipMinusBasicMultiLineMinusS_C_Get_Body_Text, Temp_int_Array_Index_Variable) == 0x000000, "Member 'TooltipMinusBasicMultiLineMinusS_C_Get_Body_Text::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(TooltipMinusBasicMultiLineMinusS_C_Get_Body_Text, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'TooltipMinusBasicMultiLineMinusS_C_Get_Body_Text::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(TooltipMinusBasicMultiLineMinusS_C_Get_Body_Text, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'TooltipMinusBasicMultiLineMinusS_C_Get_Body_Text::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TooltipMinusBasicMultiLineMinusS_C_Get_Body_Text, K2Node_MakeStruct_Margin) == 0x00000C, "Member 'TooltipMinusBasicMultiLineMinusS_C_Get_Body_Text::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(TooltipMinusBasicMultiLineMinusS_C_Get_Body_Text, CallFunc_GetOwningPlayer_ReturnValue) == 0x000020, "Member 'TooltipMinusBasicMultiLineMinusS_C_Get_Body_Text::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(TooltipMinusBasicMultiLineMinusS_C_Get_Body_Text, CallFunc_Create_ReturnValue) == 0x000028, "Member 'TooltipMinusBasicMultiLineMinusS_C_Get_Body_Text::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(TooltipMinusBasicMultiLineMinusS_C_Get_Body_Text, CallFunc_Array_Get_Item) == 0x000030, "Member 'TooltipMinusBasicMultiLineMinusS_C_Get_Body_Text::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TooltipMinusBasicMultiLineMinusS_C_Get_Body_Text, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'TooltipMinusBasicMultiLineMinusS_C_Get_Body_Text::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TooltipMinusBasicMultiLineMinusS_C_Get_Body_Text, K2Node_MakeStruct_TooltipStat) == 0x000050, "Member 'TooltipMinusBasicMultiLineMinusS_C_Get_Body_Text::K2Node_MakeStruct_TooltipStat' has a wrong offset!");
static_assert(offsetof(TooltipMinusBasicMultiLineMinusS_C_Get_Body_Text, CallFunc_Less_IntInt_ReturnValue) == 0x000088, "Member 'TooltipMinusBasicMultiLineMinusS_C_Get_Body_Text::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TooltipMinusBasicMultiLineMinusS_C_Get_Body_Text, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000090, "Member 'TooltipMinusBasicMultiLineMinusS_C_Get_Body_Text::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");

// Function Tooltip-BasicMultiLine-S.Tooltip-BasicMultiLine-S_C.Get Header Text
// 0x0018 (0x0018 - 0x0000)
struct TooltipMinusBasicMultiLineMinusS_C_Get_Header_Text final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(TooltipMinusBasicMultiLineMinusS_C_Get_Header_Text) == 0x000008, "Wrong alignment on TooltipMinusBasicMultiLineMinusS_C_Get_Header_Text");
static_assert(sizeof(TooltipMinusBasicMultiLineMinusS_C_Get_Header_Text) == 0x000018, "Wrong size on TooltipMinusBasicMultiLineMinusS_C_Get_Header_Text");
static_assert(offsetof(TooltipMinusBasicMultiLineMinusS_C_Get_Header_Text, ReturnValue) == 0x000000, "Member 'TooltipMinusBasicMultiLineMinusS_C_Get_Header_Text::ReturnValue' has a wrong offset!");

// Function Tooltip-BasicMultiLine-S.Tooltip-BasicMultiLine-S_C.Get Icon Brush
// 0x0110 (0x0110 - 0x0000)
struct TooltipMinusBasicMultiLineMinusS_C_Get_Icon_Brush final
{
public:
	struct FSlateBrush                            ReturnValue;                                       // 0x0000(0x0088)(Parm, OutParm, ReturnParm)
	struct FSlateBrush                            CallFunc_MakeBrushFromAsset_ReturnValue;           // 0x0088(0x0088)()
};
static_assert(alignof(TooltipMinusBasicMultiLineMinusS_C_Get_Icon_Brush) == 0x000008, "Wrong alignment on TooltipMinusBasicMultiLineMinusS_C_Get_Icon_Brush");
static_assert(sizeof(TooltipMinusBasicMultiLineMinusS_C_Get_Icon_Brush) == 0x000110, "Wrong size on TooltipMinusBasicMultiLineMinusS_C_Get_Icon_Brush");
static_assert(offsetof(TooltipMinusBasicMultiLineMinusS_C_Get_Icon_Brush, ReturnValue) == 0x000000, "Member 'TooltipMinusBasicMultiLineMinusS_C_Get_Icon_Brush::ReturnValue' has a wrong offset!");
static_assert(offsetof(TooltipMinusBasicMultiLineMinusS_C_Get_Icon_Brush, CallFunc_MakeBrushFromAsset_ReturnValue) == 0x000088, "Member 'TooltipMinusBasicMultiLineMinusS_C_Get_Icon_Brush::CallFunc_MakeBrushFromAsset_ReturnValue' has a wrong offset!");

}

