#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TooltipStatWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function TooltipStatWidget.TooltipStatWidget_C.ExecuteUbergraph_TooltipStatWidget
// 0x0004 (0x0004 - 0x0000)
struct TooltipStatWidget_C_ExecuteUbergraph_TooltipStatWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TooltipStatWidget_C_ExecuteUbergraph_TooltipStatWidget) == 0x000004, "Wrong alignment on TooltipStatWidget_C_ExecuteUbergraph_TooltipStatWidget");
static_assert(sizeof(TooltipStatWidget_C_ExecuteUbergraph_TooltipStatWidget) == 0x000004, "Wrong size on TooltipStatWidget_C_ExecuteUbergraph_TooltipStatWidget");
static_assert(offsetof(TooltipStatWidget_C_ExecuteUbergraph_TooltipStatWidget, EntryPoint) == 0x000000, "Member 'TooltipStatWidget_C_ExecuteUbergraph_TooltipStatWidget::EntryPoint' has a wrong offset!");

// Function TooltipStatWidget.TooltipStatWidget_C.Init
// 0x0138 (0x0138 - 0x0000)
struct TooltipStatWidget_C_Init final
{
public:
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0000(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0028(0x0028)()
	struct FLinearColor                           CallFunc_Get_Theme_Color_Theme_Color;              // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Get_Buff_Color_Color;                     // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0070(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x0098(0x0028)()
	struct FLinearColor                           CallFunc_Get_Debuff_Color_Color;                   // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Get_Theme_Color_Theme_Color_1;            // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_4;                    // 0x00E0(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_5;                    // 0x0108(0x0028)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TooltipStatWidget_C_Init) == 0x000008, "Wrong alignment on TooltipStatWidget_C_Init");
static_assert(sizeof(TooltipStatWidget_C_Init) == 0x000138, "Wrong size on TooltipStatWidget_C_Init");
static_assert(offsetof(TooltipStatWidget_C_Init, K2Node_MakeStruct_SlateColor) == 0x000000, "Member 'TooltipStatWidget_C_Init::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(TooltipStatWidget_C_Init, K2Node_MakeStruct_SlateColor_1) == 0x000028, "Member 'TooltipStatWidget_C_Init::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(TooltipStatWidget_C_Init, CallFunc_Get_Theme_Color_Theme_Color) == 0x000050, "Member 'TooltipStatWidget_C_Init::CallFunc_Get_Theme_Color_Theme_Color' has a wrong offset!");
static_assert(offsetof(TooltipStatWidget_C_Init, CallFunc_Get_Buff_Color_Color) == 0x000060, "Member 'TooltipStatWidget_C_Init::CallFunc_Get_Buff_Color_Color' has a wrong offset!");
static_assert(offsetof(TooltipStatWidget_C_Init, K2Node_MakeStruct_SlateColor_2) == 0x000070, "Member 'TooltipStatWidget_C_Init::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(TooltipStatWidget_C_Init, K2Node_MakeStruct_SlateColor_3) == 0x000098, "Member 'TooltipStatWidget_C_Init::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(TooltipStatWidget_C_Init, CallFunc_Get_Debuff_Color_Color) == 0x0000C0, "Member 'TooltipStatWidget_C_Init::CallFunc_Get_Debuff_Color_Color' has a wrong offset!");
static_assert(offsetof(TooltipStatWidget_C_Init, CallFunc_Get_Theme_Color_Theme_Color_1) == 0x0000D0, "Member 'TooltipStatWidget_C_Init::CallFunc_Get_Theme_Color_Theme_Color_1' has a wrong offset!");
static_assert(offsetof(TooltipStatWidget_C_Init, K2Node_MakeStruct_SlateColor_4) == 0x0000E0, "Member 'TooltipStatWidget_C_Init::K2Node_MakeStruct_SlateColor_4' has a wrong offset!");
static_assert(offsetof(TooltipStatWidget_C_Init, K2Node_MakeStruct_SlateColor_5) == 0x000108, "Member 'TooltipStatWidget_C_Init::K2Node_MakeStruct_SlateColor_5' has a wrong offset!");
static_assert(offsetof(TooltipStatWidget_C_Init, K2Node_SwitchEnum_CmpSuccess) == 0x000130, "Member 'TooltipStatWidget_C_Init::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

