#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Tracer_Shotgun

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Tracer_Shotgun.Tracer_Shotgun_C.ExecuteUbergraph_Tracer_Shotgun
// 0x0004 (0x0004 - 0x0000)
struct Tracer_Shotgun_C_ExecuteUbergraph_Tracer_Shotgun final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tracer_Shotgun_C_ExecuteUbergraph_Tracer_Shotgun) == 0x000004, "Wrong alignment on Tracer_Shotgun_C_ExecuteUbergraph_Tracer_Shotgun");
static_assert(sizeof(Tracer_Shotgun_C_ExecuteUbergraph_Tracer_Shotgun) == 0x000004, "Wrong size on Tracer_Shotgun_C_ExecuteUbergraph_Tracer_Shotgun");
static_assert(offsetof(Tracer_Shotgun_C_ExecuteUbergraph_Tracer_Shotgun, EntryPoint) == 0x000000, "Member 'Tracer_Shotgun_C_ExecuteUbergraph_Tracer_Shotgun::EntryPoint' has a wrong offset!");

// Function Tracer_Shotgun.Tracer_Shotgun_C.UserConstructionScript
// 0x0088 (0x0088 - 0x0000)
struct Tracer_Shotgun_C_UserConstructionScript final
{
public:
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0000(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Tracer_Shotgun_C_UserConstructionScript) == 0x000004, "Wrong alignment on Tracer_Shotgun_C_UserConstructionScript");
static_assert(sizeof(Tracer_Shotgun_C_UserConstructionScript) == 0x000088, "Wrong size on Tracer_Shotgun_C_UserConstructionScript");
static_assert(offsetof(Tracer_Shotgun_C_UserConstructionScript, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000000, "Member 'Tracer_Shotgun_C_UserConstructionScript::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");

}

