#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UserListHeaderEntry

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UserListHeaderEntry.UserListHeaderEntry_C.ExecuteUbergraph_UserListHeaderEntry
// 0x0108 (0x0108 - 0x0000)
struct UserListHeaderEntry_C_ExecuteUbergraph_UserListHeaderEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Temp_float_Variable;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default;                             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsListItemExpanded_ReturnValue;           // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_1;                           // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_2;                           // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0068(0x0050)(HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo_1;                 // 0x00B8(0x0050)(HasGetValueTypeHash)
};
static_assert(alignof(UserListHeaderEntry_C_ExecuteUbergraph_UserListHeaderEntry) == 0x000008, "Wrong alignment on UserListHeaderEntry_C_ExecuteUbergraph_UserListHeaderEntry");
static_assert(sizeof(UserListHeaderEntry_C_ExecuteUbergraph_UserListHeaderEntry) == 0x000108, "Wrong size on UserListHeaderEntry_C_ExecuteUbergraph_UserListHeaderEntry");
static_assert(offsetof(UserListHeaderEntry_C_ExecuteUbergraph_UserListHeaderEntry, EntryPoint) == 0x000000, "Member 'UserListHeaderEntry_C_ExecuteUbergraph_UserListHeaderEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(UserListHeaderEntry_C_ExecuteUbergraph_UserListHeaderEntry, Temp_bool_Variable) == 0x000004, "Member 'UserListHeaderEntry_C_ExecuteUbergraph_UserListHeaderEntry::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UserListHeaderEntry_C_ExecuteUbergraph_UserListHeaderEntry, Temp_byte_Variable) == 0x000005, "Member 'UserListHeaderEntry_C_ExecuteUbergraph_UserListHeaderEntry::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UserListHeaderEntry_C_ExecuteUbergraph_UserListHeaderEntry, Temp_byte_Variable_1) == 0x000006, "Member 'UserListHeaderEntry_C_ExecuteUbergraph_UserListHeaderEntry::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UserListHeaderEntry_C_ExecuteUbergraph_UserListHeaderEntry, Temp_bool_Variable_1) == 0x000007, "Member 'UserListHeaderEntry_C_ExecuteUbergraph_UserListHeaderEntry::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UserListHeaderEntry_C_ExecuteUbergraph_UserListHeaderEntry, Temp_float_Variable) == 0x000008, "Member 'UserListHeaderEntry_C_ExecuteUbergraph_UserListHeaderEntry::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(UserListHeaderEntry_C_ExecuteUbergraph_UserListHeaderEntry, Temp_float_Variable_1) == 0x00000C, "Member 'UserListHeaderEntry_C_ExecuteUbergraph_UserListHeaderEntry::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(UserListHeaderEntry_C_ExecuteUbergraph_UserListHeaderEntry, Temp_bool_Variable_2) == 0x000010, "Member 'UserListHeaderEntry_C_ExecuteUbergraph_UserListHeaderEntry::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(UserListHeaderEntry_C_ExecuteUbergraph_UserListHeaderEntry, Temp_int_Variable) == 0x000014, "Member 'UserListHeaderEntry_C_ExecuteUbergraph_UserListHeaderEntry::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UserListHeaderEntry_C_ExecuteUbergraph_UserListHeaderEntry, Temp_int_Variable_1) == 0x000018, "Member 'UserListHeaderEntry_C_ExecuteUbergraph_UserListHeaderEntry::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(UserListHeaderEntry_C_ExecuteUbergraph_UserListHeaderEntry, K2Node_Event_bIsExpanded) == 0x00001C, "Member 'UserListHeaderEntry_C_ExecuteUbergraph_UserListHeaderEntry::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(UserListHeaderEntry_C_ExecuteUbergraph_UserListHeaderEntry, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'UserListHeaderEntry_C_ExecuteUbergraph_UserListHeaderEntry::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UserListHeaderEntry_C_ExecuteUbergraph_UserListHeaderEntry, K2Node_Select_Default) == 0x000028, "Member 'UserListHeaderEntry_C_ExecuteUbergraph_UserListHeaderEntry::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UserListHeaderEntry_C_ExecuteUbergraph_UserListHeaderEntry, CallFunc_PlayAnimation_ReturnValue_1) == 0x000030, "Member 'UserListHeaderEntry_C_ExecuteUbergraph_UserListHeaderEntry::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UserListHeaderEntry_C_ExecuteUbergraph_UserListHeaderEntry, CallFunc_PlayAnimation_ReturnValue_2) == 0x000038, "Member 'UserListHeaderEntry_C_ExecuteUbergraph_UserListHeaderEntry::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UserListHeaderEntry_C_ExecuteUbergraph_UserListHeaderEntry, CallFunc_GetEndTime_ReturnValue) == 0x000040, "Member 'UserListHeaderEntry_C_ExecuteUbergraph_UserListHeaderEntry::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(UserListHeaderEntry_C_ExecuteUbergraph_UserListHeaderEntry, CallFunc_IsListItemExpanded_ReturnValue) == 0x000044, "Member 'UserListHeaderEntry_C_ExecuteUbergraph_UserListHeaderEntry::CallFunc_IsListItemExpanded_ReturnValue' has a wrong offset!");
static_assert(offsetof(UserListHeaderEntry_C_ExecuteUbergraph_UserListHeaderEntry, CallFunc_PlayAnimation_ReturnValue_3) == 0x000048, "Member 'UserListHeaderEntry_C_ExecuteUbergraph_UserListHeaderEntry::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UserListHeaderEntry_C_ExecuteUbergraph_UserListHeaderEntry, K2Node_Event_ListItemObject) == 0x000050, "Member 'UserListHeaderEntry_C_ExecuteUbergraph_UserListHeaderEntry::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(UserListHeaderEntry_C_ExecuteUbergraph_UserListHeaderEntry, CallFunc_IsMobileGame_ReturnValue) == 0x000058, "Member 'UserListHeaderEntry_C_ExecuteUbergraph_UserListHeaderEntry::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(UserListHeaderEntry_C_ExecuteUbergraph_UserListHeaderEntry, K2Node_Select_Default_1) == 0x00005C, "Member 'UserListHeaderEntry_C_ExecuteUbergraph_UserListHeaderEntry::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(UserListHeaderEntry_C_ExecuteUbergraph_UserListHeaderEntry, K2Node_Select_Default_2) == 0x000060, "Member 'UserListHeaderEntry_C_ExecuteUbergraph_UserListHeaderEntry::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(UserListHeaderEntry_C_ExecuteUbergraph_UserListHeaderEntry, K2Node_MakeStruct_SlateFontInfo) == 0x000068, "Member 'UserListHeaderEntry_C_ExecuteUbergraph_UserListHeaderEntry::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");
static_assert(offsetof(UserListHeaderEntry_C_ExecuteUbergraph_UserListHeaderEntry, K2Node_MakeStruct_SlateFontInfo_1) == 0x0000B8, "Member 'UserListHeaderEntry_C_ExecuteUbergraph_UserListHeaderEntry::K2Node_MakeStruct_SlateFontInfo_1' has a wrong offset!");

// Function UserListHeaderEntry.UserListHeaderEntry_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct UserListHeaderEntry_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UserListHeaderEntry_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on UserListHeaderEntry_C_OnListItemObjectSet");
static_assert(sizeof(UserListHeaderEntry_C_OnListItemObjectSet) == 0x000008, "Wrong size on UserListHeaderEntry_C_OnListItemObjectSet");
static_assert(offsetof(UserListHeaderEntry_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'UserListHeaderEntry_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function UserListHeaderEntry.UserListHeaderEntry_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct UserListHeaderEntry_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UserListHeaderEntry_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on UserListHeaderEntry_C_BP_OnItemExpansionChanged");
static_assert(sizeof(UserListHeaderEntry_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on UserListHeaderEntry_C_BP_OnItemExpansionChanged");
static_assert(offsetof(UserListHeaderEntry_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'UserListHeaderEntry_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

}

