#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VoiceChannelToggleButton

#include "Basic.hpp"


namespace SDK::Params
{

// Function VoiceChannelToggleButton.VoiceChannelToggleButton_C.ExecuteUbergraph_VoiceChannelToggleButton
// 0x0030 (0x0030 - 0x0000)
struct VoiceChannelToggleButton_C_ExecuteUbergraph_VoiceChannelToggleButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsPartyChat;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VoiceChannelToggleButton_C_ExecuteUbergraph_VoiceChannelToggleButton) == 0x000008, "Wrong alignment on VoiceChannelToggleButton_C_ExecuteUbergraph_VoiceChannelToggleButton");
static_assert(sizeof(VoiceChannelToggleButton_C_ExecuteUbergraph_VoiceChannelToggleButton) == 0x000030, "Wrong size on VoiceChannelToggleButton_C_ExecuteUbergraph_VoiceChannelToggleButton");
static_assert(offsetof(VoiceChannelToggleButton_C_ExecuteUbergraph_VoiceChannelToggleButton, EntryPoint) == 0x000000, "Member 'VoiceChannelToggleButton_C_ExecuteUbergraph_VoiceChannelToggleButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(VoiceChannelToggleButton_C_ExecuteUbergraph_VoiceChannelToggleButton, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'VoiceChannelToggleButton_C_ExecuteUbergraph_VoiceChannelToggleButton::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceChannelToggleButton_C_ExecuteUbergraph_VoiceChannelToggleButton, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'VoiceChannelToggleButton_C_ExecuteUbergraph_VoiceChannelToggleButton::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VoiceChannelToggleButton_C_ExecuteUbergraph_VoiceChannelToggleButton, K2Node_Event_bIsPartyChat) == 0x000018, "Member 'VoiceChannelToggleButton_C_ExecuteUbergraph_VoiceChannelToggleButton::K2Node_Event_bIsPartyChat' has a wrong offset!");
static_assert(offsetof(VoiceChannelToggleButton_C_ExecuteUbergraph_VoiceChannelToggleButton, CallFunc_PlayAnimation_ReturnValue_2) == 0x000020, "Member 'VoiceChannelToggleButton_C_ExecuteUbergraph_VoiceChannelToggleButton::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(VoiceChannelToggleButton_C_ExecuteUbergraph_VoiceChannelToggleButton, CallFunc_PlayAnimation_ReturnValue_3) == 0x000028, "Member 'VoiceChannelToggleButton_C_ExecuteUbergraph_VoiceChannelToggleButton::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");

// Function VoiceChannelToggleButton.VoiceChannelToggleButton_C.OnVoiceChannelSelected
// 0x0001 (0x0001 - 0x0000)
struct VoiceChannelToggleButton_C_OnVoiceChannelSelected final
{
public:
	bool                                          bIsPartyChat;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(VoiceChannelToggleButton_C_OnVoiceChannelSelected) == 0x000001, "Wrong alignment on VoiceChannelToggleButton_C_OnVoiceChannelSelected");
static_assert(sizeof(VoiceChannelToggleButton_C_OnVoiceChannelSelected) == 0x000001, "Wrong size on VoiceChannelToggleButton_C_OnVoiceChannelSelected");
static_assert(offsetof(VoiceChannelToggleButton_C_OnVoiceChannelSelected, bIsPartyChat) == 0x000000, "Member 'VoiceChannelToggleButton_C_OnVoiceChannelSelected::bIsPartyChat' has a wrong offset!");

}

