#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VoiceChannelToggleButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass VoiceChannelToggleButton.VoiceChannelToggleButton_C
// 0x0020 (0x0B68 - 0x0B48)
class UVoiceChannelToggleButton_C final : public UFortVoiceChannelToggleButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B48(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnHover;                                           // 0x0B50(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnToggle;                                          // 0x0B58(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_MicIcon;                                     // 0x0B60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_VoiceChannelToggleButton(int32 EntryPoint);
	void OnVoiceChannelSelected(bool bIsPartyChat);
	void BP_OnHovered();
	void BP_OnUnhovered();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"VoiceChannelToggleButton_C">();
	}
	static class UVoiceChannelToggleButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoiceChannelToggleButton_C>();
	}
};
static_assert(alignof(UVoiceChannelToggleButton_C) == 0x000008, "Wrong alignment on UVoiceChannelToggleButton_C");
static_assert(sizeof(UVoiceChannelToggleButton_C) == 0x000B68, "Wrong size on UVoiceChannelToggleButton_C");
static_assert(offsetof(UVoiceChannelToggleButton_C, UberGraphFrame) == 0x000B48, "Member 'UVoiceChannelToggleButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UVoiceChannelToggleButton_C, OnHover) == 0x000B50, "Member 'UVoiceChannelToggleButton_C::OnHover' has a wrong offset!");
static_assert(offsetof(UVoiceChannelToggleButton_C, OnToggle) == 0x000B58, "Member 'UVoiceChannelToggleButton_C::OnToggle' has a wrong offset!");
static_assert(offsetof(UVoiceChannelToggleButton_C, Image_MicIcon) == 0x000B60, "Member 'UVoiceChannelToggleButton_C::Image_MicIcon' has a wrong offset!");

}

