#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WindManager

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "StaticMeshMaterialArrayCombo_structs.hpp"
#include "WaterMeshAssetsToReplace_structs.hpp"
#include "FlowMapMaterials_structs.hpp"


namespace SDK::Params
{

// Function WindManager.WindManager_C.ExecuteUbergraph_WindManager
// 0x0850 (0x0850 - 0x0000)
struct WindManager_C_ExecuteUbergraph_WindManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortStaticMeshActor*>           CallFunc_GetAllActorsOfClass_OutActors;            // 0x0060(0x0010)(ZeroConstructor, ReferenceParm)
	class UParticleSystem*                        K2Node_CustomEvent_EmitterTemplate;                // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_CustomEvent_InTransform;                    // 0x0080(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_Effect_Water_Interaction_FX;    // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_Gameplay_Wind_INteraction_Effects; // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x011D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11E[0x2];                                      // 0x011E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0125(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0126(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0127(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStaticMeshMaterialArrayCombo          CallFunc_Array_Get_Item;                           // 0x0130(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_Array_Get_Item_1;                         // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_155[0x3];                                      // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWaterMeshAssetsToReplace              CallFunc_Array_Get_Item_2;                         // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWaterMeshAssetsToReplace              CallFunc_Array_Get_Item_3;                         // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x3];                                      // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakColor_R;                             // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G;                             // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B;                             // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A;                             // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_R_1;                           // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G_1;                           // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B_1;                           // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A_1;                           // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x01C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x01E4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x01EC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue_1;                        // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_2;               // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DFloat_ReturnValue;         // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x0224(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_2;                        // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_2;                        // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0234(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241[0x3];                                      // 0x0241(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0244(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0254(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x02DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFlowMapMaterials                      CallFunc_Array_Get_Item_4;                         // 0x02E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortStaticMeshActor*                   CallFunc_Array_Get_Item_5;                         // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorBounds_Origin;                    // 0x0300(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorBounds_BoxExtent;                 // 0x030C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue;                 // 0x0318(0x0010)(ZeroConstructor, ReferenceParm)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0328(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_6;               // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x033C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_7;               // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue_1;                       // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStaticMeshMaterialArrayCombo          K2Node_MakeStruct_StaticMeshMaterialArrayCombo;    // 0x0350(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0368(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_1;                       // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0384(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_2;                       // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x038C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x039C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_3;                          // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_3;                          // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_3;                          // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Calculate_Camera_Position_ReturnValue;    // 0x03B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x03C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_1;     // 0x03CC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_BreakVector_X_4;                          // 0x0454(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_4;                          // 0x0458(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_4;                          // 0x045C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_5;                          // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_5;                          // 0x0464(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_5;                          // 0x0468(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x046C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x046D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_2;         // 0x046E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_3;         // 0x046F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_4;         // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0471(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_5;         // 0x0472(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0473(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0474(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_475[0x3];                                      // 0x0475(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue_1;   // 0x0478(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x0489(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_True_if_break_was_hit_Variable_1;        // 0x048A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_48B[0x1];                                      // 0x048B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_5;                   // 0x048C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_491[0x3];                                      // 0x0491(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_5;                  // 0x0494(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UStaticMesh*                      Temp_object_Variable;                              // 0x0498(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A1[0x3];                                      // 0x04A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x04A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_6;                   // 0x04A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_6;                  // 0x04AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_6;                         // 0x04B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_6;                // 0x04B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x04B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4BA[0x2];                                      // 0x04BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x04BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               K2Node_Event_ParticleSystemComponent;              // 0x04C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortWindImpulseCylinder               K2Node_Event_WindImpulseCylinder_2;                // 0x04C8(0x0048)(ConstParm, NoDestructor)
	struct FFortWindImpulseCylinderDelta          K2Node_Event_WindImpulseCylinderDelta;             // 0x0510(0x0090)(ConstParm, NoDestructor)
	struct FFortWindImpulseCylinder               K2Node_Event_WindImpulseCylinder_1;                // 0x05A0(0x0048)(ConstParm, NoDestructor)
	struct FFortWindImpulseCylinder               K2Node_Event_WindImpulseCylinder;                  // 0x05E8(0x0048)(ConstParm, NoDestructor)
	float                                         CallFunc_GetGlobalWindIntensityAndDirection_WindIntensity; // 0x0630(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetGlobalWindIntensityAndDirection_WindDirection; // 0x0634(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakWindImpulseCylinderAdvanced_WindLocation; // 0x0640(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakWindImpulseCylinderAdvanced_WindInnerRadius; // 0x064C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakWindImpulseCylinderAdvanced_WindOuterRadius; // 0x0650(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakWindImpulseCylinderAdvanced_WindWorldDirection; // 0x0654(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakWindImpulseCylinderAdvanced_WindMagnitude; // 0x0660(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBox                                   CallFunc_BreakWindImpulseCylinderAdvanced_WindWorldBounds; // 0x0664(0x001C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakWindImpulseCylinderAdvanced_bIsWindChanging; // 0x0680(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakWindImpulseCylinderAdvanced_bIsWindChangePending; // 0x0681(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_682[0x2];                                      // 0x0682(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue;           // 0x0684(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Find_Matching_Wind_Mesh_Index_And_Write_Bool_Storm_Cyl_Mesh_Match; // 0x0690(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_691[0x3];                                      // 0x0691(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Find_Matching_Wind_Mesh_Index_And_Write_Bool_Wind_Cyl_Mesh_Array_Match_Index; // 0x0694(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetWindMatVariables_NewParam;             // 0x0698(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_699[0x3];                                      // 0x0699(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_Radius;                         // 0x069C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_ImpulseMagnitude;               // 0x06A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x06A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x06B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B4[0xC];                                      // 0x06B4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_CustomEvent_Particle_Transform;             // 0x06C0(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x06F0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x0778(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_77C[0x4];                                      // 0x077C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_InComponent;                    // 0x0780(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0788(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_NewMagnitude;                   // 0x0794(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortWindImpulseCylinder               CallFunc_MakeWindImpulseCylinder_ReturnValue;      // 0x0798(0x0048)(NoDestructor)
	struct FFortWindImpulseHandle                 CallFunc_AddWindImpulseCylinder_ReturnValue;       // 0x07E0(0x0004)(NoDestructor)
	bool                                          CallFunc_SetWindImpulseCylinderMagnitude_ReturnValue; // 0x07E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E5[0x3];                                      // 0x07E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_7;                  // 0x07E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x07EC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_7;                // 0x07F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7F5[0x3];                                      // 0x07F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_7;                 // 0x07F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_1;            // 0x07FC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_2;            // 0x0804(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_7;                   // 0x080C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_Array_Get_Item_7;                         // 0x0810(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_8;                         // 0x0818(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0820(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_821[0x7];                                      // 0x0821(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0828(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               K2Node_DynamicCast_AsMaterial_Instance_Dynamic;    // 0x0830(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0838(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_839[0x3];                                      // 0x0839(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue;   // 0x083C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0840(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WindManager_C_ExecuteUbergraph_WindManager) == 0x000010, "Wrong alignment on WindManager_C_ExecuteUbergraph_WindManager");
static_assert(sizeof(WindManager_C_ExecuteUbergraph_WindManager) == 0x000850, "Wrong size on WindManager_C_ExecuteUbergraph_WindManager");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, EntryPoint) == 0x000000, "Member 'WindManager_C_ExecuteUbergraph_WindManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, Temp_struct_Variable) == 0x000010, "Member 'WindManager_C_ExecuteUbergraph_WindManager::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_AddComponent_ReturnValue) == 0x000040, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, Temp_int_Array_Index_Variable) == 0x000048, "Member 'WindManager_C_ExecuteUbergraph_WindManager::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000050, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_GetAllActorsOfClass_OutActors) == 0x000060, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, K2Node_CustomEvent_EmitterTemplate) == 0x000070, "Member 'WindManager_C_ExecuteUbergraph_WindManager::K2Node_CustomEvent_EmitterTemplate' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, K2Node_CustomEvent_InTransform) == 0x000080, "Member 'WindManager_C_ExecuteUbergraph_WindManager::K2Node_CustomEvent_InTransform' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_BreakTransform_Location) == 0x0000B0, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_BreakTransform_Rotation) == 0x0000BC, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_BreakTransform_Scale) == 0x0000C8, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, Temp_int_Loop_Counter_Variable) == 0x0000D4, "Member 'WindManager_C_ExecuteUbergraph_WindManager::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0000D8, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Less_IntInt_ReturnValue) == 0x0000E0, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Add_IntInt_ReturnValue) == 0x0000E4, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, Temp_int_Loop_Counter_Variable_1) == 0x0000E8, "Member 'WindManager_C_ExecuteUbergraph_WindManager::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000EC, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, Temp_int_Loop_Counter_Variable_2) == 0x0000F0, "Member 'WindManager_C_ExecuteUbergraph_WindManager::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_GetScalarParameterValue_ReturnValue) == 0x0000F4, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000F8, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, K2Node_Event_DeltaSeconds) == 0x0000FC, "Member 'WindManager_C_ExecuteUbergraph_WindManager::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, K2Node_CustomEvent_Effect_Water_Interaction_FX) == 0x000100, "Member 'WindManager_C_ExecuteUbergraph_WindManager::K2Node_CustomEvent_Effect_Water_Interaction_FX' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, K2Node_CustomEvent_Gameplay_Wind_INteraction_Effects) == 0x000108, "Member 'WindManager_C_ExecuteUbergraph_WindManager::K2Node_CustomEvent_Gameplay_Wind_INteraction_Effects' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, Temp_int_Array_Index_Variable_1) == 0x000110, "Member 'WindManager_C_ExecuteUbergraph_WindManager::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Array_Length_ReturnValue_1) == 0x000114, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Array_Length_ReturnValue_2) == 0x000118, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Less_IntInt_ReturnValue_1) == 0x00011C, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, Temp_bool_True_if_break_was_hit_Variable) == 0x00011D, "Member 'WindManager_C_ExecuteUbergraph_WindManager::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Array_Length_ReturnValue_3) == 0x000120, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Not_PreBool_ReturnValue) == 0x000124, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_BooleanAND_ReturnValue) == 0x000125, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_IsDedicatedServer_ReturnValue) == 0x000126, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000127, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, Temp_int_Array_Index_Variable_2) == 0x000128, "Member 'WindManager_C_ExecuteUbergraph_WindManager::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Array_Get_Item) == 0x000130, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Array_Get_Item_1) == 0x000148, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Array_Length_ReturnValue_4) == 0x000150, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Less_IntInt_ReturnValue_2) == 0x000154, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, Temp_int_Loop_Counter_Variable_3) == 0x000158, "Member 'WindManager_C_ExecuteUbergraph_WindManager::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Add_IntInt_ReturnValue_3) == 0x00015C, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000160, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Array_Get_Item_2) == 0x000168, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Array_Get_Item_3) == 0x000180, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Array_Length_ReturnValue_5) == 0x000198, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Array_Length_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Array_LastIndex_ReturnValue) == 0x00019C, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Less_IntInt_ReturnValue_3) == 0x0001A0, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_BreakColor_R) == 0x0001A4, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_BreakColor_R' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_BreakColor_G) == 0x0001A8, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_BreakColor_G' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_BreakColor_B) == 0x0001AC, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_BreakColor_B' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_BreakColor_A) == 0x0001B0, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_BreakColor_A' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_BreakColor_R_1) == 0x0001B4, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_BreakColor_R_1' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_BreakColor_G_1) == 0x0001B8, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_BreakColor_G_1' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_BreakColor_B_1) == 0x0001BC, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_BreakColor_B_1' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_BreakColor_A_1) == 0x0001C0, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_BreakColor_A_1' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0001C4, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_MakeVector2D_ReturnValue) == 0x0001D0, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_BreakVector_X) == 0x0001D8, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_BreakVector_Y) == 0x0001DC, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_BreakVector_Z) == 0x0001E0, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_MakeVector2D_ReturnValue_1) == 0x0001E4, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x0001EC, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_BreakVector2D_X) == 0x0001F4, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_BreakVector2D_Y) == 0x0001F8, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Abs_ReturnValue) == 0x0001FC, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Abs_ReturnValue_1) == 0x000200, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Abs_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, Temp_int_Loop_Counter_Variable_4) == 0x000204, "Member 'WindManager_C_ExecuteUbergraph_WindManager::Temp_int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_MakeVector2D_ReturnValue_2) == 0x000208, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_MakeVector2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_BreakVector2D_X_1) == 0x000210, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_BreakVector2D_Y_1) == 0x000214, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Divide_Vector2DFloat_ReturnValue) == 0x000218, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Divide_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_FMax_ReturnValue) == 0x000220, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x000224, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_BreakVector2D_X_2) == 0x00022C, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_BreakVector2D_X_2' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_BreakVector2D_Y_2) == 0x000230, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_BreakVector2D_Y_2' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_MakeVector_ReturnValue) == 0x000234, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Less_IntInt_ReturnValue_4) == 0x000240, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Less_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x000244, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000254, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Add_IntInt_ReturnValue_4) == 0x0002DC, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, Temp_int_Array_Index_Variable_3) == 0x0002E0, "Member 'WindManager_C_ExecuteUbergraph_WindManager::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, Temp_int_Array_Index_Variable_4) == 0x0002E4, "Member 'WindManager_C_ExecuteUbergraph_WindManager::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Array_Get_Item_4) == 0x0002E8, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Array_Get_Item_5) == 0x0002F8, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_GetActorBounds_Origin) == 0x000300, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_GetActorBounds_Origin' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_GetActorBounds_BoxExtent) == 0x00030C, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_GetActorBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_GetMaterials_ReturnValue) == 0x000318, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_GetMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000328, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Array_Length_ReturnValue_6) == 0x000334, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Array_Length_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_BreakVector_X_1) == 0x000338, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_BreakVector_Y_1) == 0x00033C, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_BreakVector_Z_1) == 0x000340, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Array_Length_ReturnValue_7) == 0x000344, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Array_Length_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_FMin_ReturnValue) == 0x000348, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_FMin_ReturnValue_1) == 0x00034C, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_FMin_ReturnValue_1' has a wrong offset!");
